{"nodes": [{"id": 1723, "value": "Refer to this post for Frequently Asked Questions regarding the setup tutorial and Project 1.  The setup tutorial itself is linked on the eecs280 website.  Project 1 is due Wednesday, January 18 at 8pm.  Please keep the followups related to questions in this post only.. . Q: I get this error when trying to run VSCode on WSL (error starting the pipe progam):. . A: Try changing:. . “pipeProgram”: “c:\\windows\\sysnative\\bash.exe”,. . to. . “pipeProgram”: “/mnt/c/Windows/System32/bash.exe”,. . in the launch.json. . Q: I’m trying to debug my project with VSCode on Mac, but it’s skipping all my breakpoints. What do I do?. . A: This is a known bug in the Microsoft C/C++ extension. Try installing the `CodeLLDB` extension with the following steps:. . . In VSCode, go to the Extensions tab and search for “CodeLLDB”. . . Set your `launch.json` configuration to the following:. . . { “name”: “(lldb) Launch”,. . “type”: “lldb”,. . “request”: “launch”,. . “program”: “${workspaceFolder}/stats_tests.exe”,. . “args”: [],. . “cwd”: “${workspaceFolder}”,. . }. . Q: VSCode/macOS: Why am I unable to view console output?. . A: Try installing the `CodeLLDB` extension: https://eecs280staff.github.io/tutorials/setup_vscode.html#macos-1. . Q: I haven’t worked with vectors before - are there any recommended resources?. . A: Check out the project 1 vector tutorial https://eecs280staff.github.io/p1-stats/vector.html. . Q: My output is not printing out…what might be causing this? I am getting an “Invalid Read” or “Segmentation Fault”…what might be causing this?. . A: This is caused by an “Access-out-of-bounds” error. You are indexing past the valid elements of a vector and reading some unknown data! This is undefined behavior that computers handle differently (which is why this may fail on the autograder but not locally). Re-read your function and think about where it could index out of bounds. Write some test cases that test the bounds of the vector to help you catch the bug!. "}, {"id": 1724, "value": "After testing resize based on the details from the project specs, it works perfectly. However, on auto grader it says there is an error reading the file and I don't know why. "}, {"id": 1725, "value": "When I try to compile my stats.cpp I get this error. Any help would be greatly appreciatied!. "}, {"id": 1726, "value": "I get a 9/9 on Autotrader but only get 20/24 as my final points. I've already written many tests in test file. Is it because we need to. cover all edge cases in test file?"}, {"id": 1727, "value": "The score for project 1 still shows -/24 on my canvas, is it because my project has not been graded yet or is there something wrong?"}, {"id": 1728, "value": "Hello,. . My mode function for project 1 failed 'stats test mode 1' in the autograder. I wanted help to find the source of the error, so I can avoid it in the future. I've attached my code for my mode function (it uses the data of the summarize function, which passed all of its tests). . . Thank you. . . "}, {"id": 1729, "value": "Hello Instructors,. For some reason, I thought that there was a 2 hour grace period after the project was due at 8 pm, so I worked on it and tried submitting at 9:50, before realizing that a 2 hour grace period was not in place. Is there anything I can do to receive partial credit for a late submission? I've done the best I could with my busy schedule as I also ran for president of Club soccer tonight. This is the first project and I am super keen on doing well in this class; anything would help, thank you for your time. . . Best regards,. Suhith"}, {"id": 1730, "value": "It says in the syllabus that auto grader will grade our private tests and public tests, grading the private tests after the deadline. Does anyone know how long it will take for out private test scores to be released?"}, {"id": 1731, "value": "my submission to my autograder is not working. after i type n my uniqname and have all the correct files up"}, {"id": 1732, "value": "I'm getting this error which I don't understand because when I run my stdev() code in a different compiler, I get 1.87083, so I don't quite understand why this is happening.. "}, {"id": 1733, "value": " had a spacing error in my main just not the correct spaces between numbers when cout. Can I request an extra submission? I finished my attempts and I can get a 9/9. I don't need a feedback just submission. Thank you"}, {"id": 1734, "value": ". summary.push_back({currValue,count});. . When I try to do this in summarize I get an error that says \"expected expression.\" I have no clue why this is happening because I modeled summarize after my mode function to iterate and count through the vector. "}, {"id": 1735, "value": "I got some error output for compilation warnings part on auto grader.... I don't know how to fix those and I didn't got those error messages on my terminal even though I used sanitizer already. could someone help me with this? will this affect the output of private tests?"}, {"id": 1736, "value": "Hello,. . I am trying to implement the summarize function and I believe that I am using the right method but for some reason when I try to write:.         vp.push_back(innerVal);.         vp.push_back(frequency);.         summary.push_back(vp); --> this last line has an error \"No matching member function for call to 'push_back'\". . Does anyone know how I can fix this issue?"}, {"id": 1737, "value": ". . I am getting an \"expected expression\" error. I do not know how to fix this this was not an issue earlier"}, {"id": 1738, "value": "My summarize function passed my test cases using assert() but when I tried using a loop to print out the values, there's an error that said heap buffer overload and this is shown:. AddressSanitizer report breakpoint hit. Use 'thread info -s' to get extended information about the report.. . When I run the tests from file HCMST_ver3.04.tsv, the output was like . 1: 3009. 1: 3009. and so on,. does this mean there's an issue with my summarize function?"}, {"id": 1739, "value": "I had a spacing error in my main just not the correct spaces between numbers when cout. Can I request an extra submission? I finished my attempts and I can get a 9/9. Thank you"}, {"id": 1740, "value": "Hi, I know that it says in the syllabus that there are no regrades for the projects. However, here you can see that the only point I missed it seems like the autograder flagged me, even though I have the correct output. These two lines are the only marked ones.. . Is there any way I can still get credit for at least this part of the project? This was my last submission so I can't troubleshoot anymore. Thanks.. . "}, {"id": 1741, "value": ". . I am inputting the numbers 4,8,8,8,10,10. But when I test it it returns 2 instead of the 2.19.... with decimals. D I need to static cast anything?"}, {"id": 1742, "value": ". I am getting this error when I submit the project and I'm not sure what it means. . "}, {"id": 1743, "value": "I put the extract column after my cout and cin statements and I'm still not able to put anything in the command console. it skips through everything and prints out the cout statements without ever giving me a chance to input anything. It also says \"Error opening A\" and I don't know why A is the name given to filename because I never put anything in."}, {"id": 1744, "value": "Do we put the input redirection stuff in launch.json, main.cpp, or the terminal?"}, {"id": 1745, "value": "How do I keep my vector from going out of bounds. I am comparing a current value to the value after that but the problem I run into is that when the current value takes on the last value of the vector it will try to compare it to something outside of the vector. How do I stop this from happening. "}, {"id": 1746, "value": "When I try to run main, I never get the chance to input any of my sin statements as it just tells me \"error opening\". I have been trying everything and I know that the problem is with the extract column function but I don't know what to do.. "}, {"id": 1747, "value": ". is there any way anyone could tell me what this error means?  it is the only thing that fails"}, {"id": 1748, "value": "In project 1 will our codes be graded on the styles and comments?"}, {"id": 1749, "value": "I have been in the autograder queue for over 2 hours now (i submitted at 2:20), I was wondering if it was just backed up, or if I should leave and resubmit my files."}, {"id": 1750, "value": "Hi, so in stats.cpp there are assert(false); statements provided in the starter code, but running it causes assertion to abort. Should we modify these statements to guarantee the non-violation of the RME clauses (such as no empty vectors) or should we do something else with them? Are they required in order to guarantee private testing credit? Thank you"}, {"id": 1751, "value": "After sorting the vector and iterating through the vector with a for loop, how can I use another loop (and what kind?) to get the frequency of each number in the vector?"}, {"id": 1752, "value": "What is launch.json and how can I use it to debug? I don't really get it. My editor is VScode."}, {"id": 1753, "value": "I see that the input for the function percentile is between 0 and 1 inclusive but for the public tests on the autograder, it seems that the inputted p is greater than 0 (ie. 0, 25, 50, 75, and 100) and not between 0 and 1. The autograder is showing the 25th, 50th, 75th, and 100th as 0s and incorrect. Did anyone else have this problem?. . "}, {"id": 1754, "value": "Should our percentile function be able to calculate the percentile of an array with only one number? Also wouldn't any percentile of a single number just be the number itself?"}, {"id": 1755, "value": "My code works and compiles in VSCode, but when I upload it to autograder, it won't even run. Saying I am missing some code. Screen_Shot_2023-01-18_at_2.01.16_PM.png"}, {"id": 1756, "value": "I’m getting this error when I run my main.cpp. I think it’s happening at my extract column function. I’m not sure what to do. Thank you! 9636608C-A8DA-46A6-84EF-59CED8A49799.jpeg"}, {"id": 1757, "value": "I am trying to delete a value in a vector pair for the summarize function, however erase() does not seem to be included in the vector library, how else can I go about this?"}, {"id": 1758, "value": "My summary function is working I think, it's just when I print out the summary, it addresses outside of the vector. Is it because my loop runs i < data.size()? "}, {"id": 1759, "value": "I saw that there are no style points for Project 1. Is there anything else we need to be aware of, or does a 9/9 on the Autograder mean 100% on the project?"}, {"id": 1760, "value": "Would the mean for an empty vector be zero or undefined?"}, {"id": 1761, "value": "The project is due tonight, but does anyone know when our complete project grades (i.e. including private tests) will be released?"}, {"id": 1762, "value": "I read through what's in spec for comparing doubles. I also looked around for advice, and got conflicting answers.. . assert(abs(x - y) < epsilon). . Even though the scope of #define would be larger than const in this case, wouldn't it be better to use it for epsilon because it's pre-processed before compilation, which seems better for this type of comparison? Will we get marked down for using #define?Should I use abs() or fabs()? fabs() seems to reduce ambiguity b/c it returns a double, but spec uses abs().Spec uses 0.00001 precision for epsilon. I found advice to go far more precise on this (1e-20, aka 0.00000000000000000001) because we're doing simple statistics (and not something like trig). Is there any reason not to go more precise?"}, {"id": 1763, "value": "When I compile my program in Xcode, it reads in the HCMST_ver_3.04.tsv data, but it overflows and the program crashes. "}, {"id": 1764, "value": "do we have to comment our name or date of submission or anything on the top of our project code files"}, {"id": 1765, "value": "where do we find descriptions of each function and its require clauses??. .  someone said the stdev is required to have an input of a vector with at least 2 values, but i dont know where to find this information on the class site and i cant find it on the specs"}, {"id": 1766, "value": "Hi, I have not submitted my test case included code yet so I cannot have it checked. However, while testing my percentile function I get a result of like -14.000000004 which fails assertion when estimated to equal -14. I get a similar value for other test cases for percentile where they have a bunch of trailing zeroes and then a non-zero number but they do not fail assertion. In order to assert these and pass it, would I just have to assert it equal to the division I use? Or would this be more like an integer / double division problem? My implementation for percentile() has been submitted just not the test cases btw. Thank you."}, {"id": 1767, "value": "Whenever I compile it seems to compile fine but anytime I attempt to run the program I'm met with this error:. . terminate called after throwing an instance of 'std::invalid_argument'  what():  stodAborted. . I tried searching things online but they only showed up for stoi and not stod and so I'm really confused as to what exactly is causing this error."}, {"id": 1768, "value": "When I run my code in the terminal using the test cases and main_test_data.tsv, it works fine. But in autograder stats.cpp won't compile as it says:. stats.cpp:19:21: error: invalid initialization of non-const reference of type ‘std::vector<double>&’ from an rvalue of type ‘std::vector<double>::iterator’. . and also:. In file included from stats.cpp:13:6p1_library.h:17:32: note: in passing argument 1 of ‘void sort(std::vector<double>&)’717 | void sort(std::vector<double> &v);"}, {"id": 1769, "value": "It says Use the following wget link to download the data in tsv format: https://eecs280staff.github.io/p1-stats/data/HCMST_ver_3.04.tsv on the project spec. I am confused because when I click on the link it takes me a web page. How do I download this to get it to my p1-stats folder? Below is a picture of how the page looks when I open it:. . "}, {"id": 1770, "value": "I've noticed some other students have had this same error but with their percentile function, but somehow im having it when it's asking for the summary output. I do not know where my code is not accounting for out of bounds error, as it's stated in the autograder.. "}, {"id": 1771, "value": "When I run my code in the terminal, all my stats match the .correct file perfectly. Pay special attention to the percentile values.. However, when I submit to Autograder, it is wrong. I did not touch my code between taking these screenshots.. Any suggestions? Does this have something to do with input redirection? I am struggling to wrap my head around that concept. For context, my percentile function does not use cin. Somehow it just works in the terminal (but apparently not on Autograder!)."}, {"id": 1772, "value": "I am getting an error that says cout is ambiguous. This apparently is from what I am including. Do I have something here that is causing the error?. . "}, {"id": 1773, "value": "Posting Privately to instructors: Function passes all public tests, however is failing the private tests I wrote when negative numbers are in the mix. For instance when the correct output is supposed to be -5, the function outputs -4 "}, {"id": 1774, "value": "After fixing my summarize function, I decided to run it however, it kept saying vector out of bounds, even though I set a condition for it to end before it even reaches the end. I tried returning it in the else statement, but it was still out of bounds. Then, I tried moving my if statement to before the loop starts, but still, it is out of bounds. I am having difficulty understanding the cause since I am not going to an empty vector or looking at the next position. "}, {"id": 1775, "value": "I do not even know what to say to accompany this image.. "}, {"id": 1776, "value": ""}, {"id": 1777, "value": "I am following the guidelines to print out the summarize function, however, I am confused by the error I am getting. I tried following an instructor's advice on a similar thread but it didn't help me much. Thank you.Screen_Shot_2023-01-17_at_10.06.49_PM.png"}, {"id": 1778, "value": ". I am getting an error that says cannot overloade function based on return type alone. I am not sure what this means and couldn't find any other posts about it. Can you help me determine what is casuing this?. "}, {"id": 1779, "value": "I was wondering how our private tests will be graded. One of my test's assert calls is causing an abort even though it is calculating the correct number, it may be because the value is a long decimal number, but will I not get the points on autograder if abort gets called?"}, {"id": 1780, "value": "I've tried to read main_test.in, but I can't see the output on terminal or on my console. I've tried: make main.exe followed by ./main.exe. . I'm on Xcode. I've also done the input redirection: ./main.exe < main_test.in.. . In main, I used string and cin for filename and column_name followed by.  vector<double> file = extract_column(filename, column_name);. "}, {"id": 1781, "value": "How do I read in files without including fstream?"}, {"id": 1782, "value": "I am currently trying to get through my own test runs of my project and my file is struggling to open the main_test_data.tsv file on Xcode. It runs on my terminal and within the compiler on the autograder. My problem arises when I am trying to get through main_public_tests and stats_public_tests. It doesn't allow me to open the file and I am unaware where the problem could be arising on my end. My uniqname is Mclaurin."}, {"id": 1783, "value": "I thought that I had fixed this error, but I was logged out of my user and cant seem to log back in. I made a new user named slohan, which was the same name as my previous user, but now at the end of the line it includes /root$: and now I am unable to access my Desktop to actually start VSCode correctly, and so I have not been able to run my code at all. "}, {"id": 1784, "value": "Are these compile errors a result of excluding the wrong files, or is there something else I am doing wrong in the setup and build? Anyone know what this means and how to fix it?. . How do I know which files to exclude when building my solutions?. . . "}, {"id": 1785, "value": "If I get a 9/9 on autograder will that be my final grade, or will anything else be taken into account?"}, {"id": 1786, "value": "Hi, when I run my code on Ubuntu the output matches the one provided in the example. However, when I submitted it to the autograder, it omitted the part with the 100th percentile. I was wondering how I can fix this.. . . "}, {"id": 1787, "value": "I am writing stats-test.cpp, and I want to write a test function to make sure that empty vectors are handled correctly(assertion will fail in stats.cpp functions). So I want to write a test function with an empty vector, but how do I assert that the assertion in the function I'm trying to test fails? Is assert(!sum(v)) valid?"}, {"id": 1788, "value": "/Users/ethenhuhn/Downloads/starter-files 2/EECs 280 Project 1/p1-stats/stats.cpp:35:14 Implicit conversion loses integer precision: 'std::vector<double>::size_type' (aka 'unsigned long') to 'int'"}, {"id": 1789, "value": "Are the undefined behavior checks on autograder for points? it doesn't have a score next to it right now, will it stay that way?"}, {"id": 1790, "value": "Hi! I am having a bit of trouble with getting the summarize function to pass my tests. It could definitely be an issue with my actual function but I just want to make sure my tests are written correctly so I don't spend time trying to fix my function if the test is the real problem. . . Can I use the \"==\" operator to check if two vectors of pairs are equal? . . This is the code for my test: . Thank you!. "}, {"id": 1791, "value": ". I got a 9/9 on autograder, however I keep getting errors for running stats_public_test and main public test. It complies and runs on vscode and the computer terminal, but on autograder it keeps giving me this error. . "}, {"id": 1792, "value": "I am testing my code by using the HCMST_ver_3.04.tsv file with column qflag for the input for main.exe. My terminal prints the output for the summary, count, sum, mean, stdev, and median lines. However it appears that once it starts trying to run the mode function it stalls for a while (like 5+ minutes) before finally outputting the mode and the rest of the analysis, leading me to think that my mode function is struggling to handle the large amount of data from the file (this isn't an issue with small data sets). Should I be worried about this and is there anything I can do to fix it?"}, {"id": 1793, "value": "Would it be a syntax error?. "}, {"id": 1794, "value": "I looked at piazza posts but still wanted to verify this since I couldn't find a clear confirmed answer.. . . . If p is 0 to 1 inclusive, does that mean we do not have to do the P100 part of the equation for n? That Is what I am assuming since a number 0 to 100 inclusive divided by 100 results in a number 0 to 1 inclusive (p). For example, if 0.25 was inputted for p, would that just mean it's the 25th percentile (25/100 = 0.25)?. . If so, we could just take p multiple by n-1 and then plus 1, and use that n value to do the second equation (vp)? "}, {"id": 1795, "value": "I have been trying to compile stats.cpp and I am getting the error \"No rule to make target `stats.exe'.  Stop.\" I have seen a lot of posts related to this saying that the makefile has to be in the same directory as stats.cpp, and that the terminal has to be in the specific project directory, but I have done both of these things and am still getting the same error. "}, {"id": 1796, "value": "Im having an issue with the cin/freopen part of the code. My code compiles it just wont enter/allow me to enter the filename/column names into it. How do I fix this?"}, {"id": 1797, "value": "When I put \".  string filename;.  string column_name;.  vector<double> n = extract_column(filename, column_name);\". in main.cpp, it keep saying error opening. I do have \"p1_library.h\" included in main.cpp. How can I fix this?"}, {"id": 1798, "value": "Hi there! Are we required to add comments for our code in our solutions? Doe no commenting result in the loss of points? Much appreciated."}, {"id": 1799, "value": "do we have to make sure our code's curly braces are in the right order and no excess comments? Or does it not matter for this project"}, {"id": 1800, "value": "I am fully passing the first UB check, but I am still failing the second UB check. However, now it is printing out everything normally in the IDE, but the 100th percentile in the auto grader is not printing.  What should I do now?. "}, {"id": 1801, "value": "I failed in main public test and UB checks but I cannot see why. I have the same output as the expected output. Can someone tell me what's my problem?"}, {"id": 1802, "value": "Should our percentile function be able to run cases when using negative numbers? Because my negative value test cases are not working and I'm a bit confused"}, {"id": 1803, "value": ". . I get this error when I put make test in the terminal. The median is not correct so does it automatically crash the program when the assert is not equal to what it's supposed to be?"}, {"id": 1804, "value": "My code is working whenever I test it and is working for the other test, but I'm not sure why this is not even printing out that it is reading column b from main_test_data.tsv. I looked at the other piazza posts but nobody else seems to have this problem.  "}, {"id": 1805, "value": "Does our code need to have comments? Will we be graded on style?"}, {"id": 1806, "value": "summarize() and mode() function seem to be keeping track of numbers that are occurring in the vector only for different purposes. I don't really get how I can approach these problems and how I can use nested loops on these functions. Can anyone help me with this and give an idea about how to approach this problem?"}, {"id": 1807, "value": "If the requirement says \"v is not empty\", do we need to consider the case that v is empty when we implement the function? For example: If (v.size( ) != 0) {...}. . In lecture 2 slides I see that \"The function implementation only needs to cover cases allowed by the interface's REQUIRES clause\". But in question @140, the answer confuses me a little bit. "}, {"id": 1808, "value": "hello, im posting this to the instructors only since my actually test cases are here, I am pretty sure I can but if not please let me know I will delete my question immediately. Nonetheless, is our percentile function supposed to work with negative numbers, because my last test case keeps failing and I am very confused, am I missing something?. . . void test_percentile_small_data_set() {.     cout << \"TEST PERCENTILE\" << endl;.     .     assert(percentile({15, 20, 35, 40, 50}, 0.40) == 29);.     cout << \"0 PASS!\" << endl;.     .     assert(percentile({0, 3}, 0.0) == 0);.     cout << \"1 PASS!\" << endl;.     .     assert(percentile({0, 3}, 1) == 3);.     cout << \"2 PASS!\" << endl;.     .     assert(percentile({300}, 0.6) == 300);.     cout << \"3 PASS!\" << endl;.     .    // TEST CASE WITH NEGATIVES DOESNT WORK ?.    // THIS TEST FAILED.     assert(percentile({-782, -73, 0, 3, 20}, 0.60) == 1.8);.     cout << \"4 PASS!\" << endl;. }"}, {"id": 1809, "value": "My code won't compile, the first issue is:. no rule to process file '/Users/ethenhuhn/Downloads/starter-files 3/Makefile' of type 'sourcecode.make' for architecture 'arm64'. and then a bunch of vector errors like:. Undefined symbol: percentile(std::__1::vector<double, std::__1::allocator<double> >, double)"}, {"id": 1810, "value": "When I try to read the columns from the HCMST_ver_3.04.tsv file, I am getting a heap-buffer-overflow from the address sanitizer right after it executes my summarize function. I am confused because this function works for my test cases and the autograder and I don't think my for loops are going out of bounds at all. I know it is a problem within the summarize function because I commented it out and all the other code works perfectly with that file. Is there any way to fix this error?"}, {"id": 1811, "value": "Hi I would like to confirm that for project 1, we are not being graded for the test cases that we write? If I were to leave stats_tests.cpp blank, would I be penalized?"}, {"id": 1812, "value": "Good afternoon,. . I am having a bit of trouble with both of the UB checks on the auto grader. . . I am not sure what is going wrong. When running the code on VS Code, it is coming out just fine in the main_test.out file. How should I proceed?. . . . "}, {"id": 1813, "value": "Hi! I just read up on the floating point comparisons in the references section in the spec. Do I need to include this in my test cases or will be fine without it? "}, {"id": 1814, "value": "I am getting this error. . . I have already tried . 1. Following the directions on the p1-stats and changing my launch.json program to. . \"program\": \"${workspaceFolder}/stats_tests.exe\",. 2. Looking through the piazza for a similar problem. . "}, {"id": 1815, "value": "for the percentile function, are we expected to just output the percentiles for 25,50,75 and 100? or are we expected to write a function that accepts in a value of p and calculates based on that? i'm a bit confused."}, {"id": 1816, "value": "I initialized the vectors like the example given in the project spec but this error is occurring and I'm not sure what the solution is. "}, {"id": 1817, "value": "My percentile function works and gives the correct output when it reads in the main_test_data.tsv file. But when I try reading values from the HCMST file, it gives me 75th percentile = 2 and 100th percentile = 1. The project spec gives the opposite 75th = 1 and 100th =2.. . I was wondering why this could be, as it works fine for the main_test_data.tsv. "}, {"id": 1818, "value": ". . The only other error I am getting when I try to run main.exe is the call to sum which we are already given in main.cpp. It worked before so I am not sure why it's not working now. "}, {"id": 1819, "value": ". . I tried to run make main.exe and I keep getting these errors. I declared and defined columname and filename and I have my #include at the top so that shouldn't be an issue"}, {"id": 1820, "value": "i want to write some test cases for the percentile function, but i don't know how to calculate it by hand to figure out if the output my code is giving is right. is there a website or online calculator that can tell me what the percentile would equal given a list of numbers and a p value? "}, {"id": 1821, "value": "if a vector only has one number, would the mode just be that number?"}, {"id": 1822, "value": ".  I'm getting this error when I compile main. It prints out everything but doesn't read in input from the file even though I set up input redirection. I'm using Xcode . "}, {"id": 1823, "value": "Could anyone check my percentile code to tell me what is wrong with it? It passes the 20th and 60th percentile tests for my data3 test cases in stats_cpp but fails the 25th, 50th, and 75th. . . Uniqname: nabeelsz "}, {"id": 1824, "value": "Screenshot_(107).png. Screenshot_(108).png. . A bit confused as to why \"10: 1\" isn't being printed. . Thank you in advance. . EDIT: figured it out! unsure how to delete piazza post"}, {"id": 1825, "value": "Should we use assert to test all functions?"}, {"id": 1826, "value": "My computer updated and all of a sudden several errors popped up whenever #include appeared. I have attached screenshots.. . "}, {"id": 1827, "value": "I'm a little confused as to how we can assert in the test cases of the summarize function since this function returns a vector of pairs rather than a single double output. Do we need to check and assert each element in this vector?"}, {"id": 1828, "value": "I don't understand why I'm getting the following error even after I have \"stats.h\" and \"p1_library.h\" included in all 3 files. I've implemented my test cases in stats_tests.cpp and called them all in main(). I also implemented all the function definitions in stats.cpp. I don't know why I'm still getting the undefined symbols error. . . "}, {"id": 1829, "value": "Hi, I need some assistance with project one but unfortunately, I have class during all of the office hour times. Is there any other way I can get some help? My uniquename is ehuhn if that's helpful. Thank you."}, {"id": 1830, "value": "I was having trouble figuring out what the issues were with my summarize function and my mode function. I especially noticed it when I was trying to write my test cases with assert. I was wondering how I should approach this?. The test function for summarize that I'm trying to write is below: . . I also have my mode function and test case for that as well. I'm not sure if the issues are related for both of these functions? . . Below is the test case for mode. Thank you"}, {"id": 1831, "value": "hi! i'm currently testing my main.cpp function with diff in the command line, and i'm getting the following output. i'm not sure what it means or what it's saying is wrong, so i'd appreciate any help on that. i'm attaching a screenshot below. . . thanks! . . "}, {"id": 1832, "value": "Will the Stats Private Tests be graded? If so, how will it be graded?. . For example, do we need to write tests for every single circumstance listed here(grey) to get full credits? Or can we just write a few tests but not necessarily meeting every test case to get full credit?. . "}, {"id": 1833, "value": "Does mode() use summarize() ?"}, {"id": 1834, "value": "Do we need to use pointers to complete this project and get an 100%?. . "}, {"id": 1835, "value": "Hello!. . I'm having some issues with my standard deviation function. I'm getting values very close to what they should be, but they are off by around 0.1-0.2. I followed the formula on the wikipedia link, but I'm not able to get the right value."}, {"id": 1836, "value": "I'm a little bit confused. What am I supposed to have under the \"Add prototypes for your test functions here\" header and the \"Add test function implementations here\" header? I wrote all my test functions under prototypes and called them under int main(), but am unsure what to do about the last header."}, {"id": 1837, "value": "Hi, . . Was just curious as to why algorithms aren't allowed in proj1. And will they be allowed in future projects?. . Thanks"}, {"id": 1838, "value": "When I try and run my debugger to step through my test cases that are failing, the variable section on the lefthand side just constantly loads and there is no way for me to view the variables or use any debugger function. I have already tried resetting my computer, but nothing has helped the variables to load. I have attached a screenshot of what I am talking about.. . "}, {"id": 1839, "value": "I get this when I submit the files to autograder. I am not sure what it means or how to solve it. Can someone please help?. . . Also, what was the code example to assert and compare two double values for example for standard deviation to avoid rounding errors?. . Thank you."}, {"id": 1840, "value": "Screen_Shot_2023-01-16_at_5.23.37_PM.png. Screen_Shot_2023-01-16_at_5.27.53_PM.png. . my summarize function works for one of my tests but has a segmentation error for another one and im not really sure if the bug is in the way I wrote the tests or if its in my summarize function. The first screenshot has my tests and the output and the second is my summarize function. . "}, {"id": 1841, "value": "i'm passing all tests on autograder except for the UB checks. these are the errors i'm getting for stats public test and main public test respectively. . . . . "}, {"id": 1842, "value": "will the coding style be graded? do we need to add comments?"}, {"id": 1843, "value": "Hello, so I was having trouble using push_back with a vector<pair<>> variable, however looking more into std I found a function, std::make_pair, that now lets me push back into the vector<pair<>> variable and is no longer allowing giving me issues. I was wondering as I can't find any further information about make_pair, will make_pair still allow me to call something like myVec[0][0] to give a summary of a number and it's frequency or should I look to find another way around without using make_pair?"}, {"id": 1844, "value": "when I run my stdev function, when I input the vector with same value, for example,{1,1,1,1}. It will turn out nan instead of 0.. I'm wondering is it ok? If not, how can I solve it?. . Thanks.. . "}, {"id": 1845, "value": "I’ve tried reading other questions on the topic, but I was wondering if our stats_tests.cpp is graded for project one, I know later on in the semester we are graded on if our tests expose hidden bugs. I know this is frowned upon but I ran my functions  on replit which I found easier to change the vector and test my functions more there, before putting the code into x code. I’m getting a 9/9 on the auto grader at the moment but don’t want to get marked down if my tests in stats_tests.cpp are lacking"}, {"id": 1846, "value": "What is my error here? I've checked whitespace and it appears to be the same. Everything else in autograder has worked 100% and there are no other problems with this test either.. "}, {"id": 1847, "value": "I was submitting my code to autograder before writing the summarize function and my code was running and outputting the correct values in the main public tests (other than the summarize part). I tried to write the summarize function and test again and now I am getting this error in my terminal: Segmentation fault: 11 and no output in autograder. I tried changing the bounds of my loop in the summarize function as I saw that this error corresponds to trying to access something that is out of bounds, but that has not changed anything. Also, when I submit to autograder now, nothing is outputted. Can someone look at my code in autograder and help me with this problem? Thank you!!"}, {"id": 1848, "value": "I'm getting this error when I try and run my test cases and I'm not sure what this means. I've basically tried to call the count() function following the example of the sum() function which was assert(sum(data) == n), but replaced sum() with count(). . . "}, {"id": 1849, "value": "When I call my test function from main it uses my stats functions and runs fine and passes the asserts but when I call my stats functions from main it returns 0 or \"nan\". does anyone know what this could be or how to fix it?"}, {"id": 1850, "value": "I am having an issue with the assert function in stats_tests.cpp. It was working ok for the first few tests and then it started giving me this error message: . . I am not sure what to do to fix it. Let me know! "}, {"id": 1851, "value": "l am not able to execute the launch.json "}, {"id": 1852, "value": "My main.cpp is not detected when I submit it to autograder . It says missing file main.cpp even though I uploaded a file called main.cpp"}, {"id": 1853, "value": "Can we use built-in C++ functions for some of the simpler functions like count, min, and max, which would result in the function implementation being one line, or would you (the instructors) prefer we not do that and instead use our own for loops?"}, {"id": 1854, "value": "i keep getting a linker command error, and i'm unsure of how to fix it. any suggestions?"}, {"id": 1855, "value": "I know that for (int i = 0; i < v.size(); ++i) { } might cause some errors and size_t and int are different. I want to ask whether return v.size() in a int function is valid or not. I write my count() function in this way and it seems that everything compiles successfully. "}, {"id": 1856, "value": "Should all our test cases for each function be in one function, or should each individual test case have its own function? For example, if I have three test cases for median, can they all be in one test_median function or should they be in 3 separate functions?"}, {"id": 1857, "value": "Hello, what does a vector of size 0 look like? I am trying to add more test cases for the private tests, and saw on piazza a test case with vector of size 0 is recommended to have"}, {"id": 1858, "value": "When I run my code in Xcode, it say's \"build succeeded\", however nothing comes up in my console. How am able to see if my functions are correct or if my tests are good? I want to test my functions in the stats.cpp.  The only that shows up in the console is \"Hello World\" from main."}, {"id": 1859, "value": "I met the \"out-of-bound\" issue with 100th percentile after I submitted to autograder, but now I've already realized how to solve it. I just wonder why this issue wasn't detected by assert( ) in my test cases. I did write test cases with 100th percentile, but all test cases passed. There was no warning about the index and the value for 100th percentile returns. "}, {"id": 1860, "value": "My percentile function seems to be wrong when it comes to my data2 test case, could someone look at my code and tell me why it's wrong? I tried to follow the equation but I was confused by it as well. . . . uniqname: nabeelsz"}, {"id": 1861, "value": "I am able to compile my code however, when I try running it, it says permission denied. I tried looking at other piazza posts on similar topics however, none of them were helpful. I have a macOS"}, {"id": 1862, "value": "I got this dark and ~ominous~ error message while testing my percentile function. I tried debugging but the debugger simply shuts down and freezes when it gets to the last line of my percentile() function. Anybody know what this error code means, and where to start with fixing it?. . "}, {"id": 1863, "value": "I'm getting confused on what vectors summarize and main are supposed to take in and return. . . Am I correct that summarize is meant to take in the input vector of doubles (vector<vector<double>>), count the values and frequencies, and store them in a vector of pairs (vector<pair<double, int>>).. . Main is supposed to take the vector of pairs,  access, and print each element from each pair in the vector of pairs returned by summarize. "}, {"id": 1864, "value": "I was wondering whether the stats_tests are graded by more than just the autograder. Are we graded on the quality of our tests or are the compilation warnings the only tests that the stats_tests need to pass? I hope that makes sense.. . "}, {"id": 1865, "value": "I've been working on my summarize function, and I debugged the loop I was working on, and even though I had the condition of a variable < v.size(), and the debugger told me that the values were variable = 5 and v.size() = 5 (based on my test case which has 5 values), my code still went into the loop instead of moving out of the loop, even though 5 < 5 is not true. is there anything that I'm missing or anything that I can do to go about fixing this?"}, {"id": 1866, "value": "How do I fix this error? Error: error build: Build input file cannot be found: '......' Did you forget to declare this file as an output of a script phase or custom build rule which produces it?"}, {"id": 1867, "value": "I'm having a hard time understanding what I need to put in main.cpp. Based on the specs I'm understanding that that's where we call our summarize() function. Is that it or do we have to include the other functions as well? "}, {"id": 1868, "value": "My test cases for mean( ) failed. I tried to cout << mean(data1) and it shows 1.65. But assert(mean(data1) == 1.65) failed. . In addition, I want to ask whether (for example) assert(mean(data2) == 7/3) would affect the result since there is a fraction. I choose to use a fraction because I don't know how many decimal places should I use. . . . "}, {"id": 1869, "value": "I have a vector of pairs that is set equal to the summarize function on the input vector but I'm getting this error:Then when I use .first and .second to access each element within the vector of pairs like the spec shows and I'm getting this error. . . . Any idea how to fix this?. . "}, {"id": 1870, "value": "So I know that for all functions there has to be a vector so that is a requirement. How do I tell my program that. Here is my code for mode as an example. I tried using assert.. . . double mode(vector<double> v) {. . vector<double> v;. assert(v.empty==false);. int mode;. int highest_frequency=0;. for (size_t i=0;i<v.size();i++). {. int count=1;. int current_value=v[i];. for (;v[i]==v[i+1];i++). {. count++;. }. if(count>highest_frequency). {. highest_frequency=count;. mode=current_value;. }. }. return mode;. }. "}, {"id": 1871, "value": "Uniqname: bmahesri. I’m having an issue producing an output for the 100th percentile in the percentile function. The function is able to print an output for every other percentile but not 100 and the program prints an error message for heap buffer overflow on line 212 of stats.cpp.. . "}, {"id": 1872, "value": "What should we do if given a negative p value for the percentile function? Excel says that it's not possible to calculate the percentile for a negative p value, which is why I'm a bit confused."}, {"id": 1873, "value": "When the project is checked, is the very last submission checked or all of them?"}, {"id": 1874, "value": "I'm having trouble knowing what/how to print in main from my summarize function. I'm getting the input vector, the individual value-frequency pair vector, and the output vector of pairs all mixed up. I see this hint on the spec. What would this snippet print?. . I'm specifically confused on what the \"vp[\" << i <<\"] part is doing. . "}, {"id": 1875, "value": "Do we need our tests cases in stats_tests.cpp for full credit? Or is it there just for our own good? What happens if we do not have any test cases for this project?"}, {"id": 1876, "value": "I have been able to compile my main.cpp file but I am not able to ./main.exe. I am getting just this error message:. . "}, {"id": 1877, "value": "Are there style points for project 1 or will it just be the public and private tests? If there are style points, where can I find guidelines regarding style?"}, {"id": 1878, "value": "I tried downloading and testing my program using HCMST_ver_3.04.tsv as recommended in the spec, but the columns that the spec used as examples were empty in the files I downloaded. Does anyone know why?"}, {"id": 1879, "value": ". Is there a certain library I need to include to define a vector of pairs? I keep getting this error and I'm not sure why. It says that the type name is not allowed."}, {"id": 1880, "value": "I was gettting the error 'the value of midebuggerpath is invalid' and when i followed another students similar question and succesful result of deleting the lines past 'MIMODE' I was met with this message.  Does anyone have any advice?"}, {"id": 1881, "value": "Hi there,. My stdev function returns different values for the same inputs. I will run the function without changing anything about any of the code and I'll receive different answers.. About 1/2 of the time it will return the correct expected value, but other times it may return inf or some very large or small numbers that couldn't possibly be correct. . . For example, for the input data {-1, 1} I've gotten output stdev = 1.41421 (expected value), as well as inf, and 1.15792e+77.. . Does anyone know why this might be happening or how to fix it?. Thanks!"}, {"id": 1882, "value": "Why can't I type cout or endl in stats.cpp?. "}, {"id": 1883, "value": "Currently, the output for both of the UB checks are completely different from when I run the exe files in my terminal. Also, debugging it, I really cannot see where the summarize function (which was at one point noted because an error pointed to stats.cpp line 28) indexes out of bounds.. . I tried to limit the counting variables I have so far, and generally stepping through my code using main_test_data.tsv. I'd really appreciate any pointers!. . Screen_Shot_2023-01-15_at_3.04.18_PM.pngScreen_Shot_2023-01-15_at_3.05.07_PM.png"}, {"id": 1884, "value": "Is summarize supposed to print anything? and if it is supposed to print the vector pairs out, then how do we make it so that it doesn't do that when we use it for the mode function? "}, {"id": 1885, "value": "I'm having problems with extract_column. I haven't changed anything with the function in the library, but when I call extract_column I get an error saying \"error opening main_test_data.tsv\" I use visual studio.. . I have tried the debugger, and my cin statements correctly take input and update my strings, the error is coming from the code that I didn't write in p1_library.cpp. It doesn't tell me why, however, just that there is an error in opening."}, {"id": 1886, "value": "On Visual Studio when I try to run stats_tests.cpp (main.cpp and stats_public_test.cpp are excluded) I get a build error message which says the system can't find \"p1-stats.exe\". I do not get this error when stats_tests.cpp is excluded and I'm running the public tests. I have written my stats.cpp implementation but I can't test them in the Visual Studio debugger. However, I can run the tests in the Ubuntu terminal after $ make stats_tests.exe and $ ./stats_tests.exe. Any idea how to fix this?. . "}, {"id": 1887, "value": "If the input for the percentile variable is outside the range of 0-1, do we set the output to be the first element of the vector when it is smaller than 0 and set it to be the last element when it is greater than 1?"}, {"id": 1888, "value": "When creating a test case for summary, I created my data like this:. . for(int i = 0; i < 4; i++){. data.push_back((i + 1) * 2.2);. data.push_back((i + 1) * 1.1);. }. which should produce this output: . . //outputs 1.1, 2.2, 2.2, 3.3, 4.4, 4.4, 6.6, 8.8,. . . . However, when I tried to assert my summarize function, I didn't pass the test case. I even printed the values in both the test case and the actual function to make sure that they matched, and they did.. . I then manually inputted these exact same numbers like this:. . . data.push_back(1.1);. data.push_back(2.2);. data.push_back(2.2);. data.push_back(3.3);. data.push_back(4.4);. data.push_back(4.4);. data.push_back(6.6);. data.push_back(8.8);. And then I ran the test case and I passed. Why is it that the for loop method of adding in these numbers didn't work? Is there a small error I am not seeing or is it something about c++ I just don't understand?. Thanks.. . "}, {"id": 1889, "value": "I’m confused on what the summarize function is supposed to do, i don’t understand the description on the specs . . and what is a pair? is it a structure or a regular variable type,. "}, {"id": 1890, "value": "When I typed make main.exe in the terminal, this error message showed up:. *** No rule to make target `main.exe'.  Stop. I do have a main.cpp file and it prints out \"hello world\". However when I did pwd, ls, and ls p1-stats, it said \"no such file or directory.\". . I'm also not able to see the errors in stats_test.cpp until I use the autograder.. . Can someone help me figure out what's wrong?"}, {"id": 1891, "value": ". . I tried to run either the original file and my written version with make stats.exe in the terminal and it turns out this error. Can anyone help me with this?"}, {"id": 1892, "value": "When I try to type make main.exe, I get the error \"No rule to make target 'main.cpp', needed by 'main.exe'. Stop.. I saw another question like this on Piazza and an instructor responded by saying the main.cpp may not have been created yet. I have already created main.cpp and it output \"hello world.\" Is there anything else that could cause this?"}, {"id": 1893, "value": ""}, {"id": 1894, "value": ""}, {"id": 1895, "value": "I was wondering if I could ask for some tips for summarize, I'm getting the 7 through 10 but can't get the first element (6). And i'm not sure how to fix it without accessing outside the bounds."}, {"id": 1896, "value": ". I thought I did the calculation wrong and tried to debug the problem. I tried to do the same problem on a standard deviation calculator and found that my answer is correct. Is this because there was some rounding I needed to do before?. I made sure I used 6,7,8,9,10 as elements for the standard deviation."}, {"id": 1897, "value": "I don't really get what I should put in \"program\" and \"cwd\". . "}, {"id": 1898, "value": ""}, {"id": 1899, "value": "I know how to print put the summary in main and I've written test cases for the function that all pass; however, when I run main, the summary is printed sometimes and sometimes it's not. I'm not understanding why it's skipping over that part of my code by chance. This caused it to fail in autograder for undefined behavior."}, {"id": 1900, "value": ""}, {"id": 1901, "value": "I rewrote my mode function and it gives me an error of a heap overflow beginning on line 74, but I don't see where I would be indexing out of bounds.. Screen_Shot_2023-01-14_at_7.36.39_PM.png"}, {"id": 1902, "value": "In the terminal when I type $ make stats_tests.exe I get a message saying \"make: Warning: File 'stats_tests.cpp' has modification time 439 s in the future\" and \"make: warning:  Clock skew detected.  Your build may be incomplete.\" When I type $ date, the terminal believes the current time is about 7 minutes prior to the actual current time. Is there any way I can go about fixing this?"}, {"id": 1903, "value": "Would any percentile of a data set of length 1 result in that number? For example, would the 50th percentile of {15} return 15?. Also, is the 0th percentile always the first value in the sorted vector?"}, {"id": 1904, "value": "I am struggling to understand what this error message is trying to say.. . . Is it saying that it can't find the function (I did include cmath) or that one or both of my parameters are wrong?. "}, {"id": 1905, "value": "Is there a certain format we should write our test cases in? Or does the autograder only have certain formats it will read in?"}, {"id": 1906, "value": "I am currently working on the test cases for my standard deviation function and I noticed that when I run my test cases, all of my doubles immediately get either rounded down or truncated- I cannot tell. For example, when I try and make the function return 4.4, it returns four. Is there any way around this? Thank you! . . . This is an example of 4.4 becoming 4 when I run my code. . . Screen_Shot_2023-01-14_at_6.00.24_PM.pngScreen_Shot_2023-01-14_at_6.00.35_PM.png"}, {"id": 1907, "value": "What is the difference?. . . Both of the lines are exactly the same but its giving me an error, saying the answer is NOT 41.5???"}, {"id": 1908, "value": "I'm confused on how to test the summarize function. I understand that I'd make a vector and add values to it to test the summarize function. But after that, how would I go about writing the assert statement? Would I just type out the expected vector of pairs using brackets and comma separated pairs, and then put that on the right of the equals signs in my assertion statement?"}, {"id": 1909, "value": "Hello, I was just wondering how the private test cases are scored. As of now, I have a 9/9 on autograder with everything blue (no orange partials).  In order to get credit for all of the private test cases, do I just need to write test cases in stats_tests.cpp? Like do the private test cases rely on the staff implemented stats.cpp and we just have to exploit the correct edge cases and other mutations in stats_tests.cpp? Thank you!"}, {"id": 1910, "value": "trying to debug a later line of code in main.cpp and xcode seems to keep aborting at this point and cannot get past this point to debug. "}, {"id": 1911, "value": "Hi I'm not sure what's the difference. And just to double check, I'm not putting a new line after 100th percentile line. . . "}, {"id": 1912, "value": ". . This is my code for my main function and output. So I need help with letting the program pick the largest counter and its associated value. Also, I need to find a way so that if both counters are equal pick the one with the smallest value which means the computer has to know that this counter is associated with this value. I don't know how to link counter to the value associated with it. "}, {"id": 1913, "value": "My main.cpp file is failing on the autograder for the main public (UB checks) test on my percentile function (the last print statement for the 100th percentile isn't printing because it gives an out of bounds error). However, the main public test in the autograder and my own test case prints it out fine. How is the main public (UB checks) test different from the main public test?. . . Edit: I figured it out. The program was getting stuck on an out of bounds error because I was trying to reference v[v.size()] but since it was being multiplied by 0 it didn't get caught in the normal main public test."}, {"id": 1914, "value": "Hi,. . My code is running without any compiler errors, and when I test it, it prints the desired results. However, when I submit to Autograder, the last line which states the 100th percentile is not printing out which is confusing me right now.. . Does anyone know why this could be happening?"}, {"id": 1915, "value": "I'm using Visual Studio for Project 1 (because I'm still trying to fix some issues I'm having with VS Code) and I followed the exclusion instructions. When I exclude main.cpp and stats_tests.cpp, my program compiles just fine, but when I try the other combination and exclude main.cpp and stats_public_tests.cpp I get the error message shown below. What does it mean and how do I fix it?. "}, {"id": 1916, "value": "If the input vector is empty, should our output vector still indicate that the count is equal to 0? The stats.h file indicates that the summarize function requires a nonempty vector, and since that is the first thing that the program outputs, I would assume that it would stop running as soon as the vector is recognized as empty. However, this also means that it wouldn't get to the count function, so I just wanted to check if we should be writing our program in a way such that it would output the count before failing the other functions? Thank you!"}, {"id": 1917, "value": ". . I am getting this weird output when I try to use input/output redirection to test my program. I have talked to a couple IA's already  and the consensus seemed to be I should not worry too much about it.... one hypothesized that it is a result of some minuscule white-space that may have somehow been transferred to my file at some point and therefore is causing my file to be slightly different. I just wanted to see if there are any other suggestions as to why the two files might be different when I run this test at the command line. For reference, my code is passing the autograder public test, all my other test cases are working, and even when I manually copy and paste the output from these files into diff checker online there is no difference. Just wondering if anyone has any tips to sort this out. Thank you!"}, {"id": 1918, "value": "Someone told me that we had to do something called unit testing for this project. Is that true? Or can we just do it like how we did before where we had multiple tests for each function in stats.cpp. . . Sorry if that was unclear"}, {"id": 1919, "value": "When I finished my project and prepared to submit, I couldn't find where my p1-stats files were stored. Even if I copy the file path in vs code and try to open it using wslview, it just says the file doesn't exist."}, {"id": 1920, "value": "I am getting an when I try to set up project 1 on Xcode in \"allocator_traits\" and \"vector\" and I'm not sure what to do because I followed all of the instructions. Some of the error messages that I get are \"error build: 'pointer' is a protected member of 'std::__vector_base<double, int>'\", \" error build: 'reference' is a protected member of 'std::__vector_base<double, int>'\", \"error build: Type 'std::allocator_traits<int>::allocator_type' (aka 'int') cannot be used prior to '::' because it has no members\" and more. "}, {"id": 1921, "value": "Hi, I'm meeting errors in stats_tests, it says all my functions are not defined but I've finished writing in cpp.. . The files I include in stats_tests.cpp and the error message are as shown in the image. . . "}, {"id": 1922, "value": "I try to implement the summarize function in main by using the dot operators .first and .second, but when I try to do that this error pops up. Is there a way to get the dot operator to work?. . Screen_Shot_2023-01-13_at_10.21.22_PM.png"}, {"id": 1923, "value": "I have an error that says undefined symbol: sort() then I commented out the sort() in my stats.cpp and the build succeeded. I've already included \"stats.h\" in the header for stats.cpp but not for main.cpp. I'm still very confused why we have a separate file for main.cpp and a main_test.out.correct file. Are we expected to create vectors in main.cpp and call each function individually to test them? "}, {"id": 1924, "value": "There's an error on line 33 when I try to call the summarize function, and I can't seem to figure out why. the error says. . . . "}, {"id": 1925, "value": "using namespace std;. int main(). {.     vector <double> v={1.0,2.0,2.0,3.0,2.0,2.0,2.0,3.0,4.0,5.0,5.0,5.0,5.0,5.0,5.0,6.0,7.0};  //sample vector.     sort(v);                                                                                                                                  //sort function.     for(int i=0;i<v.size();i++)                                                                                                    //for loop for going through the list.     {.         int counter=0;                                                                                                                 // counter variable.         double x=v[i];                                                                                                                 // assigned a variable for the value being repeated.         for (;v[i]==v[i+1];v[i]++)                                                                                                // for loop for consecutive identical numbers.         {.             counter ++;.             cout<<x<<endl;.             .         }.     }. }. . *** So this is my code, am having trouble writing this mode function. What this code does for now is output the repeated values one after the other however if for example the number 2.0 is repeated 3 times the output would look like this : 2.                                                                                                                                   2. . As you can see only 2 repetitions are being outputted and am assuming that is because my for loop starts evaluating a pair and then runs the first loop so one of the repetitions is missing.. . *** Another issue I have is coding the final step in which I want the largest counter to be displayed. Right now my counter doesn't increment by 1 and stays the same so am assuming there is something wrong with my counter variable."}, {"id": 1926, "value": "When running any tests with summarize, I get an error saying. libc++abi: terminating with uncaught exception of type std::out_of_range: vector. . Looking at my code, I can't see anywhere where I'd be iterating out of bounds. Can this error be caused by something else?"}, {"id": 1927, "value": "I'm trying to implement my max function and I have no idea why but I keep getting an indexing out of bounds error. I included a picture of my code. Is my code wrong or is there some bug with my VS code?Screen_Shot_2023-01-13_at_9.13.17_PM.png"}, {"id": 1928, "value": "When I attempt to hit the green play button this error pops up even though when I hit ls I am in the correct directory. What should I do to fix this?. . Screen_Shot_2023-01-13_at_6.36.43_PM.png. Screen_Shot_2023-01-13_at_6.41.33_PM.png"}, {"id": 1929, "value": "My autograder has some of my output as green but still is giving me an error for some of it. Anyone have any ideas? "}, {"id": 1930, "value": "when I edited the environment part of the launch.json file the title turned red and I got messages saying something was unsaved. How could I resolve this."}, {"id": 1931, "value": "Hi there!. Although I took advice from many instructors, this weird message still exits. Could you check on your auto-grader? What is wrong there? I have all the required in my cpp files.. . double percentile(vector<double> v, double p) {.   assert(count(v) != 0 && p >= 0 && p <= 1);.   if (p != 1).   {.     double calculatedRank = p * (count(v) - 1) + 1;.     double fractpart = 0;.     double intpart = 0;.     fractpart = modf(calculatedRank, &intpart);.     return v[intpart-1] + fractpart * (v[intpart] - v[intpart-1]);.   } else {.     return v[v.size()-1];.   }. }. "}, {"id": 1932, "value": "Sometimes I call to test my summarize function and print it's output and it works. And then I'll run the same test again and it will stop working. Office hours suggested a file might be corrupted so I tried redownloading and moving the code into new files but it is still happening. Can I have some help to see if my summarize function is causing a segmentation fault? I'm not really sure what else to try.. . Update: did figure out why the output would always change: when printing I didn't initialize my iteration to start at 0 so it wouldn't always automatically do that. I am still indexing out of bounds so any help with that would be really appreciated!. "}, {"id": 1933, "value": "I am getting this style error from the terminal. How can I fix this?. "}, {"id": 1934, "value": "uniqname: pgrah. . . When submitting my code, I received this error message. I got a nine out of nine on the rest of my project. I went to office hours, and they could not see a problem in my code that would cause this to happen. They advised me to make a private piazza post about the problem and ask for advice from the instructors. Thanks!"}, {"id": 1935, "value": "HelloI scored a 9 out of 9 on my autograder testing, everything is good and correct, and everything compiles identically at my side. Even using the diff main_test.out main_test.out.correct command yields nothing incorrect, however, when accessing autograder, I fail the main public test (UB Checks). "}, {"id": 1936, "value": "for the summarize test case, my function outputs the correct value and is equal to the value in the assert line, but the output keeps saying assertion failed. I cout ed what the output for stdev(data) should be in my test case just to check if I was getting the correct value and I was, so I'm confused to why the test case is failing. . . "}, {"id": 1937, "value": ". I am on macOS trying to set up input redirection in my .json file. Up until this point I had followed all the instructions and the .json file was working as expected. When I pasted this (which I got from the VSCode setup tutorial) into the .json file:. \"setupCommands\": [. {. \"text\": \"settings set target.input-path main_test.in\". }. ]. . . It says this:. One or more GDB/LLDB commands to execute in order to setup the underlying debugger. Example: \"setupCommands\": [ { \"text\": \"-enable-pretty-printing\", \"description\": \"Enable GDB pretty printing\", \"ignoreFailures\": true }].. . Anybody else have this same error? Thank you"}, {"id": 1938, "value": "I am running into trouble with passing one of my tests with the mean function. I am wondering how we should go about incorporating the floating point comparison described in the reference material. Do we include this in the int main() of our stats_test.cpp??"}, {"id": 1939, "value": ""}, {"id": 1940, "value": "can someone explain what is wrong? is the way i setup my vscode incorrect because i also dont think i am compiling correctly either"}, {"id": 1941, "value": "Can we include multiple tests in one test function?"}, {"id": 1942, "value": "Hi,. . I wonder why this error happened.. . . I tried to debug, and I find that in the debug console, the actual3 and the expected3 are the same.. . "}, {"id": 1943, "value": "Is our style going to be handgraded for projects in this course (like it was in EECS 183)?"}, {"id": 1944, "value": "I have been working on my test functions for median and I'm having a lot of difficulty with my even test (even number of values in the vector), however, my odd test passes. I keep getting this error but I'm not sure what it means or how to fix it. "}, {"id": 1945, "value": "I keep getting this error when I try to run my main method but all my other functions work? Does anyone know how to fix this? "}, {"id": 1946, "value": "I am currently working on the implementation of mode() in stats.cpp and am having difficulty. I think creating another function frequency() under stats.cpp would make mode() easier.. . Is it okay to create a new function and use it within stats.cpp, or is that not allowed?. . Thank you!"}, {"id": 1947, "value": "I'm getting these errors in the autograder; they are out-of-bounds errors, but I am not accessing anything beyond v.size() -1. . My stats.cpp and main.cpp are attached below:. Any guidance would be greatly appreciated! Thank you so much!. . stats.cpp. main.cpp. . "}, {"id": 1948, "value": "Hi, I keep getting this error for the sort function after running my file through the autograder. How should I fix this error?. . stats.cpp: In function ‘std::vector > summarize(std::vector)’:. stats.cpp:14:17: error: invalid initialization of non-const reference of type ‘std::vector&’ from an rvalue of type ‘std::vector::iterator’.    14 |     sort(v.begin(), v.end());.       |          ~~~~~~~^~"}, {"id": 1949, "value": ""}, {"id": 1950, "value": "Does anyone know why the autograder is rejecting my submissions? I made sure the project UID was at the top of the files I submitted exactly like in the spec. "}, {"id": 1951, "value": "I am trying to complete the summarize function and need to first access and then store values in the vector of pairs. However when I use the first and pushback functions I get this error.. . . class \"std::__1::vector<std::__1::vector<double, int>, std::__1::allocator<std::__1::vector<double, int>>>\" has no member \"pushback\"C/C++(135). . . . Why can I not use these as show in the vector tutorial?. . . . "}, {"id": 1952, "value": "Does anyone know how to fix this"}, {"id": 1953, "value": "I'm sorry I'm kind of rusty with my coding and I'm still trying to remember everything from last semester. I'm working on implementing the median, max, and min functions. Do you have any tips for how to sort vector elements in ascending order? I think I would know where to go from there."}, {"id": 1954, "value": "My code is generating properly in \"main_test.out\" , however, it is not printing properly in the auto grader under the \"main public tests UB check\". What is going wrong and how can I fix this?. . . . "}, {"id": 1955, "value": "The code: . the error: no suitable user-defined conversion from \"std::__1::vector<std::__1::vector<double, std::__1::allocator<double>>, std::__1::allocator<std::__1::vector<double, std::__1::allocator<double>>>>\" to \"std::__1::vector<std::__1::pair<double, int>, std::__1::allocator<std::__1::pair<double, int>>>\" exists. . Not sure what is going wrong here. Any help or a push in the right direction is appreciated. Thank you!"}, {"id": 1956, "value": "Anyone know what these warnings mean/how to fix them? I'm not getting these warnings when I compile it myself, but it happens to do this on Autograder. The solution to fixing this according to the internet is to type this into the terminal: . $ find . -type f | xargs -n 5 touch$ make clean$ make. . "}, {"id": 1957, "value": ". . . Hello, I keep getting this error when I am trying to run the code. I have the C++ extensions installed and everything. Does anyone know how to work around this?. . Thanks!"}, {"id": 1958, "value": "I was working on a private test case where I tested a vector of size 6. However, when I returned the 25th percentile of the vector, it returned a decimal value rather than a whole number as shown in the output examples in the spec.. . Example:. . the main were provided should ideally work like this:. . {6, 7, 8, 9, 10}. . 6 - falls within the 0 - 0.2 percentile. 7 - falls within the 0.2 - 0.4 percentile. 8 - falls within the 0.4 - 0.6 percentile. 9 - falls within the 0.6 - 0.8 percentile. 10 - falls within the 0.8 - 1 percentile. . Its important to note that these ranges depend on frequency, as we can see with the spouse or partner example.. . This would make sense as when the 25th percentile is called, it returns the whole number of 7 rather than returning a decimal. The same goes for the 75th percentile, which returns 9 rather than a decimal.. . Am I going about this wrong? I passed everything on the autograder and my code returned the above as expected; however, now when I'm working on my private test cases, these percentiles return the decimal - in a sense the actual number that would occur at that specific percentile rather than matching it with a \"range\". Thanks!"}, {"id": 1959, "value": ". here is my test case for summarize here, but I'm not sure why there is an error under assert. the error is this: . . when I compile this in the terminal, I'm getting a long list of errors even though my stats.cpp code works. "}, {"id": 1960, "value": "On project 1 - I am trying to write the bit of code in main that prints a summary of the data and I am getting the following error message:. No viable conversion from 'vector<std::pair<double, int>>' to 'vector<vector<double>> . . I would greatly appreciate some tips on achieving viable conversion of my vectors."}, {"id": 1961, "value": "I have been implementing the functions created with stats.cpp in main.cpp, but for some reason I'm getting a 'No matching function for call to 'summarize' error. I have the #include \"stats.h\", so I'm not sure what is wrong. "}, {"id": 1962, "value": "When I try to make main.exe at the command line, I keep getting this error. I'm not sure what to do about this.. "}, {"id": 1963, "value": "I tried to cout the summarize(data) in main but it doesn't work because summarize returns a vector of pairs.. . How would I go about doing this?"}, {"id": 1964, "value": "When I run my tester and debug it I can see that the program is jumping over a line that sets one of my variables to 0. If this line isn't executed then the whole function fails. I was wondering if there is any fix to this?"}, {"id": 1965, "value": "Hi everyone. I completed the code for project 1 and managed to pass the autograder UB checks with a 9/9. Besides negative numbers as elements and the vector size being 1 element, what are other edge cases to consider?"}, {"id": 1966, "value": "I have #include \"stats.h\" in my stats.cpp file. Even though the program runs, it won't let me debug unless I also #include \"stats.cpp\" which contains the function definitions.. . Do I need to #include \"stats.cpp\" ? If not, how does the program even get the function definitions if they are not in stats.h? Here is the error message I get when I try to debug (with only including stats.h).. . Thanks!. .  "}, {"id": 1967, "value": "What should my mode function return if a set of data does not have a mode?. "}, {"id": 1968, "value": "My code compiles fine locally and in the autograder but the only issue I get is the undefined behavior checks on stats_public_test.cpp and main.cpp. The error message is not that helpful since I don't know where exactly my issue is occurring. I would appreciate it if I could receive some help identifying where in my code the issue is occurring and how I can go about fixing it.. . Error message:. . "}, {"id": 1969, "value": "I submitted my codes to autograder, only for me to fail both UB public tests. How would i approach these type of errors?. "}, {"id": 1970, "value": "Hi,. For this and future projects, are we being graded on the presence of our own comments in our c++ code? Will we be graded on the neatness or readability of the code for this project and others down the road? Thank you!"}, {"id": 1971, "value": "Does our stats library need to be able to handle negative numbers? I'm not sure if that would really change any of the code, as I have not yet tested it, I am just curious if I need to write negative test cases. Thanks. "}, {"id": 1972, "value": "Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX13.1.sdk/usr/include/c++/v1/vector:1572:12: runtime error: addition of unsigned offset to 0x600000c08000 overflowed to 0x600000c07ff8. SUMMARY: UndefinedBehaviorSanitizer: undefined-behavior /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX13.1.sdk/usr/include/c++/v1/vector:1572:12 in . . I'm not sure what the error means, but I can run the code and get the values I want, in autograder as well.. josech"}, {"id": 1973, "value": "Is assert() just a function that we can use to help our development and testing process, or is it something that has to be included in our test cases to receive credit from the autograder?"}, {"id": 1974, "value": "My code compiled but it highlighted these private tests and said that they timed out. Does this mean I should rework it and that it wouldn't pass the private tests?. . Screen_Shot_2023-01-11_at_10.48.00_PM.png"}, {"id": 1975, "value": "When I test the mean function, I have a vector with the values (2.5, 4.3, 3.1). The mean is 3.3, and the assertion I have is as follows:. assert(mean(v) == 3.3). . This assertion fails. I thought it might be because of my mean function, so I tested the output and the cout results in 3.3, but it still fails the assertion. I've tried doing. assert(mean(v) == (9.9/3)). which passes the assertion so I'm guessing I will run into issues with the autograder. Does anyone have any idea why the assertion fails? One thing I did was static_cast the count integer in my mean function into a double because I thought it might have been an issue with double and integer division but that didn't fix the issue."}, {"id": 1976, "value": "So I have tested my stdev function and I keep getting this output of -nan(ind). I am trying to figure out where in my code I am wrong but I can't see it . Possibly a new fresh set of eyes can help me. Any help is appreciated! Thank you!!!. . double stdev(vector<double> v) {double tempmean = mean(v);for (size_t i = 0; i < v.size(); ++i){double val = v[i] - tempmean;v[i] = pow(val,2);}const double total = sum(v);const double variance = total / (count(v) -1);return sqrt(variance);}"}, {"id": 1977, "value": "I keep getting this error when I am trying to test my summarize function and I was wondering if someone could help, thank you!.     void test_summarize1(){.         cout << \"test_summarize1\"<< endl;.         vector<double> data= {1,1,1,1};.         cout<< summarize(data) << endl;.         .     }. this is my test function right now and I keep getting this error: . **Invalid operands to binary expression ('std::ostream' (aka 'basic_ostream<char>') and 'std::vector<std::pair<double, int>>') **"}, {"id": 1978, "value": "First, yes I included the correct libraries but when I try to compile this shows up.. . . Undefined symbol: sort(std::__1::vector<double, std::__1::allocator<double> >&). . Any idea?"}, {"id": 1979, "value": "Why is this keep happening when I try to submit?. . "}, {"id": 1980, "value": "When I try my code with real data provided in the specification of project 1, I get the same result on my visual studio debugger as the expected result provided in the spec. But when I run main.exe on the terminal, my 75th percentile is 2 and the 100th percentile is one, which is the reverse of the spec. Does anyone have a clue about that? Thanks in advance!. "}, {"id": 1981, "value": "Screen_Shot_2023-01-11_at_6.51.36_PM.png. . Does anyone know what this error is signifying? My tests worked with column A of the tsv file we were given, but when I changed to column B in my tests, I got this error."}, {"id": 1982, "value": "I'm a little confused on the purpose of the stats.cpp file. At the start of the specs, it says to write implementations for all the functions in the stats.cpp file. Then, a little further down the page, it says to add a bunch of function stubs with assertions to the stats.cpp file. Do we add these in addition to the implementations or do we add the stubs to try to compile it and then delete the stubs?"}, {"id": 1983, "value": "Hello,. . Referencing the stats.h file, we are supposed to implement in stats.cpp. What data/numerics are we including for implementing the functions from the stats.h file? Are we to use the data commented? I am a little confused in terms of implementing for what data I am to use for summarize, count, sum, mean, etc. "}, {"id": 1984, "value": "Are we supposed to write functions in main.cpp or just put everythign in main that needes to be printed?"}, {"id": 1985, "value": "When I attempt to run any of my tests through the terminal it says I do not have permission to run the files. I have attached a screenshot of the error messages. Is there any way I can fix this.. . "}, {"id": 1986, "value": "what should we assume to ouput for the mode of a dataset if there is more than one mode (or all values have a frequency of x)? In the autograder public test the smallest value is accepted, can we assume the same for all private tests?"}, {"id": 1987, "value": "Untitled.png"}, {"id": 1988, "value": "I was following the spec and got to this step. . However, when I run that command there is an error that says it aborted. I asked my LI and she said that was normal because it was a check before anything had been written. I had stopped working when I got the error code because the spec didn't say anything about error codes so I thought I had done something wrong. The spec would be more helpful if it said the expected result of each command, especially when using command line commands which are entirely new to me, and many other students. "}, {"id": 1989, "value": "I'm having issues traversing the directories on my system  (I'm using Linux). I can't quite find my p1-stats folder which has the solution files from my created project in Visual Studio. I managed to get the starter files into a directory titled p1-stats but it is not the same folder as the one that actually contains the source files. I'm not sure how to get where I'm supposed to get."}, {"id": 1990, "value": "I am getting an error that is saying I am indexing out of bounds, I have been changing around the indexing but have not been able to fix it. . . Screenshot_2023-01-11_at_12.27.11_PM.png. Screenshot_2023-01-11_at_12.28.34_PM.png. . "}, {"id": 1991, "value": "In the picture below, I'm not sure why there's an error with the \"i\" variable in v[i] in the for loop. Also, when running the program, do I need to take out the vector declaration where I filled the vector with values? Is that something that I add in the test cases? I was kind of confused by that. . "}, {"id": 1992, "value": "Here's what I've done so far: . 1. Made main.cpp and main.exe, they compile. 2. Created stats.cpp and filled it in with the code on the spec. 3. Created stats.test.cpp which is empty. . Here's what I get when I make and compile stats_public_tests.exe and stats_tests.exe. I haven't touched the json file (the program is still main.exe). Is there something wrong and how do I fix it?. . . . "}, {"id": 1993, "value": "I got this error message. This is how to use assert to test the summarize function: assert(summarize(v0)[0].first =1);. Can anyone tell me what causes this error on Autograder?. . "}, {"id": 1994, "value": "S. . . I am not sure why I am getting this error. I edited cwd and program correctly but it still didn't work.. "}, {"id": 1995, "value": "Hi there! I passed all the tests and got 9/9 now. However, I am a bit confused about the below the orange error reason.. . "}, {"id": 1996, "value": "I finished all of my functions for project 1, while my test cases and main file manage to compile on the autograder, my stats.cpp file gets an error because I used v.begin(). I tested the public test and the test data file locally and the output seems to match one-to-one. I just need to figure out why I am receiving this error and what I can do to resolve it. If you know how to resolve this error please let me know. Thank you.. . This is the error output the autograder gives me:. . . "}, {"id": 1997, "value": "I was wondering what this error meant, all of the assert(false) are the same for each function. . . stats_public_test.exe: stats.cpp:88: double mode(std::vector<double>): Assertion `false' failed."}, {"id": 1998, "value": "I am getting this error when I try to run the \"Hello World\" program in main.cpp. What can I do to fix this problem?. . . . . . . "}, {"id": 1999, "value": "When I try to run stats_tests.cpp, this is the error that comes up for me:. . . . I've already implemented the sum, mean, and count functions in stats.cpp (as well as the other functions with return 0), but I'm not sure why this still happens."}, {"id": 2000, "value": "I am getting a bunch of errors in the vector file (listed as \"problems\" in the debugger), and I am not sure what the cause is. I haven't edited the vector code at all so I am unsure where to look for the root of the problem. The debugger suggests that I update includePath but I am unsure how I should be editing it. I included two images, one of the screen showing the \"problems\" in the debugger and vector code, and also how my include path looks currently. Any ideas would be greatly appreaciated! includePath.JPG . p1errors.JPG"}, {"id": 2001, "value": "I am not entirely sure if I have been doing this correctly, but I have two int main() functions, one in my main.cpp and one in my stats_tests.cpp. When I submit to the autograder, I get a compiling error saying that int main() is defined in two places, and when I submit to the autograder with only one int main(), the autograder gives me an error saying that there is an undefined reference to main. . I'm not sure if I'm only supposed to have one main function or if I am supposed to be submitting both. . . . . . . . The first picture is the first case I mentioned, and the second picture is the second case I mentioned"}, {"id": 2002, "value": "Hello, . . I keep trying to run the stats_public_tests.cpp file but I keep getting this error and do not know how to fix it . . . Screen_Shot_2023-01-10_at_6.00.49_PM.png"}, {"id": 2003, "value": "I know this was already asked but the answer did not resolve my issue. I used terminal to run the test data and the terminal works but xcode itself does not work anymore. I get this error when I try to hand input the information:. . enter a filename. main_test_data.tsv. enter a column name. B. reading column B from main_test_data.tsv. Error opening main_test_data.tsv. Program ended with exit code: 1. . I have no idea why this isn't working. I didn't type anything related to input redirection in my actual main file, I just used terminal. But even when I delete the file that main_test_data is reading into, I still get this error. I have tried the debugger and the only information I get is that the file can't open."}, {"id": 2004, "value": "I could pass the main public test, but for the behavior check for the main public test, the line 23 could not represent. I do not know where is wrong.. "}, {"id": 2005, "value": "My summarize function seems to always return 1 for the frequency of the numbers and I don't really understand why. My code is below. It seems to not get to the final if statement. For example, if the vector is v={1,1,1,2,3,4,4} it will return {1:1, 2:1, 3:1, 4:1}.. . . vector<pair<double, int> > summarize(vector<double> v) {. vector<pair<double, int> > summary;. sort(v);. //go through sorted vector. for(int i=0; i<v.size(); ++i){. if(i==0){. //push back first element to vector of pairs. summary.push_back(make_pair(v.at(i),1));. }. //if there is a new number in the sorted vector. else if(v.at(i)!=v.at(i-1)){. //push back to vector of pairs. summary.push_back(make_pair(v.at(i),1));. }. //if number is in summary already. else{. //go through summary. for(int j=0; i<summary.size(); ++j){. //if this repeated number is the same as summary[j]. if(v.at(i)==summary.at(j).first){. //add 1 to the frequency of that number. summary.at(j).second+=1;. cout<<summary.at(j).second<<endl;. }. }. }. }. return summary;. }. "}, {"id": 2006, "value": "No matter how hard I try, I can't get rid of this error. Google seems to think it's an issue with including files, but I made sure to link the files just like how the professor did in lecture."}, {"id": 2007, "value": "I review the tutorials for comparison (https://eecs280staff.github.io/p1-stats/comparisons.html) and the comparison method actually works on my debugger result. How could I fix the failed compile check on the autograder? Any help is appreciated!. . "}, {"id": 2008, "value": ". no operator \">>\" matches these operands. . I received a weird bug notice above, and it appears in the below bold underlined part >> part.. .   string filename;  string column_name;  cout << \"enter a filename\" << endl;  cin >> filename >> endl;  cout << \"enter a column name\" << endl;  cin >> column_name >> endl;  cout << \"reading column \" << column_name << \" from \" << filename;  vector<double> v = extract_column(filename, column_name);. . Any suggestions?"}, {"id": 2009, "value": "After I execute the command line diff main_test.out main_test.out.correct, I got such results:. . 1,2c1,6. < enter a filenameenter a column namereading column B from main_test_data.tsvSummary (value: frequency). < 7: 2. ---. > enter a filename. > enter a column name. > reading column B from main_test_data.tsv. > Summary (value: frequency). > 6: 1. > 7: 1. 5a10. > . 11c16. < mode = 7. ---. > mode = 6. Does it mean that my answers have differences in the summary part and mode part with the correct version? Much appreciated."}, {"id": 2010, "value": "I'm getting the undefined error whenever I call extract_column and sort, I have the include \"p1_library.h\", so I'm not sure why its still undefined"}, {"id": 2011, "value": "I am currently checking for why my test case for stdev() function does not pass, so I want to use my calculator to check the result. Is the stdev we want to calculate corresponding to the number after Sx on the calculator?. . Thanks a lot!"}, {"id": 2012, "value": "I was wondering if we can create helper functions to implement other functions in stats.cpp"}, {"id": 2013, "value": "do we have a private test for project 1?"}, {"id": 2014, "value": "What is the point of the assert(false) in each of the stats.cpp file functions? Do we need to keep it even after we write each function?"}, {"id": 2015, "value": "Here is my code format to test my percentile function in stats_tests.cpp:. .     cout << \"here is the value: \" << abs(percent1-1) << endl;.     assert(abs(percent1-1) < epsilon);. \t\t....     cout << \"test_percentile: PASS!\" << endl;. However, it always fails the assertion test. Any suggestions?"}, {"id": 2016, "value": "This is a really small question, but I wanted to know if it was okay if we renamed the files given in the project to have Camel Case names instead of underscores in between each word?"}, {"id": 2017, "value": "1. Can we use negative numbers to calculate for percentile?. . 2. The RMEs mentioned that we need to change the formulas to index from 0 instead of 1. Does this include the vp = vk + d(vk+1 - vk) thing as well?"}, {"id": 2018, "value": "Here is my percentile function:. . double percentile(vector<double> v, double p) {.   assert(count(v) != 0 && p >= 0 && p <= 1);.   double calculatedRank = (p / 100) * (count(v) - 1);.   double fractpart = 0;.   double intpart = 0;.   fractpart = modf(calculatedRank , &intpart);.   return v.at(intpart) + fractpart * (v.at(intpart+1) - v.at(intpart));. }. Here are percentile-related tests in the stats_tests.cpp:. . void test_percentile() {.     cout << \"test_percentile\" << endl;.     vector<double> data;.     data.push_back(3);.     data.push_back(2);.     data.push_back(1);.     double percent1 = percentile(data, 0.0);.     double percent2 = percentile(data, 0.25);.     double percent3 = percentile(data, 0.5);.     double percent4 = percentile(data, 0.75);.     double percent5 = percentile(data, 1.0);.     assert(abs(percent1-1) < epsilon);.     cout << \"here is the value: \" << abs(percent1-1) << endl;.     assert(abs(percent2-1.5) < epsilon);.     cout << \"here is the value: \" << abs(percent2-1) << endl;.     assert(abs(percent3-2) < epsilon);.     cout << \"here is the value: \" << abs(percent3-1) << endl;.     assert(abs(percent4-2.5) < epsilon);.     cout << \"here is the value: \" << abs(percent4-1) << endl;.     assert(abs(percent5-3) < epsilon);.     cout << \"here is the value: \" << abs(percent5-1) << endl;.     cout << \"test_percentile: PASS!\" << endl;. }. I have no idea why the assertion failed. Any suggestions?. "}, {"id": 2019, "value": "Hi,. . I'm working on project 1 and keep getting this error when trying to make stats_public_test.exe. . . c++ -Wall -Werror -pedantic -g --std=c++11 -Wno-sign-compare -Wno-comment stats_public_test.cpp stats.cpp p1_library.cpp -o stats_public_test.exe. stats.cpp:40:23: error: variable length arrays are a C99 feature [-Werror,-Wvla-extension].     double numberList[v.size()];.                       ^~~~~~~~. stats.cpp:40:25: note: non-constexpr function 'size' cannot be used in a constant expression.     double numberList[v.size()];.                         ^. /Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/c++/v1/vector:679:15: note: declared here.     size_type size() const _NOEXCEPT.               ^. 1 error generated.. make: *** [stats_public_test.exe] Error 1. . . . If it helps, I'm using VS Code and this happens when I use the command in terminal. I'm not sure why size wouldn't just be an int value."}, {"id": 2020, "value": "In engr 101, we were taught that we should use pass by constant reference instead of pass by value for large data types. What counts as a large data type? And in all the functions that we're implementing for p1, do we consider the vectors big enough to have to pass by constant reference or is passing by value ok?"}, {"id": 2021, "value": " Getting \" Execute debugger commands using \"-exec <command>\", for example \"-exec info registers\" will list registers in use (when GDB is the debugger)\" on line 23 of stats.cpp, even if I commented out the whole function. . Screen_Shot_2023-01-09_at_1.36.01_PM.png. Screen_Shot_2023-01-09_at_1.36.22_PM.png"}, {"id": 2022, "value": ". I am getting this error for the stdev function in the main public tests. Should I implement rounding into my function or what?"}, {"id": 2023, "value": "Do we run make test (the regression test written by staff) only after we implement all the functions in stats.cpp and main.cpp?"}, {"id": 2024, "value": "I was wondering if the makefile should be included in our compile sources. I currently have it in as one of my four sources and it is giving me a warning message every time I compile. It does not cause an error or anything it just shows up as a warning every time I compile in my IDE. I am pretty sure the makefile is used for compiling in the terminal but was unsure outside of that what it is actually used/needed for. Thanks!"}, {"id": 2025, "value": "Hi everyone - welcome to EECS 280!. . Staff will be hosting a P1 Overview Session over Zoom on Tuesday 1/10 from 8-9PM EST. We'll go over the basic components of this project, as well as some general tips on getting started. Time permitting, we'll also have a Q&A at the end. The session will be recorded and posted on eecs280.org, so you'll be able to rewatch this later if you're not able to make it.. . Zoom: https://umich.zoom.us/my/clsun. Slides: https://docs.google.com/presentation/d/1DPLp5I3dFvLhhUeUwQH1MlQBSq4f-w8ppUJgxZyQSYY/edit#slide=id.p. Recording: https://umich.zoom.us/rec/share/Fge-8V0gwnOLLsm-51nddcH-lZtqioxTP6F-Nv9bFBFgTcGtlwxB-Pr0hUgQRy62.isesM6wXYDc6XrUL. . Hope to see you there!. (\\/) (°,,,,°) (\\/). . EDIT unpin"}, {"id": 2026, "value": "I am not sure exactly sure why my output is considered incorrect. I'm pretty sure the spacing is correct too. Are there any other possibilities for why this is happening?. "}, {"id": 2027, "value": "(It's just the stub pasted from spec.). . . . "}, {"id": 2028, "value": "I am confused. Where I am I suppose to write my functions at? "}, {"id": 2029, "value": "I am struggling to make any progress with this function. Right now the only thing I can think to do is use a for loop to maybe count the number of distinct elements in the vector, then another one to count how many times each distinct element appears. After this, I do not know where to go in terms of transferring these values into a vector of pairs.... I was thinking maybe run another for loop to somehow insert the number and how many times it appears that way? Overall just having trouble with this funciton. Any advice as to a better way to think about it would be really appreciated. Thanks!"}, {"id": 2030, "value": "I forgot how to do like everything from that class lol. help. I took it two semesters ago and wasn't great at it and I'm worried."}, {"id": 2031, "value": "Hi, when I try to start the debugger it gives me this message, and I don't really understand what to do about this.. Thank you. "}, {"id": 2032, "value": "If not, do we just download the cpp files and upload them onto the autograder?"}, {"id": 2033, "value": " I've been stuck on mode() for a while so I am most likely going to finish what I haven't finished.. . Please let me know which one would be easier to implement! "}, {"id": 2034, "value": "In which way would summarize be helpful for the eventual main.cpp? . . I don't understand where we can use this function other than the median (but I plan on using the sort + double nested loop hinted by the RMEs). . "}, {"id": 2035, "value": "Can we assume that vector<double> v has no negative values since the data involves ages?"}, {"id": 2036, "value": "Can you do standard deviation with negative numbers?. . Somethign like {-1,-2,-3,-4,-5}?"}, {"id": 2037, "value": "Will there be mutation testing done in project 1? Or will our tests be graded in any way aside from being able to run?"}, {"id": 2038, "value": "I'm a little confused by how we're supposed to implement our test cases into stats_tests.cpp. Should we just come up with a random vector & call all the functions using that? Should we submit it to the autograder with our made up vector still included in the code? Should we submit with the assert statements still included? Sorry, I read over the project specs but I'm still a little confused by like ... what test cases are ..."}, {"id": 2039, "value": "Not sure why an instance of 'std::bad_alloc' is being thrown. . "}, {"id": 2040, "value": "Does the number of test cases need to match the number of private tests in piazza?"}, {"id": 2041, "value": "I was trying to use the sort function but I got this error in xcode: Undefined symbol: sort(std::__1::vector<double, std::__1::allocator<double> >&). . . I saw a previous post with a similar issue so I didn't use 'using namespace std' and made sure to only pass in the vector. . . Is there anything else I can try? "}, {"id": 2042, "value": "I am getting this error: . . \"clang: error: linker command failed with exit code 1 (use -v to see invocation)\" when I attempt to run the public stats tests for P1 using VS Code.. . . . I have already tried:. . inputting the following into the terminal:  make stats_public_test.exe./stats_public_test.exe. saving the file and making sure I included the vector library beforehand.. "}, {"id": 2043, "value": "I want to use the vector of pairs returned by the summarize function for my mode function if possible. I declared it inside the summarize function and it is returned by the summarize function as well. How do I access it in my mode function?"}, {"id": 2044, "value": "Here is my stdev function:. . double stdev(vector<double> v) {.   assert(count(v) >= 2);.   double meanVal = mean(v);.   double sumVal = 0;.   for(int i=0; i<v.size(); ++i) {.     sumVal += pow((v.at(i)-meanVal), 2);.   }.   return sqrt(sumVal / (count(v)-1));. }. Here is my test_stdev function:. . void test_stdev() {.     cout << \"test_stdev\" << endl;.     vector<double> data;.     data.push_back(3);.     data.push_back(2);.     data.push_back(1);.     double stdevVal = stdev(data);.     assert(stdevVal == 0.81649);.     cout << \"test_stdev: PASS!\" << endl;. }. . And my assertion failure notice is Assertion failed: (stdevVal == 0.81649), function test_stdev, file stats_tests.cpp. I presume I need some rounding help, but not sure. Any suggestions?"}, {"id": 2045, "value": "Hi, . . when I try to debug, it says that I can't; . . apologies if this is a basic error, but I haven't been able to figure out what I'm doing wrong, and stackexchange gives me a bunch of (different) suggestions all far above my technical paygrade"}, {"id": 2046, "value": "Here is how I construct my summarize function:. . vector<pair<double, int> > summarize(vector<double> v) {.   assert(count(v) != 0);.   .   sort(v);.   double tempNum = v[1];.   vector<double> numVector;.   vector<int> occurenceVector;.   numVector.push_back(tempNum);.   occurenceVector.push_back(1);.   for(size_t i = 1; i < v.size(); i++) {.     if(tempNum == v[i]) {.       occurenceVector[occurenceVector.size()-1]++;.     } else {.       tempNum = v[i];.       numVector.push_back(tempNum);.       occurenceVector.push_back(1);.     }.   }. .   vector<pair<double, int> > vp;.   for (size_t i = 0; i < numVector.size(); i++) {.     vp.push_back( make_pair( numVector[i], occurenceVector[i] ) );.   }.   return vp;. }. Here is how I test my summarize function:. . void test_summary() {.     cout << \"test_summary\" << endl;.     vector<double> data;.     data.push_back(1);.     data.push_back(2);.     data.push_back(3);.     data.push_back(4);.     vector<pair<double, int> > summary = summarize(data);.     assert(summary.size() == 4);.     cout << \"test_summary: PASS!\" << endl;. }. I have no clues why this assertion failed. Any suggestions?"}, {"id": 2047, "value": "In last week's lecture, we were told that our own test cases would be run against separate buggy code in Autograder. Is that happening for project 1? If so, where can I see the results of my own written test cases in Autograder? Thanks!"}, {"id": 2048, "value": ". double mode(vector<double> v) {.   assert(count(v) != 0);.   sort(v);. .   int maxCount = 0;.   int tempCount = 0;.   double modeNum = v[1];.   double tempNum = v[1];.   for(int i=1; i<v.size(); ++i) {.     if(tempNum != v[i]) {.       if(tempCount > maxCount) {.         modeNum = tempNum;.         maxCount = tempCount;.       }.       tempNum = v[i];.       tempCount = 1;.     } else {.       tempCount++;.     }.   }.   .   return modeNum;. }. Based on the previous summarize function advice, I updated my mode function as well. I think the previous main problem is that I am unfamiliar with c++ null initialization. how about this version? Any suggestions?"}, {"id": 2049, "value": "My stdev tests were failing so I changed my test function to print out the calculated value before doing the assertion. It is printing out the same value as what is put in the assertion but still failing the test and I am not sure what is wrong.. "}, {"id": 2050, "value": "Hi, I submitted my code to the autograder and got 9/9. However, the following error appears, even though I cout the 100 percentile in my main.cpp file.. . "}, {"id": 2051, "value": "Is it possible to assert that an output is equal to infinity? Sometimes the stdev function returns \"inf\" as its output if the dataset contains numbers that are very far apart. How should we address this and is there a way to assert that output is equal to infinity?"}, {"id": 2052, "value": "Can we use the clear function to clear a vector so we can reuse the same vector to put different data for testing? "}, {"id": 2053, "value": ". vector<pair<double, int> > summarize(vector<double> v) {.   assert(count(v) != 0);.   .   sort(v);.   double tempNum;.   vector<double> numVector;.   vector<int> occurenceVector;.   for(size_t i = 0; i < v.size(); i++) {.     if(!tempNum) {.       tempNum = v.at(i);.       numVector.push_back(tempNum);.       occurenceVector.push_back(1);.     } else if (v.at(i) == tempNum) {.       occurenceVector.at(occurenceVector.size() - 1)++;.     } else {.       tempNum = v.at(i);.       numVector.push_back(tempNum);.       occurenceVector.push_back(1);.     }.   }. .   vector<pair<double, int> > vp;.   for (size_t i = 0; i < numVector.size(); i++) {.     vp.push_back( make_pair( numVector[i], occurenceVector[i] ) );.   }.   return vp;. }. The above is my way to construct my summarize( ) function. I sort the vector, then used two vectors to record distinct double numbers and their corresponding occurrence. Finally, I input the pair of distinct double numbers and their occurrence into the result vector. Any suggestions?"}, {"id": 2054, "value": "Will the private testing call each function in stats.cpp separately since there are a different number of tests for each function or will it call it through main.cpp?. My percentile function relies on calling sort in main.cpp to sort the vector, so it will not pass the tests if the functions were to be called separately.. . "}, {"id": 2055, "value": "Can I get some more hints on implementing this function please? I am confused on how I can use the nested loop to find the mode. I understand why we need to use sort() as if we have a vector with {1,4,5,2} we need to return \"1\" according to the RME.. . "}, {"id": 2056, "value": "I am working on implementing the standard deviation function, and was wondering if it is allowed (or possible) to call the mean function inside of it, since the sample average is used in the calculation of standard deviation. This led to some problems though..... I am not sure if it is possible to call another function from stats.cpp and use it in another stats.cpp function since there is no main function in this file and it might be out of scope or something. Also, I thought this may not be allowed because maybe the project guidelines wanted us to build each stats function from scratch (so just calculate the mean again in the stdev function). I just wanted to double check this before doing so to save some work if we were allowed to call another function we had already wrote. Any guidance here would be much appreciated. Thanks!"}, {"id": 2057, "value": "I got 9/9 on autograder but I am not getting the undefined behavior public tests for main.cpp. Could someone explain to me why the error output is what it is and why the last percentile line is not getting printed?  . "}, {"id": 2058, "value": "For cases when the inputed data type violates the function requirements, do we need to have a specific error output or will just throwing an error be sufficient? "}, {"id": 2059, "value": "Hello, I got a 9/9 on the autograder however I didn't pass one of the undefined behavior checks. I'm unsure what's being tested here and why my program doesn't print the last line of code for that - may I please have advice for. 1. what undefined behavior checks are testing.. 2. how I may improve my program. . Here's my main public test output: . . . Here's my undefined behavior check test output (the second one):. . Don't know why line 23 isn't printing here.. . "}, {"id": 2060, "value": "Hi! When I try and download the starter files from my terminal for project 1 and then put in the word tree, my computer seems to try and open every file/ app on my computer. I am not sure how to fix this. . . Screen_Shot_2023-01-08_at_8.12.51_AM.png"}, {"id": 2061, "value": "Hi there! According to the explanation from the wiki, there are two versions of standard deviation: corrected sample standard deviation and unbiased sample standard deviation. However which one shall we use? Much appreciated."}, {"id": 2062, "value": "I just finished my main.cpp but currently my code requires me to write the filename and column name myself. I read in the project 1 tutorial that we can apply input/output redirection to our code. Is this compulsory for project 1 i.e. will we lose points for not setting up input/output redirection?"}, {"id": 2063, "value": "I just submitted my code on auto grader and it passed the auto grader but I found these compilations warning for all 3 files. They are almost identical except for the time. Anyone has any idea why this happen and how can I fix them?. "}, {"id": 2064, "value": "Hi, I have started writing the project and the majority of the errors I am getting from the debugger are when I use cout statements.  I have #include <iostream> at the top of  my main.cpp file, and all of my cout statements are getting a debugger error that says \"this declaration has no storage class or type specifierC/C++(77)\".  The same thing is happening when I declare string filename even though I have the string library included.  Does anyone know what I am doing wrong?. Thank you!"}, {"id": 2065, "value": "I understand what the summarize function is trying to accomplish, but I am having a hard time thinking about how to go about accomplishing it using tactics taught in EECS 183. I was thinking about a for loop to add up the amount of times a value occurs, but how can it remember if it already visited that value? Any help on this thought process would be appreciated. :)"}, {"id": 2066, "value": ". clang: error: linker command failed with exit code 1 (use -v to see invocation). Hi there! I received the above error message, but I have no ideas what is happening in my debugger."}, {"id": 2067, "value": ". /Users/cr7/Desktop/eecs280/p1/starter-files/stats.cpp:34:18: error: expected expression.     vp.push_back({v1.at(i), v2.at(i)});. I received such an error notice but I cannot see what is wrong here. Much appreciated."}, {"id": 2068, "value": ". error: expected expression. Hi there! I received the above error notice, could you check it? I use such a format to initialize  double tempNum {};"}, {"id": 2069, "value": ". /Users/cr7/Desktop/eecs280/p1/starter-files/stats.cpp:15:17: error: expected ';' at end of declaration. Hi there!. I am debugging my program, and I received the error notices. I presume that comes from some writing style problems, could you check?. "}, {"id": 2070, "value": "Hello! Does the autograder require a call to each test function within the main() function in stats_tests.cpp, or leave main() empty in which the autograder checks for stats.h function calls within the stats_tests.cpp file? Thank you!"}, {"id": 2071, "value": "I am getting this compiler error every time I try to run stats_tests.cpp in VScode. Does anyone know how to fix it?. . . Edit: I figured it out. It turns out I wasn't remaking the executable file in the terminal every time i wanted to rerun it, thus I was unknowlingly rerunning old code despite fixing the issue."}, {"id": 2072, "value": "Is the score on the autograder our final grade? What effect do the private tests have on our grades? "}, {"id": 2073, "value": "When I run my main.cpp program it does not let me pass in a string to my file_name and column_name variables, and my code says \"Error opening\" and then terminates. When I step through my code with the debugger it appears to be running correctly but when I try and input a string it says invalid input. Any help would be appreciated thank you. This is in Xcode btw."}, {"id": 2074, "value": "I wrote cin statements for filename and column_name, but when I run the program it never stops to let me input, so extract column is used with empty strings and the output says: \"Error opening\". Why is this?"}, {"id": 2075, "value": "So I was writing test cases for the stdev function in stats.cpp, and I'm pretty sure I wrote the function correctly, but I'm failing my own test cases. This is the test case that I was using.. . The output from the stdev and the sqrt are given below. . . I thought that the issue would be with the casting of the numbers, so just to be safe I casted both of them to double, but I still failed the assertion as you can see. I'm assuming that this has to do with how the number is actually represented in the memory of the computer, as in, the number that I'm calculating is something like 465.2250000001 and the number that the sqrt gives out is 465.22500000002 which is why I'm failing the assertion. I wanted to know if there's any way to fix this.. For reference, I've posted the code in my stdev function below.. . "}, {"id": 2076, "value": "I wrote all of the code for main.cpp, not able to officially take in a file with what I thought was the right code. I receive this in my terminal:. I put the program into autograder, just because, and I got everything right except for main public test (UB Checks), also because I did all of stats already. However, I am still confused as to why my main.cpp is still not working."}, {"id": 2077, "value": "Hi, I was looking at what our output is supposed to look like and the output for the percentile is all indented.  I looked up how to cout an indent in c++ and it said to use indent(n) where n is how far over you want your indent.  Is this how we are supposed to do it, and if so what n value do I have to use to make the indent match the autograder?"}, {"id": 2078, "value": "When I look at the output, I see that everything matches except the end of the output, the 100th percentile, which doesn't appear at all. The error appears to be a segmentation fault with the vector going out of bounds but I am confused on what exactly is causing this as it runs fine in my own terminal. How can I debug this? It also appears that I did follow the index hint."}, {"id": 2079, "value": "Hi, I check the project spec and found that in the main.cpp only 3 librarys can be inlcuded <iostream>, \"stats.h\", and \"p1_library.h\". Can we include more? such as the vector library?. "}, {"id": 2080, "value": "I am submitting for the first time and I got this error, any tips?"}, {"id": 2081, "value": "Are we supposed to download all the files from the Stanford link into the p1-stats folder?. If so, where did the .tsv file \"HCMST_ver_3.04.tsv\" come from in the example from project specs? I can't find it on the website to download for practice. It's holding me back from testing everything I've written so far.. "}, {"id": 2082, "value": "I copy the lines from the tutorial and paste them in the main function, while it is not working and giving me this error. Could someone help me with it? "}, {"id": 2083, "value": "I'm trying to read in the file in the driver program but I am unsure how to proceed without using fstream, which is not included in the libraries that we are allowed to use. How should I proceed to finish the driver program? "}, {"id": 2084, "value": "I was looking through the actual study to determine if the data contained any negative numbers but could not find anything. So far I believe I have written all my code such that it should with or without negative numbers (i.e. my test cases include both positive and negative doubles and there seems to be no issues). That said, for the minimum function I feel like it is important to know for certain whether negative numbers are actually able to be included as data points (or whether 0 is the minimum possible value). I may be overlooking something, but from what I could see there was not anything in the spec or the study clarifying this, so I just wanted to double check. Thank you!"}, {"id": 2085, "value": "I am currently working through project 1 and still do not really understand what the use of compiling in the terminal is. Working through the spec there are notes throughout advising to compile in the terminal. What is the purpose for running something in the terminal versus simply doing it via Xcode? So far I have only really worked directly in my IDE and I am just not sure if this is a problem or if I should be working out of the terminal more. Any guidance here would be much appreciated. Thank you!"}, {"id": 2086, "value": "When I submit to the autograder, I get the following compilation error:. . stats.cpp:33:24: error: ambiguating new declaration of ‘std::vector > summarize(std::vector)’. vector< vector< double > > summarize( vector< double > v). . In file included from stats.cpp:1:. stats.h:31:38: note: old declaration ‘std::vector< std::pair< double, int >  > summarize( std::vector< double > )’.    31 | std::vector< std::pair< double, int > > summarize( std::vector< double > v);. . It seems like the stats.h file the autograder uses has the summarize function return a vector of pairs. While this makes sense, I believe that the given stats.h and stats.cpp files in the starter code say to return a vector of vectors with two values."}, {"id": 2087, "value": ". Assertion failed: (modeVal == 2), function test_mode, file stats_tests.cpp, line 119.. make: *** [test] Abort trap: 6. Hi there! I am debugging my program and received the above notice. However, the test vector contains 1, 2, and 2, so the mode number shall be 2. My mode() function logic is like this: initialize null variables called tempNum, modeNum, tempCount, and maxCount. Then, looping the vector to find the modeNum via comparison. Any suggestions? Much appreciated."}, {"id": 2088, "value": "Given an example of vector. {{1,2},{3,4}}. I wonder how to access 4, vector[1][1] doesn't seem to work. . Thanks!"}, {"id": 2089, "value": "Undefined symbol: percentile(std::__1::vector<double, std::__1::allocator<double> >, double). I have been getting this error with every function in my stats.cpp file and I don't know why. "}, {"id": 2090, "value": "In the Wikipedia article showing the percentile formula, p must be between 0 and 100 inclusive, but in the stats.h file, the requirement is that p is between 0 and 1 inclusive, so I just wanted to check which one we should use? i.e. which way should we be entering p?. . // using vector v and 25th percentile as an example. percentile(v, 25);. // or . percentile(v, 0.25);. . Also, is it possible to take the percentile if the vector only has one element? If so, would every percentile just be the one element present in the vector?"}, {"id": 2091, "value": ". libc++abi: terminating with uncaught exception of type std::out_of_range: vector. Abort trap: 6. After executing the command line ./stats_public_test.exe, I received the above message. This message is confusing to me, does anyone have any ideas about it?"}, {"id": 2092, "value": "Can we assume that vector<double> v is not an empty vector?"}, {"id": 2093, "value": "Hi, in the summarize function I tried to declare the summary as type vector<pair<double, int>> , but then when I used push_back, it gives me these errors:. about the second one, I think it's because I used push_back to add both doubles and pairs. no matching member function for call to 'push_back'. functions that differ only in their return type cannot be overloaded. . Any suggestions to fix it? Thanks!. . "}, {"id": 2094, "value": "when i run the command \"make main.exe\", i'm getting the following output. . . . . it's not an error, but it looks different to what the tutorials say my output should be. specifically, it says c++ at the beginning instead of g++. is this normal and okay, or do i need to change something? . . thanks! "}, {"id": 2095, "value": "I followed the instruction on the spec exactly on how to use the sort(v) function, but I can't compile my code when I use it. I did #include the p1 .h file, filled a test vector and sent it to my function, and xcode recognized sort as a function (it changed color), but I still can't compile with it. What am I doing wrong here?. "}, {"id": 2096, "value": "From a previous answer on piazza, when the function cannot run because it has too few elements in the vector (most functions need at least 1 element to run) they said to terminate the code. Do we need to do this, if so, how?"}, {"id": 2097, "value": "I am wondering what is different between these two outputs that I get in autograder.. "}, {"id": 2098, "value": "Hello!. I'm confused on how the summarize function is supposed to work and what it's supposed to do. I get that it's meant to create a vector of pairs but what should it be filled with? From where?Thank you"}, {"id": 2099, "value": "The error says the declaration in my stats.cpp is overloaded due to a previous declaration in stats.h . And it also has trouble to read 2 of the diagnostic files. . . "}, {"id": 2100, "value": "I think I understand the difference between the size_t and int data types, but I was wondering if the following would be valid: . . . for (int i; i < v.size(); ++i) {. \t// insert code here. }. . This compiled without any problems for me and the functions I used it in returned the correct output, so would it be ok to leave it like this? Or should int i be changed to size_t i ?"}, {"id": 2101, "value": "My 100'th percentile doesn't work for the percentile function, and I also believe that the 100th percentile is not statistically possible. How do we find it?"}, {"id": 2102, "value": "What decimal place do we need to be accurate to? I am working on the standard deviation function and it works correctly I just need to know where we are supposed to round off or if we are supposed to round off"}, {"id": 2103, "value": "I'm unable to start my debugger and keep getting the error message below. I believe it has something to do with gdb installation.. . Gdb is selected in the debugger configuration, and I'm running on WSL, but 'gdb --version' says I don't have it installed. Then when I try to install using 'sudo apt install gdb' the installation fails.. . . . . sudo apt install gdb:. . "}, {"id": 2104, "value": "Context: I am passing a vector of values to summarize function. I am then counting the frequency of each value to a new vector. I create a pair of vectors and connect (val, freq). Since the function declaration is vector of vector, I am lost in how I return a vector of vector when its a vector of pairs. . . What do I have to return from the summarize function, I know I have to pass a vector of vectors back, but the vector of pairs is not working. What must I do?. . I tried to reiterate the vector of pairs and add them to a vector of vector then pass this, its still doesnt like this. "}, {"id": 2105, "value": "When I run main.cpp, I get an error from the line: extract_column(filename, column_name); saying \"error opening\""}, {"id": 2106, "value": "Will code style and commenting be graded for this project. "}, {"id": 2107, "value": "is it possible to use visual studio for mac? "}, {"id": 2108, "value": "I have been trying to compile my test but this error came up. Can someone help me resolve this"}, {"id": 2109, "value": "In my 100-level programming course our submissions to autograder would include our name, the date of submission, and the file name. I only see on the file specs to include the file name and project UID. Is this all we are required to submit with? Would it be useful to submit the more information?"}, {"id": 2110, "value": "After implementing \"summarize\" function, I tried several times to debug my codes. I tried to use a vector of size 8 at first and tried other sizes like 6. It seems that the debugger always run my first file no matter how I change and save my new codes. And my debug console also shows Source file '/Users/wulingyun/Desktop/UMich/Winter2023/EECS280/p1-stats/stats_tests.cpp' is newer than module file '/Users/wulingyun/Desktop/UMich/Winter2023/EECS280/p1-stats/stats_tests.exe'.. . I am quite confused about running my code and test my code here in project 1.. . "}, {"id": 2111, "value": "I use Visual Studio, and I rename the cpp file according to the tutorials here(https://eecs280staff.github.io/tutorials/setup_visualstudio.html#rename-files) and make no revision to the original starter file. I also exclude the main.cpp and stats_public_test.cpp beforehand. When I run the public test, it could successfully build a solution, but popped up errors when I try to run the private test file. If anyone has a clue for that, thanks in advance!. "}, {"id": 2112, "value": "In the .h file the REM for the count function says, \"EFFECTS: returns the count of the numbers in v\". Does this mean that it returns the frequency of each number in v, or does this mean that it simply returns how many numbers are in v?"}, {"id": 2113, "value": "Here is what my Stats Private Tests is showing on Autograder and I'm unsure as to what this means? Does this mean that all of my functions are wrong? I wrote implementations for all of them. "}, {"id": 2114, "value": "Hello,. . When I am putting the vector {6,7,8,9,10} into my standard deviation function, I am getting 1.41421 which is also what I get when using a calculator online and by hand. Is it possible that the main_test_correct is actually incorrect with regards to the standard deviation? everything else I have matches up with it. The standard deviation in the correct .txt file is 1.58114.. . Thanks"}, {"id": 2115, "value": "When I ran my code after editing the json on VS Code, it showed on the tutorial that \"Hello World\" would output in the debugger, however mine only outputted in the terminal that message. Is this ok or is there something wrong with my code?"}, {"id": 2116, "value": "In stats.h it says that most of the functions require a vector that isn't empty, and stdev() requires a vector that has at least 2 elements. Is it our responsibility to ensure that the function checks that this condition is met, or will all of the test cases (even the private ones) use vectors that satisfy the conditions. "}, {"id": 2117, "value": "Based off what i learned in stats class, there is no such thing as the \"100th percentile\". (please someone correct me if I am wrong or if we are using a different definition of percentile.) In this case, should I simply have percentile() return the largest value in the vector?"}, {"id": 2118, "value": "Hi, I am trying to run the debugger. My code compiles and runs fine using the terminal, but when I try to use the debugger it gives me an exit code 1 issue. The debugger only works when I do not call functions that are in a separate file (which is why line 17 is commented out below). . Any help appreciated thank you.. . "}, {"id": 2119, "value": "I have no idea on how to fix this:. "}, {"id": 2120, "value": ""}, {"id": 2121, "value": "Error on stats.cpp:. . . Autograder also says that public and private tests not compiling, with the same error.. . Everything works on Xcode."}, {"id": 2122, "value": "In the given stats.cpp file, the mode has a double return type. However, modes have the potential for multiple outputs. Are we supposed to ignore cases where this is true or are we supposed to change the return type of the mode function? "}, {"id": 2123, "value": "Hi, I’m currently using a windows computer and whenever I try to paste the link for starter files in my browser it downloads a .gz file? Whenever I try to click on it the only app I can use to open it is notepad and it just opens cryptic text. Has anyone else encountered/ found a fix for this issue? Let me know. Thanks."}, {"id": 2124, "value": ". When I am trying to debug using stop point and the play button as I did with visual studio in EECS 183 this error pops up. At first I thought this pops up because I didn't enter command make stats_tests.exe but even when I did enter that command in ubuntu this error still pops up could someone please help me on how to debug using ubuntu and visual studio code?"}, {"id": 2125, "value": "Is v.size() an int or a double?"}, {"id": 2126, "value": "I might be dumb or I might be right but if we can use sort for those wouldn't it make the function extremely easy to implement???. . "}, {"id": 2127, "value": ". this. Below is the screenshot of all the files I have in p1-stats. I really do not know where is the stats_tests.cpp. Could someone help me with it?. . . "}, {"id": 2128, "value": "Where is stats.cpp? It wasn't in the starter files, which is where I expected it to be. I'm sure I am just missing some information about the set up of the project. Can anyone help?"}, {"id": 2129, "value": "In the Statistics Library portion of the project it says to submit only stats.h and stats_tests.cpp, but autograder asks for stats.cpp, main.cpp, and stats_tests.cpp. What do we submit, is there a separate link for the first part?"}, {"id": 2130, "value": "In my XCode file, I keep getting the error message \"2 duplicate symbols for architecture x86_64\" when I try to compile. I searched it up and it said it was because I was loading the same function twice, but I can't figure out where that's happening. How can I fix this?"}, {"id": 2131, "value": "For the mean function in stats.cpp can we just call the sum function so we don't have to rewrite the for loop?"}, {"id": 2132, "value": "Is anyone else getting errors when trying to compile using make? I am using the command make stats_tests.exe and getting this: . c++ -Wall -Werror -pedantic -g --std=c++11 -Wno-sign-compare -Wno-comment -fsanitize=address -fsanitize=undefined stats_tests.cpp stats.cpp p1_library.cpp -o stats_tests.exeduplicate symbol 'csvstream::getheader() const' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::read_header()' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::operator bool() const' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::~csvstream()' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::~csvstream()' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::csvstream(std::__1::basic_istream<char, std::__1::char_traits<char> >&, char, bool)' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::csvstream(std::__1::basic_istream<char, std::__1::char_traits<char> >&, char, bool)' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::csvstream(std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> > const&, char, bool)' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::csvstream(std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> > const&, char, bool)' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'extract_column(std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >, std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >)' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'sort(std::__1::vector<double, std::__1::allocator<double> >&)' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::operator>>(std::__1::vector<std::__1::pair<std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >, std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> > >, std::__1::allocator<std::__1::pair<std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >, std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> > > > >&)' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.oduplicate symbol 'csvstream::operator>>(std::__1::map<std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >, std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> >, std::__1::less<std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> > >, std::__1::allocator<std::__1::pair<std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> > const, std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> > > > >&)' in:    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/stats-96eb4b.o    /var/folders/df/hvpcx5997kgc73p5tdhqv1980000gn/T/p1_library-ae46a6.old: 13 duplicate symbols for architecture x86_64"}, {"id": 2133, "value": "For the summarize() function, I am trying to use the .insert function to insert another double/int pair into the middle of my vector of pairs. However, I cannot figure out how to use .insert on a vector of pairs. When I do something like. . vector_name.insert(2,{3.5,1}). to insert the pair {3.5,1} between indices 1 and 2, I'm given an error that says \"no instances of overloaded function.\". . What is the correct way to insert a new pair somewhere in the middle of a vector of pairs?"}, {"id": 2134, "value": "I am slightly confused about the summarize function. Since this function is returning a vector (unlike the other functions which return only a value) , how are we supposed to test if our function is working?"}, {"id": 2135, "value": "I am getting this error when I try to access the autograder for project 1.  On the autograder homepage it says I am not enrolled in EECS 280.  Is this something I need to do myself or is this just not set up yet?"}, {"id": 2136, "value": ". When I am trying to test the summarize function via ubuntu command line control it pops up a error as stated in the title. However, this for loop has exactly the same construct as the examples demonstrated in the vector tutorial section. I even delete them and copied the example in order to avoid the error but it was not working.. "}, {"id": 2137, "value": "So whats happening in my stats tests cpp file is that when I had a data set and when I calculated the percentile the answer is 61.9, however in the code it is really stored as 61.900000000000006, therefore causing the assert function to fail. Is there some way that I can return my percentile with a control on the decimal places ? Or should I not worry about this ? "}, {"id": 2138, "value": "sort() just sorts the elements in a vector in numerical order correct?. . For example:. . vector before sort = [1,4,5,2,3]. . vector after sort = [1,2,3,4,5]. . right????"}, {"id": 2139, "value": ". . After downloading the starter file,I tried to compile stats_public_test as the spec ask me to but it end up return Assertion 'false' failed. I am not sure if this is just what the stubs are designed to output or is simply failing. Could someone please help?. . Never mind, after reading the testing section I think this is just what it should be like."}, {"id": 2140, "value": "I noticed that in most of the starter files, endl is used to start a new line, but I think I also remember seeing \"\\n\" used somewhere. Is there a preference for which one we use/in what scenarios are they used?"}, {"id": 2141, "value": "I am trying to write the summarize function for stats.cpp, but when I try to test it in my stats_tests.cpp it doesn't even compile. I use XCode and this is the error message I am getting: . . I am not even sure if it's my function failing to compile or my test case."}, {"id": 2142, "value": "So I implemented the function.. . Wrote the test cases: the ones where I just do integers is correct. (Ex. (1+2+3)/3 = 2) works.. . But when I get use decimal tests it doesn't. . . I've thought about the integer and double division and tried the static cast but it don't work for some reason :/. . Any advice on how else can I fix this?"}, {"id": 2143, "value": ""}, {"id": 2144, "value": "I keep getting this error while compiling. I have tried re-do the sanitizer, but it is not changing anything.. . . "}, {"id": 2145, "value": ""}, {"id": 2146, "value": "Are we allowed negative numbers in the elements for these vectors? Because I am currently testing some of my functions and it is aborting whenever it hits those cases :/"}, {"id": 2147, "value": "Dear all,. . I am currently trying to debug my main.cpp (and other files) file via the json launch and I keep on getting this error:. . Here's how my Json file configuration looks like (not Honor Code by the way as this picture is on the tutorial):. . . Please let me know if there's anything that I can do about this . . "}, {"id": 2148, "value": "The screenshot below is all the starter files (and the main // stats cpp we had to create). The spec says to write tests in stats_tests.cpp, but this file is not included in the starter files. Are we supposed to create our own stats_tests file?. "}, {"id": 2149, "value": "When I downloaded the project one starter files, main.cpp and stats.cpp are not included. Are they supposed to be included? "}, {"id": 2150, "value": "I get this error, how can I fix this?"}, {"id": 2151, "value": "bash: ./stats.cpp: Permission denied. . "}, {"id": 2152, "value": "I keep getting this error message, can anyone help? Xcode."}, {"id": 2153, "value": "Should we implement double sum(); by treating it as a function that would take in 2D vectors or only 1D?"}], "links": [{"source": 1723, "target": 1723, "value": 0.9999999999999999}, {"source": 1724, "target": 1724, "value": 1.0}, {"source": 1725, "target": 1725, "value": 0.9999999999999998}, {"source": 1728, "target": 1728, "value": 1.0}, {"source": 1732, "target": 1732, "value": 1.0000000000000002}, {"source": 1733, "target": 1733, "value": 1.0}, {"source": 1733, "target": 1739, "value": 0.8916451401205646}, {"source": 1734, "target": 1734, "value": 1.0}, {"source": 1735, "target": 1735, "value": 0.9999999999999997}, {"source": 1736, "target": 1736, "value": 0.9999999999999999}, {"source": 1737, "target": 1737, "value": 0.9999999999999999}, {"source": 1738, "target": 1738, "value": 1.0}, {"source": 1739, "target": 1739, "value": 1.0}, {"source": 1742, "target": 1742, "value": 1.0000000000000002}, {"source": 1746, "target": 1746, "value": 1.0000000000000004}, {"source": 1747, "target": 1747, "value": 1.0000000000000002}, {"source": 1756, "target": 1756, "value": 1.0000000000000002}, {"source": 1767, "target": 1767, "value": 0.9999999999999999}, {"source": 1768, "target": 1768, "value": 1.0}, {"source": 1768, "target": 1948, "value": 0.6782618952928667}, {"source": 1768, "target": 2086, "value": 0.6888747637021415}, {"source": 1770, "target": 1770, "value": 1.0}, {"source": 1772, "target": 1772, "value": 1.0}, {"source": 1777, "target": 1777, "value": 1.0000000000000004}, {"source": 1778, "target": 1778, "value": 0.9999999999999998}, {"source": 1783, "target": 1783, "value": 0.9999999999999998}, {"source": 1784, "target": 1784, "value": 1.0}, {"source": 1791, "target": 1791, "value": 1.0}, {"source": 1793, "target": 1793, "value": 0.9999999999999998}, {"source": 1795, "target": 1795, "value": 1.0000000000000002}, {"source": 1797, "target": 1797, "value": 0.9999999999999999}, {"source": 1797, "target": 2105, "value": 0.6695340634119862}, {"source": 1803, "target": 1803, "value": 1.0000000000000002}, {"source": 1809, "target": 1809, "value": 0.9999999999999999}, {"source": 1809, "target": 1955, "value": 0.6126155371089814}, {"source": 1809, "target": 2089, "value": 0.6460582824697986}, {"source": 1810, "target": 1810, "value": 1.0000000000000004}, {"source": 1814, "target": 1814, "value": 1.0000000000000002}, {"source": 1816, "target": 1816, "value": 1.0000000000000002}, {"source": 1818, "target": 1818, "value": 0.9999999999999998}, {"source": 1818, "target": 1962, "value": 0.6024640760767093}, {"source": 1819, "target": 1819, "value": 1.0}, {"source": 1822, "target": 1822, "value": 1.0}, {"source": 1826, "target": 1826, "value": 1.0000000000000002}, {"source": 1828, "target": 1828, "value": 1.0000000000000002}, {"source": 1839, "target": 1839, "value": 0.9999999999999997}, {"source": 1840, "target": 1840, "value": 1.0}, {"source": 1841, "target": 1841, "value": 1.0000000000000002}, {"source": 1841, "target": 1913, "value": 0.6804138174397717}, {"source": 1846, "target": 1846, "value": 1.0}, {"source": 1847, "target": 1847, "value": 1.0000000000000002}, {"source": 1848, "target": 1848, "value": 1.0000000000000004}, {"source": 1850, "target": 1850, "value": 1.0}, {"source": 1852, "target": 1923, "value": 0.6391014819458268}, {"source": 1854, "target": 1854, "value": 0.9999999999999997}, {"source": 1855, "target": 1855, "value": 1.0000000000000002}, {"source": 1862, "target": 1862, "value": 1.0000000000000002}, {"source": 1863, "target": 2086, "value": 0.6271858328801098}, {"source": 1866, "target": 1866, "value": 0.9999999999999999}, {"source": 1869, "target": 1869, "value": 1.0}, {"source": 1871, "target": 1871, "value": 1.0}, {"source": 1876, "target": 1876, "value": 1.0}, {"source": 1879, "target": 1879, "value": 0.9999999999999998}, {"source": 1880, "target": 1880, "value": 0.9999999999999996}, {"source": 1883, "target": 1883, "value": 1.0000000000000002}, {"source": 1885, "target": 1885, "value": 1.0}, {"source": 1886, "target": 1886, "value": 1.0000000000000002}, {"source": 1888, "target": 1888, "value": 1.0}, {"source": 1890, "target": 1890, "value": 1.0}, {"source": 1891, "target": 1891, "value": 1.0}, {"source": 1892, "target": 1892, "value": 1.0}, {"source": 1901, "target": 1901, "value": 0.9999999999999994}, {"source": 1904, "target": 1904, "value": 1.0}, {"source": 1907, "target": 1907, "value": 0.9999999999999999}, {"source": 1913, "target": 1913, "value": 1.0}, {"source": 1914, "target": 1914, "value": 1.0000000000000002}, {"source": 1915, "target": 1915, "value": 1.0}, {"source": 1920, "target": 1920, "value": 0.9999999999999998}, {"source": 1921, "target": 1921, "value": 1.0}, {"source": 1922, "target": 1922, "value": 0.9999999999999997}, {"source": 1923, "target": 1923, "value": 0.9999999999999996}, {"source": 1923, "target": 1947, "value": 0.6160685029252153}, {"source": 1924, "target": 1924, "value": 1.0000000000000002}, {"source": 1926, "target": 1926, "value": 0.9999999999999999}, {"source": 1927, "target": 1927, "value": 0.9999999999999998}, {"source": 1928, "target": 1928, "value": 0.9999999999999998}, {"source": 1929, "target": 1929, "value": 1.0000000000000002}, {"source": 1933, "target": 1933, "value": 0.9999999999999999}, {"source": 1933, "target": 2150, "value": 0.6324555320336758}, {"source": 1934, "target": 1934, "value": 1.0}, {"source": 1937, "target": 1937, "value": 0.9999999999999999}, {"source": 1942, "target": 1942, "value": 1.0000000000000002}, {"source": 1944, "target": 1944, "value": 1.0000000000000002}, {"source": 1945, "target": 1945, "value": 1.0000000000000002}, {"source": 1947, "target": 1947, "value": 1.0}, {"source": 1948, "target": 1948, "value": 0.9999999999999998}, {"source": 1948, "target": 2086, "value": 0.657092379570909}, {"source": 1951, "target": 1951, "value": 1.0000000000000004}, {"source": 1951, "target": 1955, "value": 0.750583375803535}, {"source": 1951, "target": 2041, "value": 0.6425895644302099}, {"source": 1951, "target": 2086, "value": 0.6420869129418136}, {"source": 1955, "target": 1955, "value": 1.0000000000000004}, {"source": 1955, "target": 2041, "value": 0.6419505094795117}, {"source": 1955, "target": 2089, "value": 0.7158511873109028}, {"source": 1955, "target": 2132, "value": 0.6008598233120765}, {"source": 1957, "target": 1957, "value": 1.0000000000000002}, {"source": 1959, "target": 1959, "value": 0.9999999999999996}, {"source": 1960, "target": 1960, "value": 1.0000000000000002}, {"source": 1961, "target": 1961, "value": 1.0}, {"source": 1962, "target": 1962, "value": 1.0}, {"source": 1966, "target": 1966, "value": 1.0}, {"source": 1968, "target": 1968, "value": 1.0}, {"source": 1969, "target": 1969, "value": 1.0}, {"source": 1972, "target": 1972, "value": 0.9999999999999998}, {"source": 1977, "target": 1977, "value": 0.9999999999999999}, {"source": 1978, "target": 2041, "value": 0.6350852961085883}, {"source": 1978, "target": 2089, "value": 0.6572670690061994}, {"source": 1981, "target": 1981, "value": 1.0000000000000004}, {"source": 1985, "target": 1985, "value": 1.0}, {"source": 1988, "target": 1988, "value": 0.9999999999999996}, {"source": 1990, "target": 1990, "value": 1.0000000000000002}, {"source": 1991, "target": 1991, "value": 1.0}, {"source": 1993, "target": 1993, "value": 1.0000000000000004}, {"source": 1994, "target": 1994, "value": 1.0000000000000002}, {"source": 1995, "target": 1995, "value": 1.0000000000000002}, {"source": 1996, "target": 1996, "value": 1.0}, {"source": 1997, "target": 1997, "value": 1.0}, {"source": 1998, "target": 1998, "value": 1.0}, {"source": 1999, "target": 1999, "value": 0.9999999999999999}, {"source": 2000, "target": 2000, "value": 1.0000000000000004}, {"source": 2001, "target": 2001, "value": 0.9999999999999999}, {"source": 2002, "target": 2002, "value": 1.0}, {"source": 2003, "target": 2003, "value": 1.0}, {"source": 2006, "target": 2006, "value": 1.0000000000000002}, {"source": 2010, "target": 2010, "value": 1.0}, {"source": 2019, "target": 2019, "value": 1.0}, {"source": 2022, "target": 2022, "value": 1.0000000000000002}, {"source": 2024, "target": 2024, "value": 1.0}, {"source": 2041, "target": 2041, "value": 1.0}, {"source": 2041, "target": 2089, "value": 0.6061032181989394}, {"source": 2042, "target": 2042, "value": 0.9999999999999998}, {"source": 2045, "target": 2045, "value": 1.0}, {"source": 2050, "target": 2050, "value": 1.0}, {"source": 2057, "target": 2057, "value": 1.0000000000000002}, {"source": 2058, "target": 2058, "value": 1.0}, {"source": 2064, "target": 2064, "value": 1.0}, {"source": 2066, "target": 2066, "value": 1.0000000000000002}, {"source": 2067, "target": 2067, "value": 1.0000000000000002}, {"source": 2068, "target": 2068, "value": 0.9999999999999998}, {"source": 2069, "target": 2069, "value": 0.9999999999999998}, {"source": 2071, "target": 2071, "value": 0.9999999999999999}, {"source": 2078, "target": 2078, "value": 0.9999999999999999}, {"source": 2080, "target": 2080, "value": 1.0}, {"source": 2082, "target": 2082, "value": 0.9999999999999999}, {"source": 2086, "target": 2086, "value": 0.9999999999999997}, {"source": 2089, "target": 2089, "value": 0.9999999999999998}, {"source": 2093, "target": 2093, "value": 0.9999999999999999}, {"source": 2094, "target": 2094, "value": 1.0000000000000002}, {"source": 2099, "target": 2099, "value": 1.0}, {"source": 2103, "target": 2103, "value": 1.0}, {"source": 2105, "target": 2105, "value": 0.9999999999999998}, {"source": 2108, "target": 2108, "value": 0.9999999999999997}, {"source": 2111, "target": 2111, "value": 0.9999999999999993}, {"source": 2121, "target": 2121, "value": 1.0}, {"source": 2124, "target": 2124, "value": 1.0000000000000002}, {"source": 2130, "target": 2130, "value": 0.9999999999999997}, {"source": 2132, "target": 2132, "value": 1.0000000000000002}, {"source": 2133, "target": 2133, "value": 1.0}, {"source": 2135, "target": 2135, "value": 1.0}, {"source": 2136, "target": 2136, "value": 0.9999999999999996}, {"source": 2141, "target": 2141, "value": 1.0000000000000002}, {"source": 2144, "target": 2144, "value": 1.0000000000000002}, {"source": 2147, "target": 2147, "value": 0.9999999999999998}, {"source": 2150, "target": 2150, "value": 0.9999999999999998}, {"source": 2152, "target": 2152, "value": 0.9999999999999999}]}