{"nodes": [{"id": 1519, "value": "I was wondering if there is a way for me to go over the private test cases that I lost points over, just to see what I can do better for future projects. "}, {"id": 1520, "value": "Hi. Could someone please take a look at me and my partner's submission for project 4? We lost a lot of points on private tests when we caught all 21 bugs and made sure to thoroughly test the code. I'm not sure what we lost points on.. . My uniqname is edwila. Thanks."}, {"id": 1521, "value": "Hi, I have an extension for project 4 until tomorrow and it just got put into canvas today as a 0. Will this be changed after my extension?"}, {"id": 1522, "value": "Title, not sure what caused all these private test cases to possibly crash. I went into OH where I had my code looked at and the IA stated that everything seemed to be fine. The only thing I'm a little iffy on is the end() implementation, which I assumed was given to us (since begin was technically given to us), but even then that should only affect iterators.. . uniqname: elghoulh. . The worst part of all is that I had memory sanitizers enabled, so if there were any issues, ideally they should've been caught by test cases."}, {"id": 1523, "value": "So my highest score on the autograder submissions for p4 was a 61/63. My last submission was a 58/63 because of an error I missed. My final score was calculated based on the recent score (58/63). I thought it's always the highest score taken. Is that not the case?"}, {"id": 1524, "value": "After the private tests were released, I came to see that all of the private tests for api.cpp failed. I have no clue how this is even possible, or why we are given private tests on something that we aren't even prompted to test, while all of the public tests passed. The point of writing test cases is to make sure that you can catch any bugs that the public tests don't, but how am I supposed to catch bugs for private testing when I am not prompted to write test cases to begin with. Why are we graded on private tests on code that we aren't supposed to test ourselves?. . P.S. I had 63/63 on submission, and everything seemed to worked perfect."}, {"id": 1525, "value": "My list test insert 3 private test failed and I have been trying to figure out why. I have not been able to write a test case where my insert function fails. Is there anything obviously wrong with my insert function? Thank you so much.. . "}, {"id": 1526, "value": "I got a 61/63 on the public tests, but when the private tests came back I got an 80%. I don't think it's fair considering there was no way we could test our api other than the autograder and the tests that were provided to us. How would I make sure this doesn't happen again? "}, {"id": 1527, "value": "Hello, . when I'm trying to iterate through the queue list using a for loop, my code never enters the for loop. I tried 3 different for loop conditions, but it still won't work. I think that there may be an error when I add a student to the queue- specifically, I don't think the student 'stays' in the queue.. . I create a student Sonia, of which I enter/assign the location, position, and uniqname, and then do queue.push_back(Sonia). But queue.empty() (after a student was added and I try to add another student) always equals true, meaning that there are no students in the queue. Could someone check my implementation to see why this may be happening?. . I've used the debugger and it skips over the for loop. As a result, the json with a queue of people comes out to be \"null\". I've also used the sanitizer, and there doesn't seem to be any memory leaks.. . Thank you in advance! My uniqname is skore. "}, {"id": 1528, "value": "Hello, . . For Project 4, I got almost all the points on the public tests, 62/63, but when my score came back, it turns out I missed a huge amount of points on the private tests, dropping my project grade to 80%. . . I can't figure out what I did wrong. Is there a way to see the private tests so I at least know what I failed and I can review/ do better next project? "}, {"id": 1529, "value": "I was looking over our p4-web grade and was a bit disappointed with the grade I got until I noticed that nearly 12% of our grade was lost in api private tests.. . I have a feeling that all these failed test cases came from not correctly updating the positions of the students after a DELETE request. I thought we had taken care of this in our code but upon review I'm starting to believe that we just flat out missed this.. . Could you confirm if this was indeed the reason we lost 12% of our grade? If so, I feel really really really stupid. I looked over the spec and didn't see any mention of this but it's honestly so obvious that I can't believe I missed it. It also feels a bit harsh and frustrating to lose that many points for something like this if the rest of our implementation was fine.. . Could you advise for better understanding how we could have/should have gone about tracking the position of each student to have avoided this issue? I have the feeling we missed some really obvious method or something that would have easily fixed this. Thanks!"}, {"id": 1530, "value": "I got an interview next week and I just want to get some idea how to talk about it with them. Tbh I'm still not sure if I can say \"I build an API\" or something like this. I implemented the list.h but I'm not even using it in api.cpp. What's the best way to describe this project in a tech interview? Would it be better to talk about p3 instead of this one since I totally understand what I'm doing in p3, but for p4 all I can say is \"I'm reading this in and process it and writing this out\"."}, {"id": 1531, "value": "Hello,. . Is there supposed to be someone at the office hours today because there's no one and I'm trying to figure out if I should leave or not. There was a girl in there helping but after me she basically never returned lol.. "}, {"id": 1532, "value": "Hi, I am trying to get the EECS Office Hours Queue website for Project 4 to run in a way that I can add a uniqname, description, and meeting link into the Sign-Up and have the input show up on the Queue to the right. The way I opened the website was by clicking the file index.html in my Downloads and hitting Open with Google Chrome. Is this how I should be doing this? Because the website opened but it's not letting me add anyone to the queue, aka, I think it is not registering input. Is there a way to do this? See the screenshot below.. "}, {"id": 1533, "value": "Title"}, {"id": 1534, "value": "I have an unsuppressed cout statement in my delete function that will prevent my output from matching 1:1. This cout statement was used purely for testing purposes on delete and otherwise matches the output when commented out. I didn't intend to use this cout statement in the final version of the code and accidentally left it unsuppressed. Despite this unsuppressed cout statement, I was still passing the public tests for api. This is in line 186 of my final autograder submit on api.exe. I know this might be a shot in the dark, but can anything be done to disregard this or potentially allow another submit to make this change?"}, {"id": 1535, "value": "We were missing some bugs and realized we needed to write some tests for the copy constructor. We decided to copy the test from the assignment operator since they perform a similar operations on the list and we wanted to test that the copy constructor was working in a similar manner to the assignment operator. As such, our last two tests ended up being very similar but tested different functions. The autograder flags this as code duplication despite them testing different functions. We chose to have two similar tests because we felt that having a similar test case will allow us to more clearly see the problems with the functions we were testing. Are we supposed to use different data sets even though the functions are different but the data sets and the operations we use to test our functions are the same?. . Sincerely,. mjohar and akshatar"}, {"id": 1536, "value": "My List_tests.cpp compiled on the autograder but then for the tests it says not submitted although it was. I saw other posts with people saying the is because of the use of the ++ postfix, however we never used ++ as a postfix and only ever used as a prefix. Why did this happen even though the file was submitted and compiled?. "}, {"id": 1537, "value": "Should our code be able to handle a erase function applied to an empty list?"}, {"id": 1538, "value": "When I run all of my test cases through Caen they show up with no errors but when I run them through the autogravder none of the bugs are caught. I am confused as to why this could be happening"}, {"id": 1539, "value": "Resolved"}, {"id": 1540, "value": "Hi my uniqname is gahyuny and I passed all the public tests but my list private templating test won't compile and I can't seem to figure out why. I have checked all my return types for the functions and the constructors and in nowhere I put a specific data type to return. Can you look at my code on autograder and see if there are any errors? Thank you so much !!"}, {"id": 1541, "value": "Our destructor properly destroys all the nodes, but leaves behind an empty list that can still be added to, is this considered a memory leak. for example: . . my_list.~List();. ASSERT_TRUE(my_list.empty());. Is allowed by our implementation.. . All our destructor does is clear the list to we have to fully destroy it?. . . My uniqname is saike."}, {"id": 1542, "value": "I get this error for test 3 and only test 3: . Screenshot_2023-03-29_at_6.26.12_PM.png. I am not sure why. I was not getting it before but then I implemented my error handling and it started happening. All the other tests work fine. Here is my main function and my function for get /api/queue/head/:. Screenshot_2023-03-29_at_6.26.24_PM.png. Screenshot_2023-03-29_at_6.26.36_PM.png"}, {"id": 1543, "value": "If two Iterators are pointing at a null pointer, do those Iterators equal each other?"}, {"id": 1544, "value": "Submitted my list tests, first time I thought it was due to a memory leak, so once I fixed that, I submitted again. Still a 2 on the return error, but I have no iterators being unused and there were no helper functions written in list.H either for the sake of the tests. Does anyone know what other possibilities it could be?"}, {"id": 1545, "value": "not sure why this is seg faulting. i have asked a few people to help me debug and I have not gotten an answer.. Screenshot_2023-03-29_at_5.35.57_PM.png"}, {"id": 1546, "value": "what does an empty GET queue look like?? "}, {"id": 1547, "value": "In my own test_in, I did 3 post methods and then 3 delete methods, this resulted in a test out to having the 3 post methods being created but only 1 of the delete methods being created. I even putted couts just to check between in the loop of while(cin >> method >> endpoint) which just says the number \"1\" and out of the while loop which shows \"Done\", but it only resulted to showing each of the 3 post methods and the 1 delete method that are printed showing the number 1 and right after showing Done, telling me that the while(cin>>method>>endpoint) stopped. This was how I formatted my test_in. However, when I test out only doing 6 post methods, it works out perfectly fine.. . Similarly, the Get head method also shows an issue. I was sure that it was the formatting as while method stops immediately after based on the Done print seen, but I'm not entirely sure and also think it could be the code.. . "}, {"id": 1548, "value": "I'm not sure why it says this. Is there a proper way to run Valgrind on Mac? . . Btw, I got this message after making and running my list tests, and then saying this: leaks -atExit -- ./List_tests.exe. . "}, {"id": 1549, "value": "I am trying to get the last bugs for the project and for some reason my test cases’ results don’t show up in the vscode terminal. It just says “Running test: <test_name>” and then blank. What could be the problem ?I doubt it is an infinite problem because this test in particular has remained untouched and it did run and show PASS not long before"}, {"id": 1550, "value": "I've checked appropriate template headers on everything, overloaded iterator dereference operator, return types... Unsure of what to do. Exit status 2."}, {"id": 1551, "value": "When I run the tests, it sometimes stops at a certain function and doesn't output anything. Auto grader says this is because it is timed out. How do I fix this?. "}, {"id": 1552, "value": "Hi, I want to ask if I missed 1 for the list_tests, how many points will I possibly lose for the final grade?"}, {"id": 1553, "value": ". I'm getting this error and I'm not sure what this means. Does anyone know?"}, {"id": 1554, "value": "When I run the API.cpp tests on my computer they all pass but on the Autograder the position is some massive number and the Content-Length is off too."}, {"id": 1555, "value": "Hello, I'm having the issue described in the P4 FAQ with the test cases not compiling on CAEN, and I just wanted to know specifically what is doing wrong. I assume my usage of iterator++; is not allowed and instead I should use ++iterator;, but I want to check in case there's something else I'm doing wrong too. Thanks!"}, {"id": 1556, "value": "Tests are running fine on VS code but output on autograder is blank, not sure how to fix the problem. My uniquename is emms. "}, {"id": 1557, "value": "I'm not sure if I'm missing this inside of the documentation, but how do we write the headers for the responses? The \"HTTP/1.1 201 Created\" and etc. Is it just a (c++) string appended to a json object? None of the examples really say how to print/write out that first line"}, {"id": 1558, "value": "Fixed"}, {"id": 1559, "value": "hi, i made a post last night but i am still having the same problem. . . my list_tests are compiling, but it is saying there are no test cases submitted so we get 0/21 for test cases and fail other tests involving list_tests"}, {"id": 1560, "value": ". so for all 5 cases I get content length that is exactly 1 lower that it is supposed to be. I checked whitespace and it seems to have no problem to me. I have no idea what's going on."}, {"id": 1561, "value": "When I run my code through AG, I am getting flagged for memory leaks. In specific, I lose points on the student list test on student list. I am not exactly sure how to fix this. Also, I am not sure if the memory leak is actually coming from the test file or a function from list that is being called in the test file. Bellow I have included the error I am receiving. Any ideas on what to do?. . "}, {"id": 1562, "value": ". I'm unsure why my programme has a memory leak. I use the clear function in my list destructor so I don't know why this error would occur. Am I supposed to delete the new node that I created in push_back, push_front, and insert?. . My uniqname is jwytang."}, {"id": 1563, "value": "In one of my test cases, I assign one value to itself. When I run my test cases through my compiler (vs code) I am getting an error: I have included the error message bellow. However, when I run the code through autograder, I don't receive any errors. It all compiles, no false positives, and I catch all 21 bugs. What may be the problem?. "}, {"id": 1564, "value": "Hi, in my List_tests.cpp, I have copied the code from List_comile_check.cpp and let it become one of my test case. Will this be considered as violation of honor code? "}, {"id": 1565, "value": ". The big three confuses me, and I'm trying to make sure I implemented the overloaded assignment operator correctly and am correctly making a deep copy of a list. Here, it says that even though the two copies' \"elements\" arrays point to the same array, their respective addresses in memory are different (0x1000 vs 0x1010). . . By this logic, I cannot check the beginning address of a list to ensure I've made a deep copy and not a shallow copy, because even a shallow copy would have two different addresses. Am I understanding this correctly? If so, is there anything else I can do to check that I've implemented the operator correctly? "}, {"id": 1566, "value": "I've written all the test cases that I could think of but am still missing 7 on the autograder, could anyone give any tips on what test_cases I'm missing?"}, {"id": 1567, "value": "Is there a reference available for writing the templates for the standard library list iterator? When attempting to create an iterator in my member functions for api, I'm receiving the following error:. . I have template headers above each function, but I'm not sure if this is the right route to go."}, {"id": 1568, "value": "Hello, for some reason the autograder did not read in any of my List tests, despite them both working on CAEN, and we had the return exit status two problem that other people were having. I was wondering if there is any way that I could get that submit back, I currently only have one submit left and would not have any way to check if our code is catching the instructor bugs after. Thank you!"}, {"id": 1569, "value": "In the list_tests, I didn’t use the pointer_type so I don’t know how to delete the object.. I uses clear() but it doesn’t seem to work well.. Also, the autograder cannot recognize some of my private tests, which also confuses me.. If someone can check a bit for me, I will much appreciate it."}, {"id": 1570, "value": "For the error handling portion of api.cpp, can both requirements be implemented in one statement? I have an implementation for the invalid path, which allows me to pass all the API tests, but when I implement for method is not appropriate for the path, i am running into errors. How can I go about this?"}, {"id": 1571, "value": "Hi, my List Private Templating Test is failing, I have triple-checked the code to see if I am returning int instead of T, and I am not. My Exit Status is \"2\" is that has any significance. Thanks for the help. My uniqname is yuyaoh"}, {"id": 1572, "value": "I am using VS Code, and I am not able to open my code in a WSL window. When I open a WSL window my terminal directory is set to username@mylaptop, which I guess is the Linux home directory or something. While I am able to use /mnt/c to navigate to my files in the terminal, the file explorer within VS Code still has no file open. The issue is when I click open folder VS Code automatically looks in the username@mylaptop location, and forcing it to open my actual code from my files exits the WSL window. Does anyone have a solution? I have been stuck in this loop and my code is basically just a text document right now."}, {"id": 1573, "value": "Are we allowed to change the function signature to pass in the Iterator by reference instead of value? . . My issue is that if I have 2 iterators that point to different elements of the list, and then use erase for both iterators, both iterators should be set to nullptr (so we can invalidate the iterators and not use them anymore).. . This means that if I use the == operator with the 2 iterators, it should return true since == is comparing the Iterators' node_ptrs (which are now both nullptr). . . My test is returning false though, which I think is because the current function passes Iterators in by value. So can we change the signature?"}, {"id": 1574, "value": ". . ??"}, {"id": 1575, "value": "Will the delete request ever be in the middle of a series of requests? The one test case we have test05 is the only one with DELETE AS A REQUEST. I was just wondering if I need to account for removing a person from the json array that I made? . I don’t understand how we would remove something from the json array? I understand the linked list just not the array. "}, {"id": 1576, "value": "uniqname: lrsierra. . So for our erase function when we have the case of erasing a nod that is in between 2 people we are getting a memory leak. However, my debugger doesn't catch this even with the sanitizer. It is only showing up on Autotrader. I don't really know what the problem is tho.. . "}, {"id": 1577, "value": "In the Error Handling section of the p4-spec, it says we can assume:. All GET and DELETE requests will have a Content-Length: 0. however, how come the public test on autograder publicerror01 has a GET request with content length not equal 0? "}, {"id": 1578, "value": ""}, {"id": 1579, "value": "how to I test these two functions?. . . List & operator= (const List &rhs){. .  T& operator*()"}, {"id": 1580, "value": "I am confused on what we should be deleting in the assignment operator for list .... in other words, what comes after delete[] ? I was thinking maybe the first pointer because that would go through all the nodes and delete them until the original list was empty .. . Also ... should there be a conditional in the assignment operator function that separates the case where the list we are assigning to is empty? I was not sure if calling delete[] on an empty list would result in a seg fault.. . Thank you!"}, {"id": 1581, "value": "Hello! My implementation for the GET /api/queue/ overall seems to be working, however, in the first part of the output the position stays at 1. Any guidance on how to resolve this issue would be really appreciated!. "}, {"id": 1582, "value": "From what I have gathered from reading piazza posts similar to ours is that other people's List_tests.cpp just weren't compiling or things of that nature, however, our tests are compiling on our own machine and on the autograder. However, the autograder still says that no test cases are being submitted. We have submitted multiple times trying to change the format of our test cases to have the autograder accept them, but nothing seems to be working. . . . My uniqname is andbaker and my partners uniqname is csweiss. . We can submit our List_tests.cpp in here if that will also help."}, {"id": 1583, "value": "All of the api tests are running fine and giving the correct output on Xcode, I even set up CAEN and ran it through there, and it's also giving correct output. When I submitted to the autograder however, there is no output whatsoever, it is completely blank. My uniqname is alghanas. I have no idea what to do at this point. Any other question like this said to use CAEN and I did.. . UPDATE: I resubmitted and now its working? Must've been an autograder issue."}, {"id": 1584, "value": "hi so I'm receiving a memory leak in our insert function but I'm not sure why. When I try stepping through and debugging everything looks fine and it's returning the right node. Can someone lead me in the right direction?. . . "}, {"id": 1585, "value": "I submitted my test cases to the autograder which resulted in a UB/leak when testing the copy constructor of list in a test case. What might be the problem here? I dont think i am dereferencing a nullptr or not deleting an object on the heap after going through the debugger.. "}, {"id": 1586, "value": "I am attempting to include. . typename std::list<T>::Iterator T for all instances in api.cpp where an iterator is necessary. Unfortunately, VSCode tells me. variable templates are a C++14 extension [-Werror,-Wc++14-extensions].. This is confusing as I don't believe we were told to download specific extensions for this project.. Is there a better way to be writing these templates? . I made sure that I included . . . template <typename T>. on the line above every time I tried to write this template.. . . . "}, {"id": 1587, "value": "Same ol' story, everything else compiles, everything else works.  List Private Templating Test is failing, I have triple-checked the code to see if I am returning int instead of T, and I am not. My Exit Status is \"2\" is that has any significance. Thanks for the help."}, {"id": 1588, "value": "My partner and I don't understand why the autograder isn't recognizing our test cases as it shows that it compiled in autograder:. . we also were recommended to use CAEN which I just did and it showed that it compiled correctly:. . This is the our first post about this issue: @3649. . this is what it shows on autograder:. . "}, {"id": 1589, "value": ". "}, {"id": 1590, "value": "When we submitted our list_tests.cpp file to the autograder, the autograder doesn't recognize any of the tests in that file. It says that no test cases were submitted, and gives an exit status of 2. However, list_tests.cpp gets a 2/2 score in the no compilation warnings section of the autograder. Additionally, we ran our test cases on CAEN and they ran successfully. In previous submits, we received points for our test cases, but then suddenly we got an exit status of 2, with 0 points."}, {"id": 1591, "value": "If we were to retake the course would it be a plagiarism or cheating to reuse the codes that were used this semester?"}, {"id": 1592, "value": "Hello! I was trying to run the provided public test02 for API and every time the terminal crashes, and the exact same thing happens for my partner (picture provided below). Also, it is only processing and printing the first request correctly and the rest as bad requests. How should I go about this?. . "}, {"id": 1593, "value": "I accidentally made a public post... I submitted my codes to the autograder, and all of my test cases weren't graded.. I passed all the other tests on autograder, sanitizer, and caen as well, and there weren't any issues.. How can I fix my code to make it work on the autograder?. Any help will be really appreciated!!. . Just for reference, my uniqname is yeonjl"}, {"id": 1594, "value": "I passed all the other tests on the autograder (including the UB and leak checks), but non of the student tests were submitted.. I checked my code with the sanitizer and the caen as well, but non of them returned error.. I'll really appreciate if anyone can help me!. . . "}, {"id": 1595, "value": ". The RME for the insert function is that \"i is a valid iterator associated with this list\" and thus I used the line of code:. . assert(i != nullptr);. . to make sure that i is a valid iterator or am I misinterpreting the statement?"}, {"id": 1596, "value": "i keep getting this error, any help would be appreciated "}, {"id": 1597, "value": "We're failing UB checks for our push_front function, where we create a node by doing Node *newNode = new Node();. We don't delete this node, since it's being added to the list. Is there any other reason why this UB check could be failing? . We implemented a destructor function."}, {"id": 1598, "value": "Could an instructor take a look at my code to see why our List Private Templating Test is not compiling? We return type T everywhere it's necessary. In our list_tests.cpp, we test our functions by creating a list:. . List<int> testList;. When we try to create the list by doing List<T> testList, we get an error. Is it okay that we create lists of type int here?. We don't create any lists with type int in our List.h. Not sure where else we could be going wrong.. "}, {"id": 1599, "value": "Does anybody have any ideas for why our List Private Templating Test is not compiling? We return type T everywhere it's necessary. In our list_tests.cpp, we test our functions by creating a list:. . List<int> testList;. When we try to create the list by doing List<T> testList, we get an error. Is it okay that we create lists of type int here?. We don't create any lists with type int in our List.h. Not sure where else we could be going wrong.. "}, {"id": 1600, "value": "Like others, I have submitted List_tests.cpp and get the following error. I do get the points for List_tests.cpp compiling however. Additionally, I do not see any warnings in my IDE, and my code compiles and passes all of the tests in the CAEN environment. What else can I do to fix this issue. I have 1 attempt left for the project and I don't want to miss out on all of the test points. Additionally, I have been looking through other Piazza posts related to this issue, but I have not found something that works for me to resolve it, even though I have tried, hence in my autograder many failed submits.. "}, {"id": 1601, "value": "Hello, I've been trying over and over to get this function to behave but to no avail. No matter what I do, this function upsets the memory sanitizer and causes the whole program to stop. I don't know how to do this without essentially putting a null_ptr value into the iterator constructor or by incrementing the new_it iterator after creating it on \"last.\" Is there something simple I'm misunderstanding or doing incorrectly?. . "}, {"id": 1602, "value": "I declared the function stub in the class, similar to this and included everything that the other post about function stubs said, but for some reason my operator declaration is still giving an error. Is there something I'm doing wrong?"}, {"id": 1603, "value": "I don't know if any instructor can check my last submission but I keep getting this error when I try to test test02.in. I imagine that my json is accessing that doesn't exist but I don't know how or where"}, {"id": 1604, "value": "are there no private tests for api.cpp? is it just list? "}, {"id": 1605, "value": ". My code runs in vs code, but when I submitted to autograder I got this output. Im just confused on what this means?"}, {"id": 1606, "value": "Does anyone know if removing a submit from the queue still counts as a submission?"}, {"id": 1607, "value": "we have 11 bugs in List_compile_check.cpp and my partner and I did not change it. anyone know what the problem is?"}, {"id": 1608, "value": "Are we allowed to use #include \"json.hpp\" in api.cpp. "}, {"id": 1609, "value": "when attempting to make api.exe, i receive an error which states the following:. . List.h: In instantiation of ‘void List<T>::push_back(const T&) [with T = OHQueue::Student]’:api.cpp:33:24:   required from hereList.h:108:22: error: use of deleted function ‘List<OHQueue::Student>::Node::Node()’  108 |         Node *temp = new Node;      |                      ^~~~~~~~List.h:21:12: note: ‘List<OHQueue::Student>::Node::Node()’ is implicitly deleted because the default definition would be ill-formed:   21 |     struct Node {      |            ^~~~List.h:21:12: error: no matching function for call to ‘OHQueue::Student::Student()’api.cpp:14:9: note: candidate: ‘OHQueue::Student::Student(std::string, std::string)’   14 |         Student(string name_in, string location_in)      |         ^~~~~~~api.cpp:14:9: note:   candidate expects 2 arguments, 0 providedapi.cpp:12:12: note: candidate: ‘OHQueue::Student::Student(const OHQueue::Student&)’   12 |     struct Student {      |            ^~~~~~~api.cpp:12:12: note:   candidate expects 1 argument, 0 providedapi.cpp:12:12: note: candidate: ‘OHQueue::Student::Student(OHQueue::Student&&)’api.cpp:12:12: note:   candidate expects 1 argument, 0 providedapi.cpp: In member function ‘int OHQueue::getPosition(OHQueue::Student)’:api.cpp:52:5: error: control reaches end of non-void function [-Werror=return-type]   52 |     }      |     ^. . . how do I resolve any of the errors? i believe they all have the same cause which I believe is caused by missing scope resolution definitions."}, {"id": 1610, "value": "I'm trying to push back a json::array for the response that prints the entire queue. I have a json called \"output\", and one section of the json that says {\"results, json::array()}. In an attempt to push back students into the array and the json, I have output[\"results\"].push_back(s); where s is a student object, and I'm getting an error that says \"type_error.308 when called on a type other than JSON array or null; example: cannot use push_back() with number\". I'm confused as \"results\" is an array in my json and s is an object, and if I am understanding this correctly I thought we could use push_back on an object. This line of code works fine when I replace \"s\" with any random integer. Please let me know if anyone knows how to fix this!"}, {"id": 1611, "value": "I keep getting an error in my output of test03.out in the \"HTTP/1.1 200 OK\" line. It prints undefined computer behavior/code right before this line, but runs everything else correctly. I stepped through, and it happens right when I input method and path, though it automatically prints it and does not give any indication of where it is coming from.. . Attached is the output and where the error occurs.. . . . Let me know if anyone has had similar issues / if anyone has any ideas on how to fix this! Thanks"}, {"id": 1612, "value": "We have a segmentation fault when we try to run our test case for size(). When we use gdb it says that the error is on line 72 which is in push_back( ) and this is also what Autograder seems to be saying the same. We can't seem to figure out why this would be an issue since this is similar to the way push_back was done in the asych lectures.. . . "}, {"id": 1613, "value": "can someone explain why my style check for long lines is failing and im getting this error?. . "}, {"id": 1614, "value": "Can someone take a look at my code to help see why I am getting this error. I think I am reading in the json correctly, and I tried to use the visual debugger in my cin, but I can't seem to see why I'm still getting this error. Thank you so much.. Screen_Shot_2023-03-28_at_10.58.25_PM.png"}, {"id": 1615, "value": "Is it possible to convert queue.size() to an int? Right now I am trying to determine how to assign the position to a student, but it gives me a warning when I try to to queue.size() + 1. Is there a way to fix this? Thank you"}, {"id": 1616, "value": "When running test 02, we get the following error message. We had no other issues with the test files. We are unsure what triggered this and where to go from here. Any help would be appreciated!. "}, {"id": 1617, "value": "I got this error when I run the make test on CAEN while I'm ok with running the make test using my compiler, can anyone help to explain it? Thanks! . "}, {"id": 1618, "value": "When we run our test cases on our local machines they don’t return any errors, but when submitting on the autograder it’s exiting with a 2. It’s also saying no test cases submitted even though there are many written in the file. There is no feedback from the autograder so we’re a little lost as to where the issue is. Any help would be appreciated. "}, {"id": 1619, "value": "    #ifdef __APPLE__.     assert(freopen(\"test01.in\", \"r\", stdin));.     #endif. . For Xcode, I'm doing this ^^ for input redirection, as stated in the specs, but it's throwing an error at the assert statement. Am I doing this wrong? This is how I've used it for the other projects and it worked fine."}, {"id": 1620, "value": "I've already checked that I am returning type T for functions that return datum, I have also checked that I have not referenced anything but List<T> in my implementations. I completed all of them within the class definition as well. Is there any other reason I could be failing this check, I've already looked through other posts and they weren't helpful. "}, {"id": 1621, "value": "My list.h file passed my private tests in the IDE, but then when submitting to autograder, it displayed 6 allocations of memory leak. I don't really understand where the memory leaks are and the autograder display is a bit confusing to me so I don't really know where to look. I was wondering if anyone could help find where the memory leaks could be coming from/which function they could be stemming from? My uniquename is sabrinx if you wanted to check out the code for List.h. "}, {"id": 1622, "value": "Our student list test cases compile in our terminal but do not seem to compile in the autograder. We understand that something might violate the instructor code, we just aren't sure what that is.. . my uniqname is mbkramer."}, {"id": 1623, "value": "we are having a bit of trouble with our overload operator. It seems to be assigning the same thing to itself. Is there any thing that stands out?. "}, {"id": 1624, "value": ". Having trouble with this error any help would be appreciated "}, {"id": 1625, "value": "Hello, . I had a question about what it means to get a test with false positive. Does it mean that the implementation is wrong and we should delete/change it?. . Here is the test that gave me a false positive and if someone could explain it it would be great."}, {"id": 1626, "value": "can some one tell me if this is okay to do?. . . List<int> original;. original.push_back(1);. original.push_back(2);. original.push_back(3);. . List<int> copy;. copy = original;. . . . like can I say copy = original, bc this test case if failing"}, {"id": 1627, "value": "I got code duplication for using. . ++i;. ++i;. ++i;. ++I; . . in my test case and I tried changing it to i+=4 and it tells me. . no operator \"+=\" matches these operandsC/C++(349). List_tests.cpp(251, 6): operand types are: List<std::__1::string>::Iterator += int. . how can I fix this so I dont get code duplication anymore"}, {"id": 1628, "value": "Hello, . . my partner and I just submitted our code to the autograder but it is saying that we submitted no tests. The file was properly uploaded and included the project id so we arent sure we it says no tests are present. Could you please help us with this issue. . . my uniquname is Lania. "}, {"id": 1629, "value": "what is a valid iterator? can a valid iterator point to a list with 0 elements?"}, {"id": 1630, "value": "My partner and I are trying to catch all the bugs in the Mutation Testing Site. We compiled our test cases on our local terminals and they work, but when we submitted the file to autograder, it says \"No test cases were submitted.\" However, we submitted the List_tests.cpp file. We have 1 submission left for today, and we don't want to use it if something is wrong with autograder. Here's what we are getting: . . . . We submitted the file earlier and it worked. We added more and resubmitted, but it doesn't explain why we're catching 0 bugs. We think the file wasn't registered as submitted on autograder, but we're not sure. "}, {"id": 1631, "value": "Found answer to question originally in post but don't know how to delete this so feel free to just ignore."}, {"id": 1632, "value": ". From what I understand,  I thought that both *iterator and list.front are supposed to return datum. Is this expression wrong in the first place or is it malfunctioning due to mistakes in other part of the code?"}, {"id": 1633, "value": "I am having a bit of trouble writing the insert function's implementation. I have somthing written right now, but I am unsure if it is even correct. My compiler keeps giving me an error when i call i.node_ptr->prev. Any suggestions on what to do?"}, {"id": 1634, "value": "SOLVED"}, {"id": 1635, "value": "How are we supposed to check these private test? Can I assume that if my macos leak test and sanitizer test don't give errors, that I will get full credit on these undefine behavior and leak private tests? If not, how do they work?"}, {"id": 1636, "value": "How do you write test cases for the functions that return Iterators or deal with Iterators because it always says the identifier is not allowed?"}, {"id": 1637, "value": "I saw a similar question to this on one of the public posts on Piazza but I couldn't really find that particular error in the test cases I have written (or commented out). Its still not compiling on Autograder so I'm wondering if I am writing some of the operators incorrectly. Would someone be able to point to where I might be receiving this issue? Thank you."}, {"id": 1638, "value": "Autograder says no list tests submitted despite the file being there, also gives exit code 2. The file compiles and successfully runs in IDE."}, {"id": 1639, "value": "Does anyone know what this may mean? I'm so lost. . "}, {"id": 1640, "value": "In our test04, we are printing the right output, but our test is failing because the test is terminating due to a parsing error. . Could someone please take a look at our autograder submission to guide us on how we can fix this?. The uniqname for the autograder is priyasha.  "}, {"id": 1641, "value": "if we have an iterator: iter. could we do ++++iter to get two nodes to the right? or will ++++iter just be one node to the right like ++iter does?"}, {"id": 1642, "value": "Hi, I am struggling to understand how to keep track of the last_node. For example, in the push_front implementation, we are updating the first node each time we call it, but what about the last node? The push_front function I implemented came from lecture as well. Therefore, once we run test cases for the back() function, the last_node is still initialized. I think I may be missing something, but I'm not too sure. Thanks!. I just uploaded to autograder as well with my recent code. (uniqname: mederand).. "}, {"id": 1643, "value": "For the PATH method, we read in location and uniqname and cout location and uniqname, along with the position. How do I add a variable to a json?"}, {"id": 1644, "value": "An instructor said something around using -- on an iterator equaling end(), to traverse backwards. . But since the REQUIRES for (--) is that the \"current element is dereferenceable\", and since the end() returns an iterator with node_ptr == nullptr, wouldn't -- be impossible to use on the end() iterator?. . If so, why use -- at all in p4, if we can't 'start' from the end?"}, {"id": 1645, "value": "I'm having a similar problem with debugging as @3122 and @3212; I installed the CodeLLDB extension and used the code from the last response to @3212, and I'm still running into trouble.  When I used this configuration with the first test the debugger loaded indefinitely until I stopped it, and when I tried it with the second test it force-restarted my computer.  This is what I have in my launch.json - any ideas on how to fix this?. . "}, {"id": 1646, "value": "I have read most of the piazza posts, project review video but I still don't quite grasp what I actually have to do in api.cpp. I don't understand what I am supposed to do and how it works. Also, for the starting code on the project spec, for student structs, i tried to create string location and string uniqname but it's indicating an error. I checked several times for the library and syntax error but I can't seem to find anything. Is it wrong to include strings in the struct?"}, {"id": 1647, "value": "Does the autograder check if certain functions were supposed to be written as private but ended up being public?Does the autograder check if our functions we write to assist other already listed functions are public or private?For example, I wrote a function to deal with certain edge cases of pop_front and pop_back. Does it matter how a function like that is organized?. If so, where would we lose the points and how would we be able to tell if something was currently implemented in the right scope?"}, {"id": 1648, "value": "I am dealing with a lot of false positive tests in a row on Autograder. Since I do not have any other details besides which tests are false positives, I was wondering what I could do to figure out what is going wrong because I do not know whether it is the way that I wrote my test cases or the way that I wrote my functions in general. Additionally, I would appreciate it if any instructor could take a look at my test cases and offer any guidance as to what I can do next."}, {"id": 1649, "value": "Why there is a double free error here? . "}, {"id": 1650, "value": ". . I have the following lines of code in List constructor:. . first = new Node;. last = new Node;. . Autograder says that I have a memory leak because of the two lines above, but I made sure to delete them with \"delete first;\" and \"delete last;\" in List destructor. I do not know why I am still getting a memory leak, so I was hoping that an instructor could take a look at my code.. . Thank you."}, {"id": 1651, "value": "So I am trying to make test cases for copy all and its not letting use copy_all because it is telling me it is a private class? so should I put it in public or is there a problem with my test cases or how I am calling copy_all?"}, {"id": 1652, "value": "My tests passed and compiled on my IDE, but on the autograder it says that my student list tests on student list didn't run. It says that while running my assignment operator for lists tests there was exit status -11. Does anyone know what this means/why it wouldn't work on AG?"}, {"id": 1653, "value": "SOLVED"}, {"id": 1654, "value": ". The code runs in XCode but I'm not sure what this error is saying or how to fix it in Autograder. My code for push_back is very similar to my code for push_front, but push_front doesn't seem to give the same error."}, {"id": 1655, "value": "I'm getting a false positive for this test case, but I honestly don't see what could be wrong with it. Does \"false positive\" only mean that I'm failing one of these assert statements, or could it be something else in there too? If it's just assert statements, I can't see why any of them should fail in a correct implementation!. . I could really use some help with this, or even just a hint. If you want to look at the rest of my code, my uniqname is byagh."}, {"id": 1656, "value": "I am getting this error while testing iterators in List_tests.cpp. I made an iterator and set it equal to list.begin(). However when I try to call our erase function it gives us this error. Please help."}, {"id": 1657, "value": "This is a very general question that is probably addressed somewhere, but I couldn't find a firm answer on the specs. I have a working api.cpp and list.h, but I used std::list for api. It seems the purpose of list.h is to use it for api.cpp, but it doesn't say anywhere that you HAVE to use your own implemented list. All the specs says is \"Use the standard library list so you can get started on this project right away. Later, you’ll implement your own linked list that works just like the STL.\", but the specs also say you can use <List> library in api.cpp. So do we have to use our own list from list.h, or could you still get full points for using std::list?"}, {"id": 1658, "value": "I submitted my test cases to the autograder which resulted in a UB/leak when testing the copy constructor of list in a test case. What might be the problem here? I dont think i am dereferencing a nullptr or not deleting an object on the heap after going through the debugger.. "}, {"id": 1659, "value": "According to the grading guideline only iostream, string, cassert, sstream, utility  are allowed. However, cstddef is included in List.h starter file. Are we allowed to use cstddef?"}, {"id": 1660, "value": "We created a while loop in main, but for test01 the output is printing twice. We also have tried doing while (cin >> method >> endpoint) but that did not fix it either. the output is correct it just does it twice, is there a way we can fix this?. "}, {"id": 1661, "value": "After I use this command line: curl localhost:8000/api/ in a second terminal. What do I do after to get the localhost looking like a webpage."}, {"id": 1662, "value": ". anybody know what this means? "}, {"id": 1663, "value": "If there is a bad request in the middle of the other requests should there be a space between them in the out file?For example, the bad request below happens and then a good request happens after. Should there be a space between Content-length 0 and the Created line?HTTP/1.1 400 Bad RequestContent-Type: application/json; charset=utf-8Content-Length: 0HTTP/1.1 201 CreatedContent-Type: application/json; charset=utf-8Content-Length: 94"}, {"id": 1664, "value": "Could somebody pleaseee let me know if this is the output they get from running the List_compile_check file?. This is what I got:. 104242424231. . Thank you!!!"}, {"id": 1665, "value": "I have been getting this error:. . libc++abi: terminating with uncaught exception of type nlohmann::detail::type_error: [json.exception.type_error.302] type must be string, but is nullFor test02.in onwards, and since test01.in only contains GET i feel this might be an issue with my POST function, which I have implemented like attached below, where print_post() and print_bad() are helper functions to cout the response and work fine. I am just not sure which part of this is returning null. For information this function runs in an if statement for when the method read from the input file says POST and is in the correct path.. . "}, {"id": 1666, "value": "How would we alter the input redirection given in the Xcode set up. We are given assert(freopen(“main_test.in”, “r” , stdin));As an example how would we change this for project 4"}, {"id": 1667, "value": "What if we have more requests in a file after the bad request? Are we supposed to stop reading in if there is an error?"}, {"id": 1668, "value": "Since end() points to a place that past the node, how do we erase the last node in a list?. Do you need to keep doing ++ from first?"}, {"id": 1669, "value": "Do we need to test the case that we are erasing the anything past the last node?. List<int>::Iterator iter_temp = list_temp.end(); . list_temp.erase(iter_temp);. . I know this will erase nothing, but I just want to know if we need to include this case in the List_tests"}, {"id": 1670, "value": ". . Something is wrong with my pop back function as I was testing my tests cases and as I tried debugging it, the line highlighted seems to be the issue but I have no idea whats wrong with it"}, {"id": 1671, "value": "According to the spec, we need to return the bad request and read the remainder request if the HTTP path and method have some errors. So how could we identify whether the error request has a json body and when we need to read the json?. "}, {"id": 1672, "value": "Hello, . . I'm having a hard time understanding what the problem is for list_compile_check.cpp file, it's saying my operators aren't working but I implemented them correctly and I went to office hours, and they said that it was just a bug. I don't understand what is going on with the operators. I attached an image of the problem of autograder below. Thank you.. . "}, {"id": 1673, "value": "How do we check whether our project code could lead to memory leak."}, {"id": 1674, "value": "For the push_all function, how should we test it? . This is the structure I'm using but I'm meeting some error. Can I get some hint on how we should test copy_all?. Thank you!. . List<int> queue;. List<int> pushed_queue;. List<int> copy_queue = queue;. . pushed_queue.push_all(queue). . ASSERT_EQUAL(pushed_queue, copy_queue). . "}, {"id": 1675, "value": "After running the tests multiple times on caen computers, on my own and on my partners computer all our tests compile, run and pass. However, when submitting in autograder our tests compile but doesn't run and we do not know the sources of the errors we are getting because they autograder does not display them. We went to our lab IA for help which solved one problem we were having but when trying to fix every other missing bug we receive the same error on autograder. Any help would help would be greatly appreciated. "}, {"id": 1676, "value": "My List_tests compile and my code passes my tests but I'm not getting any points for them on autograder. Can an instructor look at my code? My uniqname is sreejav"}, {"id": 1677, "value": "Hi, for some reason when I start my python server and before I do a post to the queue my server runs a get queue request, I'm not sure what would be causing this, but this is what it looks like: "}, {"id": 1678, "value": "When I try to index through the queue list, it gives me this error:. I'm not so sure why that is. Are we not allowed to use [] to find an object at a specific index in a list?. "}, {"id": 1679, "value": "I'm asking for clarification on the types of errant requests that we will need to account for.. . In the spec it mentions that all GET and DELETE requests will have a content length of 0 and no json object. However, in the file public_error01.in, we get an errant GET request because the path isn't one of the three (api, api/queue/head/, api/queue/) but also that the length is 2 and we have a blank json object to account for. . . So I have two questions:. Are there only two cases for erroneous requests? . Where the method/path are incorrect, but the content length and json align with the request type. (GET/DELETE have length 0 and no json)Where both the method/path are incorrect and the content length and json don't follow the appropriate format. (like the public_error01 file where the GET request has a length/json). If no to the question above, will there ever be an errant request where the method and path are correct, but the content length/json object aren't correct? (ex: correct request and path: GET /api/ , but the content length isn't 0)."}, {"id": 1680, "value": "Hi, I try to test my implementation for == and =!, and I got this error.. . My test case is following.. . I wonder what does this error means and how could I solve it.. . Thanks"}, {"id": 1681, "value": "I'm getting a sanitizer error when I try to copy one list to another. This is the line that the sanitizer is pointing to from my push_back function: p->datum = datum. I have no clue why this is an error. This is my copy_all loop: "}, {"id": 1682, "value": "Hi my uniqname is gahyuny and I passed all the public tests but my list private templating test won't compile and I can't seem to figure out why. I have checked all my return types for the functions and the constructors and in nowhere I put a specific data type to return. Can you look at my code on autograder and see if there are any errors? Thank you so much !!"}, {"id": 1683, "value": "Is there any benefit of testing different variables types in the list besides ints?  Or could the bugs be caught just using just ints?"}, {"id": 1684, "value": ". I have checked all of the conditions and still don't know why I'm getting segmentation fault. I've checked default constructor functions and tried testing it only with push_front() function but it didn't work. It would be great if I could get any help."}, {"id": 1685, "value": "Hi! I wrote my push_back function as this, and I test the erase function as shown on the right side. The autograder shows that there's a memory leak for push_back when reading line 178 in test.cpp. I wonder what cases that? Is that because I use \"++iter\" and try to erase iter? Thank you!!! . "}, {"id": 1686, "value": "Does anyone know what this error in the unit test framework means? I have been unable to debug my list tests because I get this error every time I run the debugger.. "}, {"id": 1687, "value": "Do we need to update the element that Iterator point to ? For example, If I have a list(1,2,3), and my Iterator point to 2, I use insert function to insert 4. what element that my Iterator point to? 4 or 2?. "}, {"id": 1688, "value": "When I run server.py and add a student without a unique name or location or meeting location, my server crashes. Can we assume this will be properly formatted?"}, {"id": 1689, "value": "solved"}, {"id": 1690, "value": "I keep getting errors that I am trying to set iterators equal to references to iterators, and I just want to know which functions used in the compile check require a reference and which ones should return an iterator.. . Here is an example of the error:. error: cannot bind non-const lvalue reference of type ‘List<int>::Iterator&’ to an rvalue of type ‘List<int>::Iterator’. . And another error I get when I make the functions return by reference:. error: binding reference of type ‘List<int>::Iterator&’ to ‘const List<int>::Iterator’ discards qualifiers. . Any help would be appreciated."}, {"id": 1691, "value": "For the deep nesting style guide thing in the autograder, does int main() count as a level of nesting? I have been trying to fix the issue in my code, and the deepest nesting I count (not including int main()) is only 4, so I wanted to check if that was the case, and if I needed to count that as well. "}, {"id": 1692, "value": "when comparing two iterators, are we comparing the pointer they hold or the datum at those pointers? If we are comparing the pointers, how should we go about implementing the == operator in iterator? . . I tried to compare node_ptr to rhs.node_ptr but it never worked. Any tips?"}, {"id": 1693, "value": ". I'm not getting any errors locally when I run my tests (with Address Sanitizer on), but on Autograder and CAEN, I'm running into this issue.. . . . . Here's the code used in that test case. I have no idea where the segmentation fault could be coming from. Any insight would be greatly appreciated!. . **Update: I ran the local compile checker and made a change to pop_front due to a failure. It passes locally now, but I'm still getting the same error in CAEN."}, {"id": 1694, "value": "I'm so confused about what this error message means. Is it about memory leak? How can I know which test line/list function is having trouble? . "}, {"id": 1695, "value": "I am trying to use begin and end iterators for my clear() and copy_all() functions, but I can't declare the variables without errors when I try to compile. I am writing the functions outside the class by using the List<T>:: scope for the functions. I have tried. . Iterator begin = begin();. and. . Iterator begin;. begin.begin();. and. . Iterator begin = Iterator::begin();. and a few other attempts but none are working. How should I use iterators?. "}, {"id": 1696, "value": "solved. Thanks"}, {"id": 1697, "value": "Would we ever call the List copy constructor on a list that isn’t empty? "}, {"id": 1698, "value": "Like once I figure out theres a 400 error, what do I do with that information. It says return it in the spec, but Im not sure exactly what that means, from the users point of view."}, {"id": 1699, "value": "I'm not really sure why I'm getting a zsh: segmentation fault here, the code seems to work but how do I get rid of that message? . "}, {"id": 1700, "value": "So when I make my list compile check exe file, I get 2-3 errors along with long lines of errors/warnings (I think they're segmentation faults). In my compile check file, there are errors like a certain list can't be created because there aren't any default constructors, or that one of the operators hasn't been implemented.. . Does this mean that I need to create these things in list.h, or are there deeper issues within a specific function (doesn't mention any function in the errors)?"}, {"id": 1701, "value": "The Autograder told me there is a memory leak in my push_front function and I have tried for the past two days but I can't figure out where it's coming from. Can someone help me understand or at least push me in the right direction?. "}, {"id": 1702, "value": ". I have checked all of the conditions and still don't know why I'm getting segmentation fault. I've checked default constructor functions and tried testing it only with push_front() function but it didn't work. It would be great if I could get any help."}, {"id": 1703, "value": "How would I go about implementing a position tracker function so that when someone is popped off the queue their position automatically updates? Because right now I have to manually do that since the my position variable is also my student struct variable."}, {"id": 1704, "value": "\"If one of the errors above occurs, read the remainder of the request, including any headers or body. Then, return the following response after reading the entire request. \". Does this mean I return an error if and only if the entire request is bad, i.e if some requests are bad and some others are good, I don't display the 400 message?. . OR would it mean that my server responses would look like. -Error. -OK. -Created. -Error..."}, {"id": 1705, "value": "Hello, so I am having an error reading the data for POST into the json. In line 237 of my code I attempt to traverse by iterator, but when I do this error pops up. . . . . However, when I omit the traverse by iterator for loop, the values of the student appear as null. I am not sure where to proceed from here and I am also not sure how to debug this, since when I put a breakpoint at line 237, the beginning of the for loop, the debugger does not stop. I would appreciate it if someone could look at my api.cpp file and give me some hints on how to proceed, and I thank you in advance!"}, {"id": 1706, "value": "I was doing my project when suddenly I got this error seemingly out of nowhere.. . I tried to undo my edits in API prior to the issue, but it didn't work. What should I do?"}, {"id": 1707, "value": "When I call push_back to make the test case for erase, there came a seg fault in this line in erase:. . target->prev->next = target->next;. I think the reason is because target->prev is a nullptr, and it looks like whenever I call push_back, the previous node it points to is null. How can I fix this? . "}, {"id": 1708, "value": ". Hello! the error is showing that more than one operator matches these operands. I don't know why this is happening and how to fix this."}, {"id": 1709, "value": "Resolved"}, {"id": 1710, "value": "Hi, we have tried multiple ways of trying to implement pop_back() but we kept getting a segmentation error and we can't spot why. I have attached a screenshot of gdb and the code and the test that we wrote for pop_back.. .  . "}, {"id": 1711, "value": "Caught 19/21 bugs, unsure what else to test. These are the test I've written so far. . . copy_all. copy_cstor_assignment. cstor. iterator_comparisons. iterator_dereference. list_clear. list_erase. list_insert. pop_front. simple_push_back. simple_push_front"}, {"id": 1712, "value": "Hi, when i submit to autograder i keep getting these memory leak errors. But when i run them locally with my installed sanitizers i do not get errors anymore (i fixed one after the first autograder submission). . Does anyone have any advice about how to go about solving this particular error?. . I do not quite see where my code is going wrong because this error does NOT seem like the ones i am used to (memory object that arent deleted).. . (also im sorry I would go to office hours to solve this but I work my job during the sessions so i cannot get help there)"}, {"id": 1713, "value": "When making the copy constructor for list, I am given this error when I try to use copy_all in the function.. . . . I am confused because I thought we were supposed to call copy_all in the copy constructor. For instructors who might check my code on the autograder, my most recent submission on the autograder does not use the copy_all function in the copy constructor. My current code is a little different, and I call copy_all(other) inside the {   }.. . I'm not too sure how to go about fixing this."}, {"id": 1714, "value": ". When I am testing the assignment operator the above erros pops up for assignment operator and then copyall function and then push_back. . I think I implement the assignment operator correctly as intructed by the recording;. 1. clear and then copy all . for copyall I think is also fine by . 1.assert the to be copied list is empty. 2.range through other and then push back all of them. so I think there are something wrong with my [ush back probably. Here is How i impement it. 1. create a new node. 2. initialize is datum. 3. consider edge case where is empty. 3.1if is edge case then we need to set first and last both point to the new node. 4.consider normal case. 4.1if is normal case then just put it behind last and let last point to it. . and here comes the weirdest thing the sanitizer tells me the problem is at thte point where I initialize the datum of the new node. for that one I simply use -> dereference the local variable that stores this new variable and set its datum could Someone please help?"}, {"id": 1715, "value": "Hello, we are having some trouble implementing our insert() and erase() functions. We are kind of confused working through a potential solution but we have something that we think works. . Can someone please take a look at our code and see if we are on the right track or if there is something we are doing wrong?. . Any help would be greatly appreciated :)"}, {"id": 1716, "value": "My Visual Studio code has every instance of \"T\" after template <typename T> underlined with an error saying \"identifier 'T' is undefined\". Has this happened to anyone? If so, how should I go about fixing it?"}, {"id": 1717, "value": "Is GET api/queue/tail/ a valid path or should that be considered in my error handling since it is not included in the 5 actions we are implementing"}, {"id": 1718, "value": "Hi so in our copy test we are receiving a memory leak in the autograder. We've been having issues with this memory leak and think it's because we aren't deleting the copy list. The original is still being destroyed but we don't think that the copy list is being destroyed with it. However, we're not sure on how to implement the deletion part."}, {"id": 1719, "value": "Why does this file violate the requires clauses for the operator functions several times? I can catch it with assert, but then it won't show the other tests.. . For example, it'll use empty lists to test functions that cannot have empty lists, or use a nullptr as an argument to a function that requires a dereferencable pointer."}, {"id": 1720, "value": "I have a test that creates a list, fills it with elements, then uses an iterator going backwards. . for (List<int>::Iterator j=l.end(); j!=l.begin(); --j). to test the values. Yet I'm getting a false positive error for my test.. . Is my reverse iteration method incorrect or is it something to do with the auto grader?. . PS; just noticed this could have something to do with past the end iterator. Can someone explain how reverse iteration would work in that case?"}, {"id": 1721, "value": "When do I output HTTP/1.1 200 OK and when should I output HTTP/1.1 201?"}, {"id": 1722, "value": "I'm very lost on how to test my iterator functions. I tried creating a new node and calling the iterator constructor with that node, but I'm getting errors and I'm not sure why. Could somebody please help?. "}, {"id": 1723, "value": ". I create nodes in multiple functions in my List.h by doing this: Node *current = new Node();. Do I need to delete current at the end of the function?. "}, {"id": 1724, "value": "Is there more functions we have to consider? For example DELETE is usually for the head, but would would we have to consider if the input is delete/tail or delete/queue? . I'm asking due to my consideration for error handling?"}, {"id": 1725, "value": "I'm getting this compile error for List.h. Does anyone have any idea why this might be happening?"}, {"id": 1726, "value": "can someone explain what these two errors mean and how I can fix them, I get them when I make my test cases and I am not sure how to fix it :(. . error1:. ./unit_test_framework.h:320:5: error: static_assert failed due to requirement 'is_equality_comparable<const char (&)[12], List<std::string> &, void>::value' \"types cannot be compared with == and !=\"    static_assert(is_equality_comparable<First, Second>::value,. . error2:. ./unit_test_framework.h:320:5: error: static_assert failed due to requirement 'is_equality_comparable<const char (&)[12], List<std::string> *&, void>::value' \"types cannot be compared with == and !=\"    static_assert(is_equality_comparable<First, Second>::value,"}, {"id": 1727, "value": "Is there an easier way to check if a path is valid rather than iterating through the entire string character by character? "}, {"id": 1728, "value": "I implemented a destructor in List.h and am currently testing copy_all(). In my test case, there are two lists -- an original and a copy. My destructor involves setting the \"victim\" (node to be deleted) to \"last,\" but I think it's getting confused because there are two \"lasts\" (one for each list) in my test case.. . I've checked and the \"last\" is correctly set for both lists in the test case. Every time I test, the \"victim\" is set to a different address (and not the \"last\" address for either of the lists I've created) and I get an address sanitizer warning. The destructor is working successfully for my first few test cases. . . This might be a problem in something I've implemented, but I am struggling with the larger concepts of big three and linked lists and wanted to make sure this isn't a big conceptual error/I'm not missing something big. If it is, can someone point me in the right direction? If not, is there anything generically I should consider to try to fix this?. . Thank you!"}, {"id": 1729, "value": "Every time I try to ./List_tests.exe I get this error : bash: ./List_tests.exe: No such file or directory. . Can someone tell me why?"}, {"id": 1730, "value": "Hello,. . The spec says we need to print a blank line at the end of a bad request. Does this mean that I need cout two \"endl\" following \"Content-Length: 0\"? For example, cout <<  \"Content-Length: 0\" << endl << endl;. . Also, I notice that the response to \"delete\" also has a new blank new line. Should we do the same thing? . . Thank you! . . "}, {"id": 1731, "value": "I was just testing to make sure my code to read and write json files work correctly. After creating a json object and cin >> object, then cout << object, the format of that object should look like (thats the format for test02.in):. {    \"uniqname\": \"awdeorio\",    \"location\": \"Table 3\"}. INSTEAD, it looks like:. . {    \"location\": \"Table 3\",    \"uniqname\": \"awdeorio\"}. . Is this supposed to happen?"}, {"id": 1732, "value": "Resolved"}, {"id": 1733, "value": "I have been trying for hours to read in the json body correctly and it doesn't seem to be working. I'm doing exactly what the json spec says to do:. . json body;. cin >> body;. . But nothing seems to be working. I'm definitely at the correct position - right before the opening { bracket. However, it's not letting me work with the json object. Please help!"}, {"id": 1734, "value": "When I use the leak check tool, it shows thiese info. I'm not sure if it means I have a memory leak or not. Does anyone know what does these info mean?. . "}, {"id": 1735, "value": "I am getting this error when for the erase function. Does anyone know what might cause this?. "}, {"id": 1736, "value": "I did a test case where I pop_back a list of size 1, but this is giving me a seg fault. Is this because my function is wrong or because pop_back isn't expected to do this?"}, {"id": 1737, "value": "Do we need to write test cases for operators (++, --, =, ==, !=), and/or copy constructors? Or are we just doing the member functions?"}, {"id": 1738, "value": "When we try to create an iterator to parse through the JSON object in api.cpp, is adding the template declaration above all we need to do to use an iterator? "}, {"id": 1739, "value": "Should the count/results in the queue output also be in a json file to output? As of now, I have it as just cout \"count\" and \"results\", but I can't seem to get the indention and spacing right. Thanks"}, {"id": 1740, "value": ""}, {"id": 1741, "value": "I return some response when the queue is empty for the get and delete request, but I don't see how to respond if the queue is empty for a post request or GET /api/ request."}, {"id": 1742, "value": "resolved"}, {"id": 1743, "value": "I keep getting this malloc error for my push functions and I have tried leak checking but it still tells me the same thing. Could someone take a look at my implementation and maybe help me figure out where this error is coming from?. "}, {"id": 1744, "value": "I have a problem where I try to run tests through the ./List_tests.exe command and it would run the tests until a certain test and then it would just stop? It doesn't output anything - it just stops there.. . It just stops at test_push_front."}, {"id": 1745, "value": "I read in a json object via cin (cin >> body) and I'd like to store its objects in my student struct. However, I'm getting an error when I try to store it via the following code. Am I reading in json wrong?. . . . For reference, I'm storing a pointer to a student (s) inside of a request (r).. . Edit: does this have anything to do with how I'm reading in body? I essentially read all of the headers in individually, then I created json body, then used cin >> body. Is that correct?"}, {"id": 1746, "value": "Hi, I wonder what the List Private Templating Test test is for, since I always fail on this in autograder, thanks!! (I checked my code and there's nowhere I misuse List<int> instead of List<T>.)"}, {"id": 1747, "value": "How do we create iterator objects for testing in list_tests.cpp if Iterator is a private class of list (and thus its ctor is private)?"}, {"id": 1748, "value": "Hi! I wrote the push_back() function as this, but there is a memory leak. Could someone help me to check why there's a memory leak in my code? Thank you! . "}, {"id": 1749, "value": "We're not sure if our copy_all function is implemented correctly since we use it in the big 3 but those don't run correctly when we test (we get memory leaks/seg fault). In copy_all is it correct to loop through other and just push each datum into the empty list? Do we need to add extra assignments for next/prev or would push_back already take care of that?"}, {"id": 1750, "value": "I am attempting to write a function that will return the position of a student in a list, which I have called queue.. My for-loop should work by comparing a string called name to the Name member variable in my Student struct. I have no idea why my function will not recognize Name, or why my iterator will not increment.. Please help. My uniquname is laurea"}, {"id": 1751, "value": "My partner and I are trying to test our copy constructor and overloaded assignment operator however we keep getting a segmentation fault and we don't know what is wrong with our code. The debugger is also being difficult and we can't step through our code. Is there anything in our code here that looks incorrect?. . Copy Constructor:. . Copy_all Function:. . "}, {"id": 1752, "value": "Can anyone tell me why is there an extra empty line in test 05?. "}, {"id": 1753, "value": "When there is a memory leak in your test case, does that mean something is wrong with the test case or your actual code, thank you :)"}, {"id": 1754, "value": "I saw that you can use stdio for debugging api.exe in your launch.json configuration. But how do you debug on a PC? Here is my current configuration:. "}, {"id": 1755, "value": ". . Hello, could someone help me understand this error? I know that i am not deleting something correctly somewhere in my erase function, but I am not sure what it is. I am clearing all my lists after I use them, and I am just not sure where I am missing the delete. Thanks!. . . "}, {"id": 1756, "value": "I have been waiting on the oh queue for 3 hours but it said something like you were kicked out of the server, it crashed. . . We have a few questions. One of our pressing issues was the comparison operator in iterator class. This is the function:. . bool operator==(Iterator rhs) const {.           // 1.  return node_ptr == rhs.node_ptr;.           // 2.  return node_ptr->datum == rhs.node_ptr->datum;. }. . We are unsure whether we are comparing pointers (1) or comparing the datum at those pointers (2). When we tried the 1st one, our code always fails and the assert statements don't work. However, when are comparing the datum, it works. Right now, it only works because there is no duplicate datum in an of our lists. However, if first had 2 and last had 2, our code would work since they have the same datum but we know that the iterators are pointing to two different places. so we are really confused. . . . We were also very confused about the erase() function iterator. This is our implementation: . . void erase(Iterator i) {.         for(Node *np = first; np; np = np->next) {.             if(np->datum == i.node_ptr->datum) {.                 delete np;.                 return;.             }.         }.         return;.    }. . We aren't sure if this is the correct implementation since we only compare the datum at the pointers. And rather than a for loop, is there a better way to implement this function?"}, {"id": 1757, "value": "How can we test the bad request? I didn't see any test cases for this"}, {"id": 1758, "value": "I am trying to write definitions for the Iterator member functions (end, erase, and insert) but I am having trouble getting the correct syntax for the scope. For the insert function, first I tried. . template<typename T>. void List::Iterator::insert(List::Iterator i, const T &datum){. \tassert(false);. }. Which didn't work. Then I tried. . template<typename T>. void List<T>::Iterator::insert(List<T>::Iterator i, const T &datum){. \tassert(false);. }. Which gives me an error that the List<T>::Iterator has no member function erase. I tried a few other variations before this as well that didn't work. I am confused on how to do this properly for a class within a class."}, {"id": 1759, "value": "This question is not directly related to p4. When I was writing list_test, I notice I could call the iterator copy constructor in it even it is defined in iterator private. Why is this? Is it because the list_test is the .cpp version of list.h, so we can use the private functions in list.h?"}, {"id": 1760, "value": "I've asked an IA during office hour last week and he told me it's ok to have no copy constructor and assignment for iterator, and turns out it works well too, but I do see there's a private test for big 3 of iterator on autograder. Should I add them? If so, how?(we don't have copy_all function for iterator)"}, {"id": 1761, "value": "We're having trouble with the json file. . libc++abi: terminating with uncaught exception of type nlohmann::detail::parse_error: [json.exception.parse_error.101] parse error at line 1, column 1: syntax error while parsing value - invalid literal; last read: 'H'. . we've looked at the other piazza posts and are still confused on why this is happening.. If someone could take a look at our code in autograder that would be great."}, {"id": 1762, "value": "I keep getting this nlohmann::detail::parse_error error. A lot of the questions I've seen on this topic do not yet have an answer.. . . "}, {"id": 1763, "value": "Hello - I've been trying to fix my implementation of api.cpp, because currently, all of the public tests for api.cpp on the autograder produce the exit status \"(Timed out)\", and the output is blank. Therefore, I currently don't have any feedback on my implementation.. . One submission my partner and I made to the autograder received 40 out of 63 public points, and that submission earned one point on each of the api.cpp public tests and produced some (incorrect) output from cout.. . Could anyone look into my partner and I's most recent submission? I'd appreciate some help figuring out why api.cpp worked at one point, but is timing out now.. . In case it helps, I'm using a while loop that reads in one variable as the conditional (i.e. while (cin >> x)), then doing the following in the body of the while loop:. reading the other variables,reading a content JSON (if it exists),checking the method and endpoint for validity,deciding what to cout using if-else statements based on the method and endpoint,and finally, printing the desired output using cout."}, {"id": 1764, "value": "In my output, I am having an issue with the position. I created a separate function to find the position of the person which I believe is properly implemented. . . When I run my code I get this error:. . terminating with uncaught exception of type nlohmann::detail::type_error: [json.exception.type_error.308] cannot use push_back() with object. . I have tried:. Changing where I declare the student variablelooking into the push_back function to ensure I am using it correctlyconsidering how I am constructing the JSON. Any ideas?"}, {"id": 1765, "value": "im stuck on 19/21 test cases i do not know why!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"id": 1766, "value": "i'm getting two memory leak errors but I don't know where I'm leaking the memory. These are the errors i'm getting. I am not sure if I need to delete something in the push or insert and erase functions but I'm deleting all whatever node I make everywhere else. Please let me know where exactly I'm leaking memory and how I could fix that.. "}, {"id": 1767, "value": "As for returning 0, should that only be in the main() function when all the text from the .in file has been read in? Is return 0 only used to end the program when there is no input left? All my functions that read in and set the json output are voids and I don't see a point in returning a value there.. . As for error handling, I read somewhere else that I should keep reading in requests after I encounter an error - does that mean that after api.cpp reads in an error and prints out the error message, it continues reading in and printing out outputs?"}, {"id": 1768, "value": ". When I try to write this code my address sanitizer complains :/"}, {"id": 1769, "value": "The standard library list and iterator aren't capitalised but our implementation is List and Iterator. Do we need to change which list we're using in api.cpp once we've finished List.h?"}, {"id": 1770, "value": "Just wanted to make sure I implemented this function correctly. When the iterator passed to insert() has a nullptr, does that mean we're inserting at the end of the list/to an empty list?"}, {"id": 1771, "value": ". . . . Can someone tell me why I am failing like 99% of the style checks with this?. . uniqname is thtalan!"}, {"id": 1772, "value": "So I was able to output each student in the queue, but I can't seem to get the indentation and \"count\" and \"results\" right. Should everything other than the queue be outputted regularly using \"cout\" ? . Thanks"}, {"id": 1773, "value": "List.h compiles on my computer but returns errors I don't understand on AG; would someone mind checking my submission and helping me understand them?. Likewise, api.cpp is not compiling due to errors finding functions implemented outside of main and the OHQueue but cant be called in main.. . . . Uniqname: csanjana"}, {"id": 1774, "value": "Hello, my VS code shows the following errors about my clear() function and I don't know how to fix it:. . ./List.h:107:7: error: call to non-static member function 'clear' of 'List' from nested type 'Iterator'      clear();      ^~~~~./List.h:114:7: error: call to non-static member function 'clear' of 'List' from nested type 'Iterator'      clear();      ^~~~~. . The screenshots are about my implementation of clear() function and the lines where the error massage points to. I included friend class List in the iterator. And I made clear() function to be static but it still won't work.. . "}, {"id": 1775, "value": "fixed"}, {"id": 1776, "value": "I am having trouble outputting the queue. I am guessing this requires a for loop to iterate through the queue, but when I try that it doesn't print out anything. . Thanks"}, {"id": 1777, "value": "I declared List as a friend class of Iterator, but I'm still getting a ton of errors in List_compile_check that functions are inaccessible. I've tried the friend declaration at the top of the class as in Juett's Lecture and under private: following where the comment says \"add any friend declarations here\" and neither works."}, {"id": 1778, "value": "the autograder is saying my it_erase test function is reporting an error for correct code. i've looked over my function & cannot figure out how i'm implementing this test function wrong, as all my other test functions are working & iterate through the list in the same way. could someone take a quick look over my code there & give me a hint as to what my issue is / if i'm misunderstanding what this function is supposed to do? thanks!"}, {"id": 1779, "value": "Hi! According to the autograder, I got a lot of memory leak in pop_front() function, I just call clear() in my List destructor, and I called pop_front() in clear() when list is not empty. I wonder can someone help me to check why there's a memory leak in my code?. "}, {"id": 1780, "value": "I uhh.... Have probably one of the worst structured designs :/. . Is it ok to use globals as long as my code is passing the public tests"}, {"id": 1781, "value": "solved"}, {"id": 1782, "value": "I keep getting this error . . libc++abi: terminating with uncaught exception of type std::bad_cast: std::bad_cast. . whenever I try to use back() or front().. . My implementation of front() I took from the lecture slides. "}, {"id": 1783, "value": "For this function, I set the iterator that did the erase to the beginning of the list by i = first,. I changed the template. from. . void erase(Iterator i);. to. . . void erase(Iterator &i);. I wonder if this is ok?. And I also wonder how can we delete other iterators that is currently pointing to the erased node.. thank you. . . "}, {"id": 1784, "value": "List.h:197:16: error: assignment of member ‘List<int>::Iterator::node_ptr’ in read-only object  197 |       node_ptr = node_ptr->next;      |       ~~~~~~~~~^~~~~~~~~~~~~~~~List.h:198:15: error: binding reference of type ‘List<int>::Iterator&’ to ‘const List<int>::Iterator’ discards qualifiers  198 |       return *this;. . i don't get these errors. Can someone please help me out?"}, {"id": 1785, "value": "I have been trying to test insert, erase, and increment/decrement for list.h. To do so, I tried creating iterators using .begin() and .end() then incrementing and decrementing to various positions in the list for testing. Doing so with .begin() worked fine, however, every time I tried doing this with .end() it gives a segfault (since .end() returns a nullptr since it is one past the final node in the list). Am I missing something or is there no way use the .end() function to create an iterator without it resulting in a segfault?"}, {"id": 1786, "value": "So I am running into an error where a gsi told me that I might need a destructor to automatically call clear() when the list is done but whenever I run my second test case, I keep getting this error.. . So here is my test case.. . Somebody told me in office hours today that it was due to my push_front and push_back functions. I'm not exactly sure what I'm doing wrong but here they are for reference.. . . What am I doing wrong?"}, {"id": 1787, "value": "I got a 63/63 on Autograder but when I try to do the \"Real Web Server\" part, I am getting a Broken Pipe error. I installed Python and checked the version using 'python3--version' (I am on version Python 3.11.2). I entered 'python3 server.py' in the terminal and it responded with 'Starting server on localhost:8000' as expected. I then navigate to http://localhost:8000. Then I go to http://localhost:8000/api/. This is when I am getting an error. The webpage also says that localhost didn't send any data. I have attached screenshots below.. Screen_Shot_2023-03-27_at_2.35.04_PM.png. Screen_Shot_2023-03-27_at_2.34.40_PM.png"}, {"id": 1788, "value": "I noticed on the autograder there is a private test named \"list test iterator big three.\" A few places in the starter file for list.h it said we had the option of implementing the big three in a variety of different locations (for example for the List class overall, or for the iterator class, etc.). Does this test imply that there must be a big three for the iterator class, or simply that wherever we chose to implement the big three it will be tested there?"}, {"id": 1789, "value": "do we create an iterator and set the value it points to and compare it with list.begin() for example? Every time I try to compare iterators, I get a malloc error. How do I fix malloc errors?"}, {"id": 1790, "value": "This is my code:. .   //REQUIRESz: list is not empty.   //EFFECTS: Returns the last element in the list by reference.   T & back() {.     assert(!empty());.     return last->datum;.   }. . . This is the error message:.  runtime error: member access within null pointer of type 'struct Node'"}, {"id": 1791, "value": "When I try to run the api public tests, I keep getting the wrong value for both content length and position. I know that this is because I did not initialize my pos (which I made a member variable in the Student struct) to be the correct thing. I imagine there is a function I should write that iterates though my queue and returns the position, but I don't know how to go about doing that. . . Can someone help?"}, {"id": 1792, "value": "In autograder I got 20/21 on list_test, but I cannot figure out what kind of test is lacking after trying all kinds of test cases I could think of.. Can a instructor take a look at my autograder submission (uniqname: hanzhen) and tell me which kind of test case I need to write to get the last point? Thanks a lot."}, {"id": 1793, "value": "The Mutation Tests section of my autograder shows Exit Status 2 without any further error messages. It doesn't show where or how the error occured. What is the issue?. +I checked for compiling. My code compiles both locally and on CAEN, and autograder shows no compilation warnings."}, {"id": 1794, "value": ". . Hi! we keep getting this issue when trying to test our api. I  think it is the way we are accessing the json objects, but I am not sure what the issue is. .  student.location = js_in[\"location\"];. this is how we are accessing the variables.. Any help would be great thanks!"}, {"id": 1795, "value": ". json urls;. urls[\"queue_head_url\"] = \"http://localhost/queue/head/\";. . . I followed the tutorial for making a json object on lobster, but it does not work, I included json.hpp and was using namespace nlohmann::json."}, {"id": 1796, "value": "gthaxton. . how can you fix this error Im getting it on Xcode and the autogravder I don't see why the inputs cannot be taken in?Screenshot_2023-03-27_at_1.11.56_PM.png"}, {"id": 1797, "value": "How is return 0 different from error handling? I read through it a few times and am not understanding how they would be different."}, {"id": 1798, "value": ". Our tests give the right output, but all exit with this error. I think it has something to do with the file continuing to read in information despite there being no more content to read in. The current condition to continue reading in information is while(!cin.eof()){}; however, this continues to read in one more time after the input file has finished giving requests."}, {"id": 1799, "value": "I was wondering if someone would be able to check my autograder submission? It is saying that I am failing \"Student list tests on student list\" and I dont really know if I am interpreting that correctly. I am passing the tests that I created on my on device so I don't think that is what the error is saying. . . My uniquname is Lania. . Thank you!"}, {"id": 1800, "value": "\"If one of the errors above occurs, read the remainder of the request, including any headers or body. Then, return the following response after reading the entire request.\". . Why would we need to read the remainder of the request if there is an error? Can't we just throw the error? Also are we supposed to continue to parse the rest of the requests if there is an error or should we just stop?"}, {"id": 1801, "value": "When I submit my test cases to the autograder, I get a memory leak error. If I'm reading the error correctly (though I'm not completely sure) it's coming from my test case for erase(). I'm struggling to figure out what exactly the issue is and whether it's coming from my erase() function or my erase test case. I create a list and and iterator in my erase test case, but I did that in other test cases that don't seem to be giving errors. And in my erase() function I create a new node, but I delete it at the end of the function. . Does anyone know what might be causing this error?"}, {"id": 1802, "value": "1. For the GET /api/queue/  function, how do we print out the json array that have the indentation. Right now it prints out the json array that starts with [ instead of {, I wonder how can we make the json array into a single json, or print with indentation.. . 2. Also for the content length, it's seems that it's not an addition of all the content-length of the json in the json array. I understand the length represents the byte length, but in this case, I wonder how can we compute it.. . My uniqname is yuyaoh.. . The left is mine, and the right is the correct one.. . "}, {"id": 1803, "value": "Does anyone know what this means? My code seems to compile in my terminal, but when I submit it into autograder, I get this.. "}, {"id": 1804, "value": "Does anyone know what the following error means?. Running test: copy_ctorList_tests.exe(31287,0x10b941600) malloc: *** error for object 0x7ff7bc44afd0: pointer being freed was not allocatedList_tests.exe(31287,0x10b941600) malloc: *** set a breakpoint in malloc_error_break to debugzsh: abort      ./List_tests.exe. . I have no idea what malloc means but this is the error I got when testing my copy ctor."}, {"id": 1805, "value": "When submitting in Autograder the Exit status is 2 and it says that \"No test cases were submitted.\" These are the tests I submitted, I don't know if there is one I have to delete for it to compile.. . ** Test case \"test_iterator_begin\": PASS** Test case \"test_iterator_copy_ctor\": PASS** Test case \"test_iterator_ctor_at_pos\": PASS** Test case \"test_iterator_deref_op\": PASS** Test case \"test_iterator_dft_ctor\": PASS** Test case \"test_iterator_dnequal_op\": PASS** Test case \"test_iterator_end\": PASS** Test case \"test_iterator_equal_op\": PASS** Test case \"test_iterator_equalequal_op\": PASS** Test case \"test_iterator_erase\": PASS** Test case \"test_iterator_insert\": PASS** Test case \"test_iterator_minus_op\": PASS** Test case \"test_iterator_plus_op\": PASS** Test case \"test_list_assignment\": PASS** Test case \"test_list_back\": PASS** Test case \"test_list_clear\": PASS** Test case \"test_list_copy_ctpr\": PASS** Test case \"test_list_dft_ctor\": PASS** Test case \"test_list_empty\": PASS** Test case \"test_list_front\": PASS** Test case \"test_list_pop_back\": PASS** Test case \"test_list_pop_front\": PASS** Test case \"test_list_push_back\": PASS** Test case \"test_list_push_front\": PASS** Test case \"test_list_size\": PASS"}, {"id": 1806, "value": "Hi, I am currently trying to write test cases for my code, but I'm not sure if my test cases are even running. I tried placing cout statements under each test case, and none of them are printing so I am not sure what to do because I need my test cases to be able to run in order to start debugging my code. Any advice?. . uniquename: samyerra"}, {"id": 1807, "value": "I keep getting a lot of problems with unit_test_framework.h and there are different errors and warnings every time I try to run my test cases. I think my compiler isn't configured for the right C++ version but I'm not sure how to fix it.. "}, {"id": 1808, "value": "in my pop_back function, I am trying to reposition the nodes but it is giving me a bad access error. . . the line of code it's giving it on is . . last->next = nullptr. . I have already checked if the list contains 0 or 1 node so I don't know what is causing this error. . . this error only comes up when i'm checking one specific test case but works for all the other places i'm using this function so i'm unsure what the problem could be. . How could I correct this error?"}, {"id": 1809, "value": "I'm a little confused on how we're supposed to parse headers. Can we assume there are always just 3? Do we have to use the values in any way or can we just skip over them with a set number of cin >> dummy calls? Thanks."}, {"id": 1810, "value": "When dealing with multiple requests, it appears that after I cin the json object AND I cin a blank line using getline(), then I can cin the next request header. Is anyone else also experiencing this? I was wondering why this is so? "}, {"id": 1811, "value": "Wondering if we have to read in host from the header and use that in our responses or if we can just assume it is always localhost."}, {"id": 1812, "value": ". . I get this error on autograder. Not sure what the reason is that it's not working. If someone could point out the issue it would be appreciated. Here is my code:. . . This is also how I am implementing the copt constr:. "}, {"id": 1813, "value": "specs says to return 400 error if queue is empty. is this the same 400 error (bad request) as the one u r supposed to return for an invalid endpoint????"}, {"id": 1814, "value": "Hello,I've been getting this error in List.h when making the List compiler check. I searched up potential fixes to the issue but I have not been able to come to a solution. I am not sure exactly what function might be causing this issue.Undefined symbols for architecture arm64:  \"List<int>::Iterator::Iterator(List<int>::Node*)\", referenced from:      List<int>::begin() const in List_compile_check-94c0a2.o      List<int>::end() const in List_compile_check-94c0a2.old: symbol(s) not found for architecture arm64clang: error: linker command failed with exit code 1 (use -v to see invocation)make: *** [List_compile_check.exe] Error 1"}, {"id": 1815, "value": "I am very confused on how to find what the content length should be whenever we output something. How should we determine what the correct output length is each time, whether we are outputting a single student from the list or the entire queue?"}, {"id": 1816, "value": "How could I solve this?. . . . "}, {"id": 1817, "value": "resolved. "}, {"id": 1818, "value": ""}, {"id": 1819, "value": "I am getting this error when trying to set the student member variable to the size of the list when adding a new one to the end. . . Implicit conversion loses integer precision: 'std::list<OHQueue::Student>::size_type' (aka 'unsigned long') to 'int'. . I think I might be going about it the wrong way, I have tried changing the type from int to size_t but this has not worked."}, {"id": 1820, "value": "I'm trying to start my list tests but I can't debug because I keep getting this error in my unit testing framework. I'm not sure what's causing it but I do remember I deleted some function stub from the List_test.cpp file because I thought I didn't need it. Is that the issue?"}, {"id": 1821, "value": ". The Iterator class says \"A user of the class must be able to create, copy, assign, and destroy Iterators.\" However, in lecture it was said that we did not need to implement the big 3 for Iterator since the memory management is handed in list. Do we need to add any of the big 3 for the Iterator class?. "}, {"id": 1822, "value": "when implementing get queue, I'm not sure what should I do to get all 3 json"}, {"id": 1823, "value": "In my most recent autograder submission, I got an error saying I did not submit test cases and it exited with status 2. I am not sure what I did wrong since I did not change any of the includes or headers at the top, and the tests compile on my end, and for the autograder in the undefined behavior check and student tests check. I am just not sure what I did differently especially since they compile locally. "}, {"id": 1824, "value": "I'm processing the request from test_02 but I don't know how to add a student to the list, do we need to create a student instance and initialize it?"}, {"id": 1825, "value": "And it seems to work. Did I do something wrong??? "}, {"id": 1826, "value": "I'm reading from the test file but i don't know what should be the condition of the while loop if we don't use eof"}, {"id": 1827, "value": "I have looked online and tried the fixes offered in @422, however, it is only a temporary fix and  I am still getting Warnings when I try to make List_tests.exe.. . Here is my warning message:. . make: Warning: File 'List_tests.cpp' has modification time 6.5 s in the futureg++ --std=c++11 -Wall -Werror -pedantic -g -Wno-sign-compare -Wno-comment List_tests.cpp -o List_tests.exemake: warning:  Clock skew detected.  Your build may be incomplete.. . Is there a more permanent solution that can be used? I've tried \"sudo hwclock -s\", making a clean file, and resetting the Linux time with \"date --set\". "}, {"id": 1828, "value": "I'm confused by this pro-tip implying we use std::list in api.cpp. Do we not use our own List implementation in api? What was the purpose of writing the List implementation then?. "}, {"id": 1829, "value": ". . I have the following lines of code in List constructor:. . first = new Node;. last = new Node;. . Autograder says that I have a memory leak because of the two lines above, but I made sure to delete them with \"delete first;\" and \"delete last;\" in List destructor. I do not know why I am still getting a memory leak, so I was hoping that an instructor could take a look at my code.. . Thank you."}, {"id": 1830, "value": "Hello,. . . I keep on getting this error in the terminal when I try to test my code.. . I'm not sure exactly what it's referring to. If someone could help me figure it out, that would be greatly appreciated!. . ./api.exe < test01.in > test01.outlibc++abi: terminating with uncaught exception of type nlohmann::detail::parse_error: [json.exception.parse_error.101] parse error at line 3, column 1: syntax error while parsing value - unexpected end of input; expected '[', '{', or a literalzsh: abort      ./api.exe < test01.in > test01.out. . Thanks!"}, {"id": 1831, "value": "The long functions test for autograder is failing for my main in api.cpp. It said I had 43 lines on a previous submit so I took out 3 lines. When I submitted again it said it was still too long with 42 lines. According to the style guide, comments and braces don't count so at this point I am not sure what is expected since reducing lines didn't help and I also only count 38-40 lines. How should I go about this?. . uniqname: elizatay"}, {"id": 1832, "value": "I'm having an issue with diff where the file *looks* the same but has an issue. Opening the .out and ,out.correct up in notepad++ reveals that the correct version has carriage return chars on every line before the newline. While I'm able to add that to most of the lines, some of the lines are being printed by json.dump(), which I cannot edit. Do I need to forcibly add a carriage return to every \\n in the json.dump()?. "}, {"id": 1833, "value": "I don't know why my code cannot read in json.  . . "}, {"id": 1834, "value": "Hi, it looks like doing this test case is causing a segmentation fault. However, when I insert cout statements into the list.back() function to see what last's datum is, the correct item is printed out. Therefore, I'm not sure where the segmentation fault is coming from. I am returning last's datum in the list.back() function, for the record. Please help!. . Thanks"}, {"id": 1835, "value": "I'm trying to use List<int> list(); to make a new list for my list tests but I'm getting an error that the declaration is incompatible. Is this not the proper way to make a new list? I did it this way because this is similar to what we did on p3 to make new cards in our card tests."}, {"id": 1836, "value": "I passed almost other tests in the autograder, but the list private templating test doesn't compile. I implemented all the functions in List.h inside the class. So what problems may cause this error?"}, {"id": 1837, "value": "In my list_tests.cpp I can't create an Iterator (it says its undefined) unless it's through begin() or end() and I can't increment or decrement an iterator even though I've implemented the overloaded functions. Is this how it's supposed to be? If not, how do I make it so that I can create and modify iterators in lists_tests.cpp?. . Additional Note: I believe I have put the operators under the public part of the Iterator class because it says \"public:\" and then all of my iterator operator functions are right below it. That's why I'm confused because everything seems to be public."}, {"id": 1838, "value": ". I'm having issues with memory leaks specifically on my pop functions (which therefore means my clear function and destructor also has memory leaks). I've written out memory diagrams of each instance used in my tests and still have no idea what's going wrong. "}, {"id": 1839, "value": "should are test cases be with doubles and ints? because when I tried to make test cases with decimals and no whole numbers I got errors? Is this because I can't do this, or is this something I have to fix in my code to allow for doubles?"}, {"id": 1840, "value": "How should we go about figuring out how many headers to read in? My understanding is there can be 2 or 3 headers, and there is no indication of which is which. Additionally, I'd like it to stop reading in before getting to the opening body bracket so I can just use cin >> body for reading in the json script."}, {"id": 1841, "value": "So I don't know what this error is but there are a whole bunch of them after I do 'make list_compile_check.exe' and I'm not sure what to do about it . What should I do?. . "}, {"id": 1842, "value": "I have been writing so many test cases but I can't get more than 5/21. What should I be testing for exactly. Because I think the test cases I'm doing aren't checking for bugs, but I'm not sure what types of bugs I should be test for?"}, {"id": 1843, "value": "The spec said all GET requests have 0 content length but are in the public. error checking file, the length of  GET is 2. Does that mean we have to check if the request is GET or DELETE and all of its format is correct, like path, the content length needs to be zero"}, {"id": 1844, "value": "Hello,. . Whenever I try to create test cases where I use the destructor,  I need to make a new list where the variable is a pointer to new List<T>. However, I keep getting a type mismatch error. So I'll be able to make a ptr to a new List,  but then if I try to dereference toe variable and do push back (for example), it'll give me an error. Same thing for when I don't dereference the variable."}, {"id": 1845, "value": ""}, {"id": 1846, "value": "title. I've implemented several functions in class but I don't know what to do in main."}, {"id": 1847, "value": "Are i.node_ptr->prev and i.node_ptr->next valid ways to access the node pointers adjacent to the node pointed to by the iterator? I'm trying to access these so I connect them for my erase functions but it doesn't seem to be working."}, {"id": 1848, "value": "In order to write good test cases for List.h, do we need to test different data types for our functions since List is a templated class?"}, {"id": 1849, "value": ". Hello! I was looking for guidance on my insert function. It works for all of the tests I wrote, but for some reason when I run list_compile_check, I get a segmentation fault on line 36, when I insert 42 into the front of the list.. . and I was wondering what line in my insert function might be causing this to happen."}, {"id": 1850, "value": ". I know that when you use \"new\" you always have to use \"delete\", which is why we're getting memory leak errors. However, I wanted to know WHEN to use delete, especially when it comes to making new nodes like \"insert\". At what point should we delete the insert nodes, and how do we FIND the nodes when its time to delete them?"}, {"id": 1851, "value": "Our autograder submission exited with a value of -11, but at the end of our api.cpp we make sure to return 0 in the last line. Any ideas why this might be happening?. . "}, {"id": 1852, "value": "I am running into an error when trying to initialize the default ctor (empty list) in list.h: . . . . . I am a little lost as to how I am making a mistake. I have done the following to try and resolve this: . . 1) Looked through the online notes for the default ctor example . 2) Used \"List<T> : : List()...\" but received an overqualification error. 3) Reviewed the asynchronous lecture on the Big Three. . Any help will be greatly appreciated!"}, {"id": 1853, "value": "In the implementation of the insert function, do we need to consider the case that we intend to insert a Node at the end of the list, ie. inserting after the node that the last pointer points to? "}, {"id": 1854, "value": "Do we need to save the queue to a file after we modify it, or is the queue more of a temporary thing? Obviously in a real server the file would be stored so other people could access it, but I haven't seen anything saying we need to do that."}, {"id": 1855, "value": "I passed almost other tests in the autograder, but the list private templating test doesn't compile. I implemented all the functions in List.h inside the class. So what problems may cause this error?"}, {"id": 1856, "value": "here is the test caseTEST(test_backOG2) {List<int> backTest;backTest.push_back(55);backTest.push_back(56);ASSERT_TRUE(backTest.back() == 56);cout << \"PASS\" << endl;}the problem is that when I say ASSERT_TRUE(backTest.back() == 56); OR ASSERT_TRUE(backTest.back() == 55); they both pass? isn't the test case supposed to fail if ==55 since the last item would be 56? reasons to what I think is happening:my test case is wrongmy code is wrongim wrong aka both 55 and 56 are valid"}, {"id": 1857, "value": "Figured it out"}, {"id": 1858, "value": "Screen_Shot_2023-03-26_at_4.20.10_PM.png. . Any idea why I am getting these error on List_compile_check.cpp?"}, {"id": 1859, "value": "Our List Private Templating Test doesn't even compile, yet we received all points on autograder and our tests work. We implemented all our functions within the class, using List<T> as a parameter if needed. We didn't put template over each function because it wasn't implemented outside of the class. What would the problem be?"}, {"id": 1860, "value": "Does anyone know what to do about this?. "}, {"id": 1861, "value": "I keep getting an error on student list tests. Does anyone know whats going on? . "}, {"id": 1862, "value": "Hi, how are the JSONs related to the linked lists?"}, {"id": 1863, "value": "Hello, . When I am writing a test case for the assignment operator, I have an edge case where I try to assign the list to itself. But the compiler gives me an error and wasn't sure as to why. I asked a GSI and he told me that we probably don't have to worry about this edge case but I wanted to make sure. Can someone please confirm?. "}, {"id": 1864, "value": "What could this be from? I have the erase and insert functions outside of the iterator class and inside list. I've checked all of my brackets. Could someone check my code to see why there are so many compiler issues?. . "}, {"id": 1865, "value": "Since we are declaring the iterator class as a friend to the list class, are we allowed to access the *node_ptr private member variable in list functions such as erase and insert without breaking the interface?"}, {"id": 1866, "value": "We failed the List Private Templating Test on the Autograder, it says that it does not compile. We are confused on what might be causing this to happen, since we implemented the functions in List.h inside the class definition. We only use List<int> etc in List_tests.cpp. How do we know where this problem is coming from? Thank you! "}, {"id": 1867, "value": "Hi, we're working on test case for end() and here's our test case: . . List<int> my_list;. List<int>::Iterator iter;. my_list.push_front(11);. my_list.push_back(22);. iter = my_list.end();. ASSERT_TRUE(iter == nullptr);. However, we have this error and we wonder why it refers to the constructor in the private, instead of the constructor we made in the public. . . error: calling a private constructor of class 'List<int>::Iterator'. Here's our default constructor in the public and private: . . public:. // default constructor.     Iterator() : node_ptr(nullptr) {}. . private: . // construct an Iterator at a specific position.     Iterator(Node *p) : node_ptr(p) {}. Can you help us with this problem, please? Thanks a lot! "}, {"id": 1868, "value": "If we want to declare an iterator object that has a pointer pointing to the node in a list, the only way we can is to use begin( ) function to point to the first element of the list, right? So if we want the iterator object pointing to the last element of the list, are there any other methods besides using a for loop to let the iterator traverse the list?"}, {"id": 1869, "value": "I'm confused about how to test the iterator overloading operator functions, like ++, --. Can some one give me a hint?"}, {"id": 1870, "value": "Sorry for this post but I really need some help with my other post that is private because there are two issues on it I'm not sure how to resolve. Thank you"}, {"id": 1871, "value": "For the list compile check, I properly pass the compile check, but when I try to run the program for it (./List_compile_check.exe) I get a memory leak. My code properly passes all the public tests and also all 21 bugs for my own list tests. Is the failure to run the compile check indicative of something wrong with my code? Or does the compile check not need to run?"}, {"id": 1872, "value": "I am working on api.cpp and the spec says to read and write requests using cin and cout. I am a bit confused as to how this works since, from my understanding, we are not actually writing to a server. I guess my main question is why aren't we reading from the test files using fstream and also why/how does cin and cout work for this?"}, {"id": 1873, "value": "I got a compile error when I run the List_compile_check. What's wrong with it?. "}, {"id": 1874, "value": "I submitted all the files to Autograder, but on \"Student List tests on student List\", it reports a Fail for a test case. I checked on Terminal of my laptop, all test cases Pass. I tried to print that list out, and the result is the same as my assertion.. Could anything tell me would be the reason for this problem?. I used \"assert()\" for my test cases, not \"ASSERT\" / \"ASSERT_TRUE\", will this be the reason for this fail??? Thank you."}, {"id": 1875, "value": "I've read the answer to @3324 post for this issue, however since I have \"results\" initialized as an empty json::array, my output ends up being \"[]\" rather than null. Is there a different way I am supposed to handle the json array? . . "}, {"id": 1876, "value": "Heyo,. . So I've been stuck on a bug for a while in my pushback() function. . . After multiple print statements and runs through the debugger, I managed pinpoint the problem to one line in which I declared a new node and set that new node's datum to another value. . . The problem is, for some really odd reason whenever I initialize the members of the node to something, or change the datum, my other node is changing too, causing my assert statements to fail while testing.. . . Here are the print statements (ignore the pushback 1/ pushback 2 stuff, that was for debugging I tried before). . As you can see by the print statements, every time this new node's datum is getting reassigned, my first node is getting reassigned too. . . Does anyone have an idea of what could be causing this issue? "}, {"id": 1877, "value": "For this function, do we need to print out all the queue or just the new added tail?"}, {"id": 1878, "value": "hi! . . i have a question about reading in multiple jsons. as of right now, my program is reading in one json and then throwing an error and pointing me to some assembly code. when i put it through the debugger, right before it opens up the assembly code, it reads in one json, calls/executes the right functions, then reads in the methods, endpoints, etc. when it tries to read in the second json, it throws an error and opens up assembly code. . . i'm not sure what's wrong with my code and how else i can debug it, so i thought i'd share my code here to see if anyone has any tips. . . using the debugger, i can tell that the error is being thrown when it says cin >> j5 in the first screenshot. the first screenshot is the function that is called when the method is get and the endpoint is /api/queue/head. the second screenshot is of my main function where i'm actually calling all my functions. . . . . . thank you! . "}, {"id": 1879, "value": "I have  json variable in my Student struct, and I write the function get(pointer), but when I iterator my list. I can not use my get function. idk what's going wrong. do we need to initialize the student struct? do we need to override the function like push.back(). I am confused about how to access each struct in my list if I don't know the position."}, {"id": 1880, "value": ". . In the spec, it seems like there are no new line at the end. However, in the starter file, correct files do have new line at the end.. Are we supposed to follow the starter code or the spec? Would this be the same when the queue is empty? (Have a new line at the end?)"}, {"id": 1881, "value": "Hi,. . I'm working on list.h and the program has a segmentation fault which I've narrowed down to the line of code in push_front where I'm assigning the new node to the \"first\" member variable. Specifically, I'm working on the case where the list is empty. What's strange is that when I comment out that line, it passes, and assigning the new node to \"last\" still works. Any ideas?. . I'm not sure if this would help, but we have the basic default constructor that was basically given in lecture:. . List() : first(nullptr) { }. . . Thanks"}, {"id": 1882, "value": "resolved.nvm"}, {"id": 1883, "value": "here is the test case. . . TEST(test_backOG2) {. List<int> backTest;. backTest.push_back(55);. backTest.push_back(56);. ASSERT_TRUE(backTest.back() == 56);. cout << \"PASS\" << endl;. }. . the problem is that when I say ASSERT_TRUE(backTest.back() == 56); OR ASSERT_TRUE(backTest.back() == 55); they both pass? isn't the test case supposed to fail if ==55 since the last item would be 56? . . reasons to what I think is happening:. my test case is wrong. my code is wrong. im wrong aka both 55 and 56 are valid"}, {"id": 1884, "value": "I have my sanitizer on, and I run my test cases for list.h. Everything goes well and compile in my terminal, no sanitizer problem. However, as I submitted my test cases file to Autograder, it says there is memory problem. (my partner has the same result in the terminal as well). Could anyone help with this issue? It's kinda low efficient for using Autograder submission chances to check memory problems...."}, {"id": 1885, "value": ". . I have received the error above for Tests 2-5 under API Public Tests on Autograder. Currently, I am unsure as to what I need to do, so I was hoping that an instructor could look at my code and offer any feedback. Thank you."}, {"id": 1886, "value": "Hi,. . Can someone explain what we're doing wrong in these functions. Please see our push_front code below:. . . template<typename T>. void List<T>::push_front(const T &datum){.   Node *n=new Node;.   n->datum=datum;.   if(first==nullptr && last==nullptr).     first = last = n;. .   else{.     Node *temp = first;.     first = n;.     first->next = temp;.     temp->prev = n;.   }. . }. Thanks."}, {"id": 1887, "value": "Resolved!"}, {"id": 1888, "value": "TEST(test_copy_all){.     List<std::string> c;.     // michigan, compsci, EECS 280, me, dog, test case.     c.push_back(\"me\");.     c.push_back(\"dog\");.     c.push_front(\"EECS 280\");.     c.push_front(\"compsci\");.     c.push_front(\"Michigan\");.     c.push_back(\"test case\");.     .     List<std::string> d = c;.     .     List<std::string>::Iterator cFirst = c.begin();.     List<std::string>::Iterator dFirst = d.begin();.    .     ASSERT_EQUAL(cFirst, dFirst);. }this is our code to check for our assignment operator in list and begin() in iterator class. As I was debugging, everything looked correct. d had all the items as c but our assert statement fails. What might be going wrong?"}, {"id": 1889, "value": "Do we have to write test cases for Iterator &operator—() since we did not write its implementation?"}, {"id": 1890, "value": "Do I have to define a function like += if I want to do something like iterator = iterator + 2 or iterator = iterator + 3?"}, {"id": 1891, "value": ""}, {"id": 1892, "value": ". I have recognized some patterns in sample responses in the project spect.. Can we assume that . ... HTTP/1.1. Host : localhost. Content-Type : application/json; charset=utf-8. .... is identical for all sample inputs and sample response?. . Can we also assume that  Response code for 200 is \"OK\", 201 is \"Created\", 204 is \"No Content\"?. "}, {"id": 1893, "value": "While running the compile check I am getting a bus error. Any idea how to fix it? I know it's a memory issue, I just need to know how or where to start fixing it. Thanks."}, {"id": 1894, "value": "When implementing \"GET\", \"/api/queue/\" I noticed that I needed to iterate through the list but I'm unsure how to do this. Do we need to make an iterating function?"}, {"id": 1895, "value": "Hello,  I am getting a 1/2 for public error01 in Autograder even though this test is working locally. The error in Autograder has to do with the fact that I am reading in {} (which is on line 6 of publicerror01.in) as a json. However, I am not sure why this incorrect / any other way to read in {} since the Content Length is greater than 0 (the content length is 2) for the public error01 input file so {} has to represent a json.. . In my most recent submission on Autograder, my implementation for the error handling is as follows (lines 217-227 of api.cpp): . . . else {. if(fourth_line != \"Content-Length: 0\"){. json j3;. cin >> j3;. office_hours_queue.error_handling();. }. else{. office_hours_queue.error_handling();. }. }. . . I added print statement and saw that the first if statement was being entered so cin >> j3 was occuring, but I am not sure why it is causing an error.. . My uniqname is rrishi if that helps. Any help would be appreciated. Thank you!"}, {"id": 1896, "value": ""}, {"id": 1897, "value": "When I tried to make the List_compile_check.exe, I got an error like this. So what's wrong with this and how can I fix it?. "}, {"id": 1898, "value": "I can't understand the output error according to the Sanitizer by running the List_public_test. What wrong with my code?. "}, {"id": 1899, "value": "I've tried to debug this for a long time, but still cannot figure out why it says I'm using deallocated memories.. My thought is that in this case (list length >1), victim-> next is the second object in the original list, which should not be null.. . Can anyone suggest wheres the problem with this code?. . "}, {"id": 1900, "value": "According to the spec, we need to create a json that looks like this when the queue is empty. But when I try to add the null in the json, like {\"result\", null}, there is an error. What's wrong with it?. "}, {"id": 1901, "value": "Should we write member functions in OHQueue for each of the request types or can we just write everything in main?"}, {"id": 1902, "value": "Are we supposed to use the Iterator class in API? If so, how do we access it?"}, {"id": 1903, "value": "I keep getting a segmentation fault at the end of my test cases but when I debug it in the last test case (which is also where the segmentation fault comes up) and when it gets to the line where the segmentation fault occurs in my actual code (first = first->next), it doesn't say that first is a nullpointer or first->next is a nullpointer.. "}, {"id": 1904, "value": "resolved"}, {"id": 1905, "value": "Quick conceptual question, if we are overloading the assingment operator do we need to make a copy CSTOR? "}, {"id": 1906, "value": "do I need to make test cases for front and push front, or would making just front and pop front functions be okay since they are already using the front function?"}, {"id": 1907, "value": "I tried making a test case for push_front, but it keeps giving me a segmentation fault when I add numbers to an empty list using push_front and print out the front number. What could be causing the segmentation fault here? My test case isn't working. Thank you.. . "}, {"id": 1908, "value": "I am confused about one of the lines in the compile check where it says that b = my_list.end() != iter3; is supposed to be true. However iter3 is pointing to a null pointer and from how I interpreted the end() function, end should also return an iterator pointing to a null pointer. Is my thinking on end() wrong or is there a different problem with my code?"}, {"id": 1909, "value": "Why does my compiler say my iterator == function has the same name of the class.. Also it says node_ptr isnt a data member even after it has been specifically declared as a private variable for the iterator class. "}, {"id": 1910, "value": "My list compile check passes on my Xcode but when I submit to the autograder I get these errors and I am unsure what they mean and would love any assistance possible "}, {"id": 1911, "value": "Resolved."}, {"id": 1912, "value": "I could someone help me understand why the line.             last->next = newNode;. in the code:. . newNode->prev = last;            last->next = newNode;            last = newNode;. . is giving me a bad access error? . . . This is in the else statement for reference within the pushback part of the slides. . . This the push_back function which we wrote is basically the same as the one in the slides from lecture, but I don't understand why there is an error with this line when it is the exact same function as the one in the slides.. . . Maybe related - I am also wondering, in my default constructor, if I initialize last to be a nullptr because I did that and it created that problem. . . Any help would be appreciated thank you!"}, {"id": 1913, "value": "When trying to test my code I keep getting the following error: . . c++ --std=c++11 -Wall -Werror -pedantic -g -Wno-sign-compare -Wno-comment api.cpp -o api.exelibc++abi: terminating with uncaught exception of type nlohmann::detail::parse_error: [json.exception.parse_error.101] parse error at line 3, column 1: syntax error while parsing value - unexpected end of input; expected '[', '{', or a literal. . After looking at some other posts it seems I may be reading in the json files incorrectly or maybe not reading in the full header?. My code to read in the entire header is:. . . while (cin >> method >> endpoint){. while (junk != \"Content-Length:\"){. cin >> junk;. }. cin >> CL;. //rest of code follows. . . I am trying to read in until content length then read in the content length which should be the whole header. Is this the correct way of doing it or should I look at other parts of my code to find where I went wrong?. My unique name is HARTWIG if needed! Thank you in advance for any help:)"}, {"id": 1914, "value": "Whenever I try to run any tests involving the copy constructor or the assignment operator it returns an exit status 9 and doesn’t run the test any idea on why? Every other test runs perfectly "}, {"id": 1915, "value": "do we make test cases for Iterators the same way we do for functions ?. "}, {"id": 1916, "value": "I am getting a bad access error in my pop_front function for the first->prev=nullptr line of code however I already checked that first was not a nullptr so why would I be getting this error? "}, {"id": 1917, "value": "On the file public_error01.out.correct, the correct output has two empty lines at the end, however on the specs it has only one for the bad request error, i am confused, which is the correct output? why would the public_error01.out.correct have an extra line after the error message. . here is the error message on the specs. . and here is the public_error01.out.correct . "}, {"id": 1918, "value": "I'm trying to code push_front(). In my function, I have an if statement for when the list is empty. When the list is empty, I'm trying to assign the value of the new node I've created to first and last. The code runs when I only try to assign the value of the new node to one of the two (either first or last), but when I try to assign it to both, I get a debug assertion error: _CrtIsValidHeapPointer(block). . I've tried to search online for what this error means, and it seems that means that something is not a valid heap pointer, but I can't figure out what isn't valid. How do I go about assigning my new node to first and last or where can I find guidance on how to do so?. . "}, {"id": 1919, "value": ". Hi, I keep getting this error and I'm not sure what it means or how to fix it. I tried debugging my code but I'm still confused. Can someone lead me in the right direction?"}, {"id": 1920, "value": "Hi, I got memory leak on the autograder. Can someone help me to see what cases this memory leak and how can I fix it? Thanks! . "}, {"id": 1921, "value": "In the Autograder, we have earned full points, but error01 is highlighted in light blue. It says that the test \"Timed out\". We have written tests for any possible errors our API could encounter -- incorrect paths & mismatched paths -- as outlined in \"Error Handling\". We also accounted for the possibility that cin fails to read in the beginning of a request.. . I am guessing the \"Timed out\" is due to some infinite loop in our error processing, but based on the errors we were asked to check for and our error checking code, I can't see any possibility of an infinite loop.. . The only thing I can think of is if the rest of the response is not formatted correctly and thus we cannot junk the rest of the response since cin may be waiting for something that never comes."}, {"id": 1922, "value": "are there specific functions I should test for in list?"}, {"id": 1923, "value": "I spent the last few hours trying to debug my code and found out that.       json j3;.       cin >> j3; . wasn't working properly. After creating j3, it proceeded to cin, where it then exit out the code, I played around with it and tried to put it in different locations but it still wouldn't work, I'm not sure what went wrong. This is what the output is from the terminal.. .  p.p1 {margin: 0.0px 0.0px 0.0px 0.0px; font: 11.0px Menlo; color: #000000} span.s1 {font-variant-ligatures: no-common-ligatures}. libc++abi: terminating with uncaught exception of type nlohmann::detail::parse\\_error: \\[json.exception.parse\\_error.101\\] parse error at line 1, column 2: syntax error while parsing value - invalid literal; last read: ' H'"}, {"id": 1924, "value": "I'm running into a problem implementing the error checking in api.cpp. From the spec, we're supposed to read the rest of the request when we get an error, including anything in the body (aka json objects, from my understanding).. . I don't know how to construct a conditional to check for a json object. I tried. . json j;. while(cin >> j);. to read in \"junk jsons\" if they're present and do nothing if not in my error handling function, but this fails public_error.01 because it doesn't contain a proper json object.. . As a result, I'm not sure how to read in the body when handling an error according to the spec. Has anyone figured it out? . "}, {"id": 1925, "value": "Hello, I am a bit confused on the situation with the test cases? Should I add or fix the original files that are in my IDE with updated ones? Or was this a change that happened within the autograder/ do I need to change my api code?"}, {"id": 1926, "value": "I am a bit confused on the implementation of pop_front() and pop_back(). In specific, I do not know how to handle these functions when there is only one node in the list. Do I set first and last to nullptr? what do I do to datum? what does deleting the item actually mean? are we just making it null?"}, {"id": 1927, "value": "Hi, my list.h file worked yesterday on the autograder and it also works perfectly now with my list_tests.cpp, but when I run the compile_check.cpp on it, some weird things happen. If I flat-out run it, it breaks on the ++--itr; line because node_ptr apparently does not have a prev node so when -- sets the ptr to nullptr, the next step, ++, fails the assert statement. However, when I run the code with a breakpoint and step through the lines, without changing any code, it works perfectly with the correct output and everything. Not really sure what is happening here, getting some real Shrodingers Cat vibes lol."}, {"id": 1928, "value": "For this part in the project specs, how do you get the literal words/format of count and results part to actually print out? (question is not how to implement the count or produce the results, but the actual words themselves.). . Is this something you have to hardcode or is there another approach?. . Screen_Shot_2023-03-25_at_3.10.38_PM.png"}, {"id": 1929, "value": "If I use some of the List_compile.cpp file's internal linked list and iterators to change some numbers and implement to be my List_test.cpp, would I violate the honor code?"}, {"id": 1930, "value": "I realizes the size function in list.h is const, however, I have found that I have needed size in other functions that are not const. How should I go about getting the size. In specific, is there a better way to implement push_back() with out using the size fuction?"}, {"id": 1931, "value": "I have a json array with json objects of the students on the queue and I want to access the first student for GET /api/queue/head so I can return them. Does anyone know how to do that? Like the equivalent of saying arr[1] on a normal array. Would it just be like queue[\"results\"][0]?"}, {"id": 1932, "value": "I have tried two approaches so far to permit by List functions that require it to access Iterator's private member variables. The first is adding a line that says \"friend Class List;\" under the comment in the private section of Iterator that says \"//add any friend declarations here\". I get compiler error:. . Undefined symbols for architecture x86_64:  \"List<int>::Iterator::Iterator(List<int>::Node*)\", referenced from:      List<int>::begin() in List_compile_check-3164df.o      List<int>::end() in List_compile_check-3164df.old: symbol(s) not found for architecture x86_64. from List_compile_check.cpp.. . So I tried adding the individual list member functions as friends: \"friend Iterator begin();\" and I got errors which were variations of this for each time I try to access a private iterator member from my list functions.. . ./List.h:286:7: error: 'node_ptr' is a private member of 'List<int>::Iterator' i.node_ptr= tempCurrent;. . I looked back at card from euchre and I can't find any differences in the way I was using my friend declarations other than that Iterator is a member class of List and the functions I'm writing are members of List. I googled all of this but haven't found anything specific that has helped. Any guidance would be much appreciated!!. "}, {"id": 1933, "value": "when we use the erase function, I assume we should delete the node that the iterator is pointing to in order to avoid memory leaks (correct me if I am wrong). In that case, would it be an incorrect step to do ++i to an iterator that erased its node?"}, {"id": 1934, "value": "In my test file, I am trying to create a test where I use the assert operator to compare between a string and an iterator of type string pointed at the same string value in list. This is failing when I run it. how should I be comparing a string to an iterator?"}, {"id": 1935, "value": "I noticed that some other students have had exit status 2 error. I tried to identify what went wrong in my code by running all tests on CAEN but everything was working just fine. However, autograder disagrees. What type of mistakes would cause exit status errors?"}, {"id": 1936, "value": "When I output the api.cpp tests on my machine I'm getting whitespace that separates the different responses from each other in my IDE, but not in the autograder. Is this going to cause me problems with the private tests? For reference, my uniqname is byagh."}, {"id": 1937, "value": "I am having issues with my push_front where I get a seg fault every time I try to use it any test case. I have checked my constructor to initialize first and last to nullptr. My code follows pretty similar to how we did it in class with the addition of previous. I also looked through it with the debugger and it works as it should, but I still get a seg fault when running it. I even tried a basic code of. Node *p=new Node;. first=p; . to see if it would at least stop giving me a seg fault but it did not. . "}, {"id": 1938, "value": "I have attached a picture of my code and made this a private question I was wondering if I could have some assistance on why I may be getting this error"}, {"id": 1939, "value": "It might seem like a weird question...but, is there a specific requirement for the place that we can or can not use this member variable to update the size of the list(instead of traversing through the list)? Or we can just use them whenever we feel that we are adding or deleting an element from the list in push or pop functions?. . I just wonder if the private test would specifically test if the function such as push_front() has increased the size of the list or not. Since the RME does not say specifically about changing any private variable that we have created. "}, {"id": 1940, "value": "PublicError01 is given to us to test when the server receives a bad request, but what inputs on the real web browser could actually produce a bad request.? How can we further test if our bad request response code is working properly?"}, {"id": 1941, "value": ". Hello! Visual studio is showing me that it cannot find the definition of copy_all function although I have written it below. What might be the problem?. . . I have changed the visibility of the code. This is how I defined it, but the visual studio still can't find the definition. "}, {"id": 1942, "value": "Im a little confused about what a trailing new line is. I've submittied two versions of outputting the JSON string at the end of the api's response, for example:. . 1). cout << str_head;. . 2). cout << str_head << endl;. . Both versions are giving correct output in the autograder but the second one fails when I run the api test through the command line. Not sure sure which one implements the trailing new line correctly? Also not sure about how many newlines there should be at the end of responses when there's no response body."}, {"id": 1943, "value": "I am having the following memory leak stemming from these segments of code and am not sure where exactly I am going wrong.. . Resolved. . "}, {"id": 1944, "value": "In the specs, when the GET route is inputted with /api/queue/ as the path, if the queue is empty, we are supposed to return null for the results part of output. How do we set the json object[\"results] to the null? Do we set it to a nullptr or to a string \"null\"?"}, {"id": 1945, "value": "Whenever the delete method is inputted, should it always return the example given in the specs as the output (given below) or should it be different based on the number of people in the queue?. . HTTP/1.1 204 No Content. Content-Type: application/json; charset=utf-8. Content-Length: 0"}, {"id": 1946, "value": "Are we supposed to use the iterator in the push and pop functions or just the two functions at the end that take an iterator as a parameter?"}, {"id": 1947, "value": "Here's my code and my test case for insert(), but I am confused why there's a segmentation fault for iter->prev? . "}, {"id": 1948, "value": "When we know a given request is invalid, and we can read in the content length, how are we supposed to utilize the content length to know when to start reading in the next valid request?  In other words, the content of a bad request could be a combination of any number of separate strings, so how could we possibly know when the next valid request begins?"}, {"id": 1949, "value": "If we got 21/21 on the tests, should we be confident we will pass the privates? How can we know for sure?"}, {"id": 1950, "value": "resolved"}, {"id": 1951, "value": "What is the private templating test? We were given the templating framework so I'm not sure what it could be looking for.  We have implemented all functions inside the list.h file and everything is defined within the class definitions, but failing this one test. Are we meant to add something else?"}, {"id": 1952, "value": "So if we look at the like in a list... which is one is it.. . . "}, {"id": 1953, "value": "My partner and I are working on the test cases for list.h and we keep getting a segmentation fault whenever we try using push_back() or back(). However, we have no clue as to why our back functions are not working, while our front functions were working fine. Can someone lead us in the right direction?. . "}, {"id": 1954, "value": "Hi, so I've implemented begin() and end() like how we've learned in lecture. However, it seems I'm still receiving an error from the compile check. I was wondering if I'm implementing these two functions incorrectly, or if there is more that is needed. If I need more, can someone lead me in the right direction?. . "}, {"id": 1955, "value": "I was told by someone that since end() returns an Iterator pointing \"past the end,\" it just returns a null pointer. Is this true? If it is, how do I use it to return a pointer to the last element of the List?"}, {"id": 1956, "value": "Hi, . I am trying to push_back each student in the queue to a single Student array to ultimately print them out in the end for GET api/queue. I am a little confused on the syntax for accessing individual students from oh.queue. I have the for loop set as. . for (auto it = oh.queue.begin(); it != oh.queue.end(); ++it) { and in the for loop I have a json t set to . . t = {{\"location\", it.location}, {\"position\", i}, {\"uniqname\", it.name}};. but it.location and it.name is wrong. I know that there should be something more to it but I am not sure what. . . Thank you!. . "}, {"id": 1957, "value": "Screen_Shot_2023-03-24_at_6.28.00_PM.png. I'm getting this error when I run my code, does anyone know how to fix it?"}, {"id": 1958, "value": "I'm confused why I am getting these memory leaks when calling trying to test the copy constructor. Shouldn't my destructor be deleting the nodes in the heap?. "}, {"id": 1959, "value": "I am trying to write my push front function and from watching one of the reviews they recommended doing firs->prev= temp as that would connect first to the Newly added node however I am getting a bad access code and would like some assistance"}, {"id": 1960, "value": "I'm aware that for insert we have to consider whether our iterator is pointing to the first node, last node, or anything in the middle, however I'm confused on the syntax for checking this.. Is it something like if(i.node_ptr == first/last).... Or do you derefecne I to check its next and previous like i -> prev?. In VS Code trying to dereference I only gives me access to the operators."}, {"id": 1961, "value": ". How would i fix this error? The output file and the correct output file is the same."}, {"id": 1962, "value": "I noticed that in public_error01 the request has a length of 2 . . However, on spec, it says that \". All GET and DELETE requests will have a Content-Length: 0If Content-Length: 0, there will be no JSON body. \". . I'm a bit confused why is the test case structured with a content length not equal to 0;. "}, {"id": 1963, "value": "For some reason, my position isn't updating, it keeps the position at 1 the entire time. Is there something wrong using the queue.size?. "}, {"id": 1964, "value": "do we have to account for inserting a node with insert() after the last element in the list? The RME says it puts it before an iterator, and the last iterator should be end(), so do we base it off of that?"}, {"id": 1965, "value": "I don't know if it is a glitch but I have been pinned to the OH Queue but it looks like I am not on the queue as the sign up button is still there. It is also says that \"this student is currently being attended to\" but I am not. Should I ignore it?"}, {"id": 1966, "value": "What should we be comparing in `Iterator::operator==`? I assume we are comparing `node_ptr` addresses, but in the case of end iterators from two separate lists, they will still equal each other, which I thought was a bit unusual. Is this fine?. . ```c++. List::Iterator a = listA.end();. List::Iterator b = listB.end();. . a == b // true. ```"}, {"id": 1967, "value": "So this is what I have right now and it is getting an error. I saw a piazza post like this and I tried using the json::array but it comes up with this error. . So this is what I have in my function and I know that obviously the push_back isn't working but I'm not sure what else to do.. "}, {"id": 1968, "value": "When we try to run our tests for list, we receive this error. We looked at another piazza post with the same error, but that was for an iterator operator, and we are not dereferencing any iterators in the clear function (which is where the error is happening)uniqname for the autograder submission is priyasha. . "}, {"id": 1969, "value": "After trying to compile List.h I keep getting this error:. /Library/Developer/CommandLineTools/SDKs/MacOSX12.1.sdk/usr/include/c++/v1/string:4045:1: note: candidate template ignored: could not match 'basic_string<char, std::__1::char_traits<char>, type-parameter-0-0>' against 'List<int> *'operator==(const basic_string<char, char_traits<char>, _Allocator>& __lhs,. . What does this error mean?"}, {"id": 1970, "value": "I was wondering the total number of bugs to catch for each the Iterator part and the LinkedList part. "}, {"id": 1971, "value": "Hi, the commented lines either cause errors or false positives. I'm not really sure why. . . "}, {"id": 1972, "value": "In my push_back function, it says it has error that \"Member access within null pointer of type 'List<char>::Node'\". What is the problem here? I can't see anything wrong with the code.. . Thanks. . "}, {"id": 1973, "value": "Does linkedlist allow for backwards iteration?"}, {"id": 1974, "value": "the program crashes at this test case. I've used debugger but still can't figure out what's wrong.. . My list here is. 'd''c''b''a' . . I first let i3 point to d, then increment i3 (++i3), so it points to c.. The line is fine at line 126. However, I notice after line 126, the \"prev\" pointer is NULL (which should be the address of 'd'). So when I decrement i3 (--i3) and the program crashes at line 128 and 129, because it says I'm trying to dereference a nullptr.. . According to this, do you think the problem is from my test case or my .h file? How should I change it? Thanks.. . "}, {"id": 1975, "value": "My project has a 63/63 on the autograder, but the real web server isn't working. Im getting this error: BrokenPipeError: [Errno 32] Broken pipe."}, {"id": 1976, "value": "Once we finish list, should we change our api to use our list and not std list?"}, {"id": 1977, "value": "Pretty much the same as the title. I just wonder if the result is automatically adjusted for our previous submission, or we need to submit a new one. Thanks a lot!"}, {"id": 1978, "value": ". Here is the code containing my parsing logic. . "}, {"id": 1979, "value": "Hi I have this test case where I set and iterator to the end of the list, insert a number at the end, and then dereference the iterator. Does this not work? I get the error at the line ASSERT_EQUAL(*it, 25);. . "}, {"id": 1980, "value": "In these two .in files there are new lines after the json object, I am running into the issue where I re-enter my while loop and print out more output in the case of the error test and I get a parse error in test 4. If I add another cin >> variable. It works for these two cases but creates errors for the rest. Any guidance on how I can go about fixing this?. . Update: I was able to fix the bug I had with the error test but not test04"}, {"id": 1981, "value": "How can I test the driver beyond the public tests? Thanks."}, {"id": 1982, "value": "Hello,. . So I am stuck with the api.cpp function and specifically on the get /api/queue part. I'm not sure how to add the requests with the specified location, position, uniqname. . . My current approach is to make a for loop that loops from the beginning of the Student list queue and go until it reaches the end by the use of iterators (to account for multiple requests). I'm utilizing the json variable that gets the iterator to point to the current position of the Student list queue and return that list position's element by utilizing the push_back method.. . Am I correct in the approach to going about this function? Any advice would be appreciated. I put a screenshot of what have at the moment. I've privated the post as well. . . Screen_Shot_2023-03-24_at_1.01.25_AM.png"}, {"id": 1983, "value": "I have a bug in test02 for the api.cpp. The bug is specifically in the last request POST /api/queue/tail/ HTTP/1.1. When it prints out the queue, it only prints out the first two students in the results(awdeorio and akamil) but can't print out the last one. I think it's weird since all these three can print out correctly for the request POST /api/queue/tail/ HTTP/1.1. Count is also correct. I don't know why only the first two students are added to the queue since all three are implemented with same code. Why the last one could not work?"}, {"id": 1984, "value": "I'm confused whether we could (or should) use the functions in List.h in our api.cpp?. . As we have a list of Student, not Nodes, not Linked List, so I'm not sure how to use the functions in List.h. . . For example, if we say queue.front(), will this just gives the first student in the queue?. . Or instead, are we asked to build the \"struct Student\" in the same way we built \"struct Node\", doing the next, prev thing once again?. . Thanks."}, {"id": 1985, "value": ". . Is the Iterator(Node *p) a non default constructor? If it is, why is it under private? If it's not, how would a non default constructor look? I thought it would look like this."}, {"id": 1986, "value": "Can someone tell me what's wrong with it? I try to parse json but there is an unexpected terminal output saying the parsing error. Since the error, there is nothing output for this test. I noticed that there were several students asked this question on the piazza before, but there's still not a precise answer.. "}, {"id": 1987, "value": "I know instructors can't specifically tell you which test cases you're missing, but would it be possible for someone to look through my test cases and give me a hint to steer me in the right direction? (uniqname: chekaren) I've tried to test as many edge cases as I can find but I'm still missing a few. "}, {"id": 1988, "value": "Hi, the way the spec worded this phrase is a bit confusing. I wanted to make sure that we can implement the functions in public Link class, since it says in the starter code that we should. . "}, {"id": 1989, "value": "Hi can anyone explain this error to me?. "}, {"id": 1990, "value": "What is the list private templating test? The autograder does not give us feedback but we don't pass the test. What can we do in order to fix this? How can we figure out where the root of the issue is or what is required to pass this? Thanks!"}, {"id": 1991, "value": "Am I right in thinking that whenever an instance of an OHQueue object is created, the list constructor automatically runs? Therefore the OHQueue default constructor would not need to do anything."}, {"id": 1992, "value": "Hi, I wrote ~70 lines of main function in api.cpp, any advice on how to cut them down?"}, {"id": 1993, "value": "I am having trouble setting up input redirection on my Mac. With everything that I have tried, my debugger stops running the moment I cin something. Here is what I have tried:. . 1.  using the 'stdio' argument as mentioned in the input redirection (for Mac) part of the spec.. \"stdio\": [\"test01.in\", null, null],. 2. Putting the file in \"args\". . \"args\": [\"<\",\"test01.in\"],. I also tried. . . \"args\": [\"<\",\"${workspaceFolder}/test04.in\"],. . . I also went to office hours and it still could not be resolved. I have attached a screenshot of my launch.json file.. Screen_Shot_2023-03-23_at_9.55.14_PM.png. . "}, {"id": 1994, "value": "None of my C standard library files can be opened. I also seemed to have lost my include path... how can I resolve this? I might have deleted something on my macbook. "}, {"id": 1995, "value": "Would just \"POST\" be a bad request, or should we return 0 (as mentioned in the \"Design\" part of the spec). I am still confused as to when to return 0 and when the request falls into that of \"Error Handling.\" If the request contains POST, GET, or DELETE as its first word, is that enough to consider it a request (even if it is a bad request)? "}, {"id": 1996, "value": "I am getting this error when I try to cin the json object in test04.in. I am using getline() to cin the first five lines. The first line I cin is put into the 'request' variable. Then I cin the next four lines and put them into 'trash'. When I cout 'trash' it prints out the three lines and an empty line (as shown in the screenshot). Then, I try to cin the json object, which is prompting this error.. Screen_Shot_2023-03-22_at_12.26.38_PM.png. Screen_Shot_2023-03-22_at_12.26.54_PM.png"}, {"id": 1997, "value": "After we erase a node, what happens to the iterator. Does it get deleted too?Thanks."}, {"id": 1998, "value": "Would we consider the case when an iterator it points at one past the end, and when we do --it, would we want it to point the last node in the list? "}, {"id": 1999, "value": "Hi, the autograder is saying \"no test cases submitted\" even though I have a few; I looked at the other piazza posts about this issue and they said I should have a function in my List.h that is not in the instructor solution; I checked my List.h and I believe that every function in it is needed. I'm not really sure what extra function I added. . . Any assistance is greatly appreciated!! Thank you! . My uniqname is divyabp. . Also, attached are my List.h and List_tests.cpp files. . List.h. List_tests.cpp"}, {"id": 2000, "value": "For example, in these scenarios:. . const T &datum. . . T & back(). . . I just want to clarify what the T means again? I believe it's for a template, but I'm a bit confused on how to match he return type. Or, for example, how we use datum in push_front (like is it a node at all?). . . . "}, {"id": 2001, "value": "I've read the spec, but Im still a bit confused about what should i put in this class. . Could you give me some hints?"}, {"id": 2002, "value": "For the *Operator overload for the iterator, should the return type be an int? Couldn't the linkedlist possibly take in a different data type? "}, {"id": 2003, "value": "Hi,. . I am getting a weird memory leak in push_back when I call it from one of my erase test functions. I am not getting this error in my terminal even with address sanitizer set up but I get the error on autograder. I don't get this error when I call my push_back function anywhere else - just in this part of my test cases.. How do I fix this?. . "}, {"id": 2004, "value": "In my List::insert() function, I use the iterator to iterate through the list. However, when I try to compile, it says i-- is not possible. I have however, implemented the -- overload. How do I proceed??. . . . "}, {"id": 2005, "value": "I was trying to declare a JSON object but it wouldn't let me saying that the type json is undefined. I included the json.hpp file.  I listed an example similar to what I did. Is there something I am missing because I am looking through but I don't know what's going wrong. . . . #include \"json.hpp\". ... \\\\Other stuff. . int main(){. \tjson x;. }"}, {"id": 2006, "value": "Where are we suppose to implement the function then if we don't modify the public member functions of List? . . Or does it mean to just not change anything else about it, but we can implement it there?"}, {"id": 2007, "value": "My code breaks on the line which initializes an iterator. I assume this is because the compile check creates a list, inserts 2 values, edits them, and removes them, and then attempts to create an iterator on the \"first value\" of an empty list which is actually null, causing an error. Am I missing something? . .     int size = 0;.     my_list.empty();.     my_list.size();.     cout << (my_list.size() == size) << endl;. .     my_list.push_front(42);.     my_list.push_back(42);. .     my_list.front() = 73;.     my_list.back() = 73;. .     my_list.pop_front();.     my_list.pop_back();. .     List list2(my_list);.     list2 = my_list;. .     List::Iterator iter = my_list.begin();.     my_list.insert(iter, 42);. ```"}, {"id": 2008, "value": "Hi, I am confused about this, shall we add template<typename T> and return type List<T>:: in front of every function in List.h? Since I got errors that said extra qualification on member functions from the compiler after adding them. Thanks! . "}, {"id": 2009, "value": ". . The test seems to run fine, it passes the assert statements, but AFTER that it seg faults. Note that my List destructor does indeed work correctly. I have no idea how to approach this.."}, {"id": 2010, "value": "Hi my name is Regenald Fletcher and I am looking for a partner for project 4"}, {"id": 2011, "value": "im getting this error but i am not sure why.... it is giving me points "}, {"id": 2012, "value": "I'm a little confused about the hint. What does \"keep track of the size with a private member variable\" mean? Do we need to create a new private member variable? "}, {"id": 2013, "value": "According to the spec, I tried to add the null in a JSON object. But I got an error. So what's wrong with it?. "}, {"id": 2014, "value": "I'm having an issue with reading in the requests for api.cpp -- the requests are entering the right paths and performing the correct function, but outputting content twice.. . I have a while loop like this:. . while(cin) {}. which thereafter uses cin within to read the four lines of input into their respective variables to be used in helper functions:. . cin >> variable >> variable >> etc;. . I'm assuming this is due to the way I am reading in input -- I replaced my function call with a simple cout statement and it still repeats the output twice even with a simple phrase. Any tips would help (I'm already aware of the newline that needs to be added)! . . "}, {"id": 2015, "value": "is there a lecture In specific that can help me with write api, I am a bit confused and need a refresher on the material the driver calls for"}, {"id": 2016, "value": "Does Bad Request always output this in all cases?. . HTTP/1.1 400 Bad RequestContent-Type: application/json; charset=utf-8Content-Length: 0. . If yes, can we just hard code the output?. . "}, {"id": 2017, "value": "When I tried to run the api.cpp by inputting the test03.in, I got a complex error. But I'm really confused about what's wrong with my code since I couldn't understand what the terminal said.. . . After running this, I tried to input test04.in, but I then got another error I hadn't seen before. So how can I fix the problem?. "}, {"id": 2018, "value": ". . When I run make List_tests.exe, I keep getting this error. I am on VScode on Mac OS. I have implemented all methods in List.h. Not sure how to proceed.... . Solved: I had written List(); instead of List() {}"}, {"id": 2019, "value": "api.cpp works perfectly with #include <list>, but when I switch to our \"List.h\" file these errors pop up at the top of the file. I'm sure this is something obvious on my part but not really sure how to go about fixing it. These are the first lines in the file so I'm not sure why it wants a '}'. Also, the json include worked before so I'm not sure how changing to List.h affected it. "}, {"id": 2020, "value": "I just wonder what is the maximum number of bugs we can find in writing our mutation test. Any clarification is appreciated, thanks a lot!"}, {"id": 2021, "value": "How do I debug this? What does it mean?"}, {"id": 2022, "value": "The following is happening on all of my tests, a number is being printed before the content length. I am unsure why this is occurring. I am printing this line using the following:. . cout << \"Content-Length: \" << content_length. . I have tried stepping through with the debugger but there is no indication of where they are coming from. My uniqname is kstump if looking at the autograder might help.. "}, {"id": 2023, "value": "My GET /api/ pathway returns nothing, and I cannot figure out why.. Is it because I have not finished the rest of api.cpp, or is it something within my json creation or cout statements?. My unique name is laurea"}, {"id": 2024, "value": "When I try to attempt setting a list equal to itself invoking the =operator, I get an error. I am wondering why the first if statement I have isn't working in stopping the error. I've attached the error message and the =operator method down below. Thanks!. . . . "}, {"id": 2025, "value": "In List.h we are trying to test our copy constructor but we're getting a segmentation fault and we don't know why. We created a list2 and pushed in values, and declared List<int> list3(list2); to test the constructor, but then get an error on that line. Would this be an error in our constructor code or an error with how we called it?. . Code for copy constructor:. . Code for copy_all:. "}, {"id": 2026, "value": "the topic is my question "}, {"id": 2027, "value": "Hi, would someone please take a look at my autograder to see where I am going wrong in my test case? It runs and reports no memory leaks, but gives me 0/21 for the test cases. It worked before I added in some new test cases because I havent reached max score yet, but not since I added in a new x1 test case.  Should I try this on the CAEN environment? "}, {"id": 2028, "value": "What is the notation to overload the post-increment and -> operators. In project 4, we use operator++ for pre-increment, do we use the same \"function name\" for post-increment? If so, how does the compiler differentiate them?. Also, generally, do we implement -> by calling the * operator?"}, {"id": 2029, "value": "Will we be using the functions we implement in List.h in api.cpp? After waiting quite a while in office hours I was told the Lists in api.cpp would be using their own built-in functions."}, {"id": 2030, "value": "I am a bit confused on how to implement these two functions within the iterator. Are we erasing and inserting where i is pointing at? And if we are, how do we go about deleting/inserting the values in? pop_back and push_back only remove the first and last elements, so how do we erase the part where iterator is pointing at?"}, {"id": 2031, "value": "I am getting the following memory leak when trying to test the copy constructor and was wondering how to interpret it.. . "}, {"id": 2032, "value": ". while I do have the debugger installed I couldn't select the correct configuration gdb for my windows. "}, {"id": 2033, "value": "solved"}, {"id": 2034, "value": ""}, {"id": 2035, "value": "In my Pop_Front function, I was wondering whether it would be necessary to have: . . . if (size() > 1) {. first ->prev = nullptr;. }. . Without this, my code ran without error in my test cases. However, I was thinking that without this, it would cause the new front to point to an element that has already been deleted if there was more than one node prior to the call. I would greatly appreciate if my line of thinking is correct or incorrect. I've attached my pop_front function down below. Thanks! . . . . . . . "}, {"id": 2036, "value": "In out first submission we didn't have any issues with Student List tests on student List. . . I made another submission and we got this on the autograder. . . The only difference is that more tests were added. Is there anything that I may have done that could've caused something to wrong?. "}, {"id": 2037, "value": "Shouldn't it be only one blank line at the end of \"public_error01.out.correct\"?. . "}, {"id": 2038, "value": "I keep receiving this error and I can't quite figure out what it means."}, {"id": 2039, "value": "Solved"}, {"id": 2040, "value": "I am confused as to whether we need to handle Insert() into empty lists. As per @2976, we do not. But in List_compile_check.cpp, an element is inserted into an empty list and my code seg faults if I do not account for this case. Which one is it, or am I missing something? Thank you!"}, {"id": 2041, "value": "Is OHQueue queue() the right way to create a new queue? That's what I did at the start of my program but whenever I try to call one of the member functions of OHQueue using queue.function I get an error that it's supposed to have a class type but doesn't."}, {"id": 2042, "value": "I was trying to write for the case where iterator i = list.end() in  insert(). I set the condition to be if (i.node_ptr -> prev == last). and it says. . Exception has occurred.. EXC_BAD_ACCESS (code=1, address=0x8). Any ideas how to fix that?. . also, we don't need to consider the same case for erase(), right? since it requires i to be derefferenceable. Thanks!"}, {"id": 2043, "value": ". . . Why when using range for the auto i = j; would make i an int? DeOrio didn't seems to answer this question in the recording."}, {"id": 2044, "value": "Would testing push front and back with a nullptr be valid. For example:. . int* n = nullptr;. . . my_list.push_front(*n);. The reason I ask is becase I get a seg fault. Most likley because I did not implement for this case.. . . . "}, {"id": 2045, "value": "Resolved. "}, {"id": 2046, "value": "If we have 2 iterators i1 and i2, and 1 list L1. We initialized L1 using default ctor and thus it is an empty list, then if we do i1 = L1.begin(); and i2 = L1.end();. Both i1 and i2 have node_ptr that points to nullptr because the list is empty right?. . My question:. In my code if we call L1.insert(i2,3); and then L1.insert(i1,4); the first element in the list will be 3 and the 2nd element will be 4 because my insert works by first comparing the pointer in the iterator to \"first\", which in this case is nullptr. So, 3 will be added as the 1st and only element. Then, as the pointer in i1 is nullptr and the first pointer already changed (because now 3 is in the list), i1 will now be treated as \"past the end\" pointer, not first pointer even though I declare it with begin();. Is this an issue that needs to be solved because if this list is not empty, calling (L1.insert(i2,3); and then L1.insert(i1,4);) will add 3 as the last element and 4 as the 1st element."}, {"id": 2047, "value": "When I make an obvious mistake in my List.h file, there are no compiler errors (red lines) given by Xcode even though it is listed as a compile source in the. How do I fix this?"}, {"id": 2048, "value": "When I am writing the list functions out in list.h, I've noticed that the red squiggly line doesn't show up for some aspects of the code. I've already enabled the changes needed in c_cpp_properties.json and settings.json, so any other help would be greatly appreciated!"}, {"id": 2049, "value": "How can I use a for loop to put each json objects inside json json_obj[\"results\"] = []?. . \"results\": [        {            \"location\": \"Table 3\",            \"position\": 1,            \"uniqname\": \"awdeorio\"        },        {            \"location\": \"Table 15\",            \"position\": 2,            \"uniqname\": \"akamil\"        },        {            \"location\": \"Desks behind bookshelves\",            \"position\": 3,            \"uniqname\": \"jklooste\"        }    ]. . "}, {"id": 2050, "value": "hi, so I'm trying to setup by vs code debugger for api.exe. I know one issue why it isn't working is because in the bottom left corner it doesn't say wsl:ubuntu. When I press that button, I get the following options. Usually, it would say \"reopen folder in WSL\", but now it doesn't. How do I fix it? I tried pressing connect to wsl but it just opens a new window and the same issue is there. "}, {"id": 2051, "value": "I have started the project last week as soon as the spec came out, but due to 3 midterms coming up this week and next week along with projects in those courses I was quite not able to proceed on working with the project at all. I'm quite not sure how I would be able to finish the project on time and also be prepared for all exams. Any kind of advice or recommendation would be great. Thanks for your care and help^^"}, {"id": 2052, "value": "In my code, I have a while loop that read in inputs like POST /api/queue/tail/ HTTP/1.1, Host: localhost, Content-Type: application/json; charset=utf-8, Content-Length: 58. . . This is my while loop:. . while(cin >> method >> path >> endpoint >> host_trash >> host_in >> content_type_trash >> app_trash >> charset_trash >> content_length_trash >> content_len){. . . When I step over the while loop, the debugger gets stuck in the while loop (Can't continue to step over). . . Here is my launch.json file:. . . . . . I tried to use \"stdio\" instead of \"args\" and it says stdio is not allowed:. "}, {"id": 2053, "value": ". . Hello, I am currently stuck on these two errors I am being thrown in my list.h. Could you explain what they mean by why a type \"cannot bind to a value of an unrelated type\"? "}, {"id": 2054, "value": "I tempt to test self-assignment for the operator \"=\" but get such an error. I'm wondering does it mean we really don't need to consider self-assignment in the implementation of operator=. (I just remember that it's actually taken into consideration in the code provided in the lecture slides.). "}, {"id": 2055, "value": "I'm confused about why my following code didn't have an output by inputting test04.in. If I removed two lines: json input; cin >> input, there will appear outputs. But I don't know what's wrong with it. Is this error related to the new line between the content info and the json body?"}, {"id": 2056, "value": "I am a bit confused on what the Iterator class is supposed to do. . "}, {"id": 2057, "value": "If there is one item in the list, would first be that value and last would be nullptr? or would they both be the same thing"}, {"id": 2058, "value": "Should the insert function be able to insert a value at the end of the Linked List? So if you pass in the \"past the end\" iterator, should it add a value at the end of the list?"}, {"id": 2059, "value": "Hello. I use xcode and I was trying to compile List.h and List_tests.cpp. I made sure to include them in compile sources under build phases. But, I get these errors: . It does not recognize first and last even though those are private member variables. "}, {"id": 2060, "value": "Good morning,. . I wrote several test cases in list test however when I send my code through the auto grader, i get exit status 2, and the autograder shows that I have not submitted any test. How can I go about fixing this?"}, {"id": 2061, "value": "In P4 specs, the five requests are shown as. GET /api/. GET /api/queue/. GET /api/queue/head/. POST /api/queue/tail/. DELETE /api/queue/head/. . Do we have to consider any other requests? For example, would POST /api/queue/head/ be a valid request?. "}, {"id": 2062, "value": "When I use operator* on an iterator, I get an Address Sanitizer error that says heap-use-after-free on address. I also tried printing out node_ptr->datum which also gives the same error. Why am I getting this error?. . "}, {"id": 2063, "value": "I got this error and don't know the meaning, can someone help to explain it? Thanks!. "}, {"id": 2064, "value": "Hello, . .  When I try to run the list compile check I get an error saying that List is not a class. I also get many errors saying that my operand types for my overloaded iterator functions don't match but the error shows that they are both the same (List<int::Iterator). Does this mean I overloaded the functions wrong?. . my uniqname is Lania"}, {"id": 2065, "value": "I'm confused about why my following code didn't have an output by inputting test04.in. If I removed two lines: json input; cin >> input, there will appear outputs. But I don't know what's wrong with it. . "}, {"id": 2066, "value": ""}, {"id": 2067, "value": "We narrowed down the problem to an invalid comparison inside the 'remove' function of a list. The error it spits out seems to indicate that we have a fault comparing 'const Student' to 'const Student.' Any ideas of why this may be happening?. . Screen_Shot_2023-03-21_at_9.43.50_PM.png. . Thanks. "}, {"id": 2068, "value": "I was wondering if I needed to save the host value of the request for the GET /api/ request or if the host value always stays the same?"}, {"id": 2069, "value": ""}, {"id": 2070, "value": "We have finished our api.cpp, List_tests.cpp, and List.h and we tried to run api.cpp with our List.h. Our normal implementation of api.cpp uses the std list, and it can run just fine. But when we tried to use our implementation of List.H, we ran into some errors. It didn't recognize the -> & post-increment operators. So, we changed -> into (*iterator_name). and post-increment into pre-increment and everything ran just fine with the correct output. Is this a problem that can affect my project score?"}, {"id": 2071, "value": "Is there a way to index into a standard list? I was reading through the details on cplusplus.com and I didn't find a way to index into the list or an overload of the [] operator or anything like that. I'm not sure if I just skipped over it or if we're supposed to do it some other way like using the iterator or something?"}, {"id": 2072, "value": "Since we're using a JSON array to keep track of students in queue in order to display the queue when GET /api/queue/ is requested, how would we go about popping the JSON at the front of the array once DELETE is requested without leaving an extra JSON in the back of the array? For example, If I were to use a for loop to assign the first element to the next and so on, I would still be left with an extra copy of the last JSON in the back of the JSON array as it is fixed in size."}, {"id": 2073, "value": "Where are we supposed to read the JSON's from?"}, {"id": 2074, "value": "For these functions, is it appropriate to adjust the last pointer when needed?. . For example, if we are adding to an empty list or removing from a list with only one element, are we meant to adjust the last pointer accordingly?"}, {"id": 2075, "value": "I am confused on how to access variables like  method and path. I know it’s not a Argv this time so I’m confused on how we access these variables. "}, {"id": 2076, "value": "I’m a bit confused on how we are exactly supposed to access these variables in order to check which method is supposed to run? "}, {"id": 2077, "value": "could anyone help me to illustrate exactly when we should return 0 and when we should use “bad request”"}, {"id": 2078, "value": "Hi there. Could you explain a bit about the below scenario? I have no ideas what happened in this debugger. Much appreciated.. . "}, {"id": 2079, "value": "If there are still some people on the queue after popping the front person off the queue, will the content length still be 0 in this case?"}, {"id": 2080, "value": "I am confused with private and public class.  How do you test copy_all function?. . TEST(test_copy_all) {  List<int> list1;  List<int> list2;  list1.push_front(1);  list1.push_front(2);// not sure how to test copy_all  list1.copy_all(list2);  ASSERT_EQUAL(list2.front(),2);}. . List_tests.cpp:71:9: error: 'copy_all' is a private member of 'List<int>'  list1.copy_all(list2);        ^./List.h:181:8: note: declared private here  void copy_all(const List<T> &other){       ^1 error generated."}, {"id": 2081, "value": "When reading in a request using JSON, which items should be made JSON objects? Are we reading in strings for each of the headers, then one JSON object for the body? Or are we creating one large JSON object, where each of the headers have their own key-value pairs and the body is one key value pair? Or does every item, (body included) get its own individual key-value pair?. . Additionally, if we're reading everything to JSON then is there only one argv argument (./api.exe)?"}, {"id": 2082, "value": "Hello, so I'm currently trying to implement my erase and insert functions, and I was just wondering how they're intended to work. From what I understand, erase is supposed to delete the element our iterator is pointing to, therefore causing the iterator to point to null. Insert is supposed to insert an element before the element our iterator is pointing to, would this replace the previous node, or is it supposed to make space and then insert the element? I'm a bit confused here so if anyone could give me a general rundown, I'd really appreciate it."}, {"id": 2083, "value": "Quick quesiton:. Why is copy_all private? Should we make the other big 3 items (constructor, destructor, assignment) private as well?"}, {"id": 2084, "value": "I created a new OHQueue at the start of my program using OHQueue queue(); Then, when I tried to call a public function that I made called PrintQueue using queue.PrintQueue(), I get the error that \"expression must have class type but it has type \"OHQueue (*)()\"\". Does anyone know how to fix this?"}, {"id": 2085, "value": "When trying to run api.cpp, I am encountering the following error. I assume that is an issue with trying to access elements of a Json object. I have declared json J; and am trying to extract the location from the json object. I have tried visually debugging and it terminates when I reach this line. I followed the protocol from the JSON reference.. . . . I also tried this, and came up with the same error.. "}, {"id": 2086, "value": ""}, {"id": 2087, "value": "I made the erase function in the Iterator class. However, I don't use it in my implementations for List, Iterator, or the API. Am I missing something?"}, {"id": 2088, "value": "Hello,. Currently, my api.cpp passes all of the autograder tests, but one problem that I see arising is how I use getline(cin, __) right after calling cin >> before. Since I've heard that this can cause issues, is there any ways that I could completely fix them. My code is attached below. Thanks! . . "}, {"id": 2089, "value": ".   void erase(Iterator i) {.     if (i == begin()) {.       pop_front();.     } else if (i == end()) {.       pop_back();.     } else {.       Node* target {i.node_ptr}, prevPtr {(--i).node_ptr}, nextPtr {(++i).node_ptr};.       prevPtr->next = target->next;.       nextPtr->prev = target->prev;.       delete target;.     }.   }. . error: member reference type 'List<int>::Node' is not a pointer; did you mean to use '.'?. . Node* shall be a pointer to a node, and this structure contains a datum, a prev, a next, and an arrow operator shall work here. But why doe not now?"}, {"id": 2090, "value": ".     bool operator==(const Iterator &rhs) {.       return (node_ptr == rhs.node_ptr);.     }. . Error: candidate function not viable: 'this' argument has type 'const List<int>::Iterator', but method is not marked const . . I did not see any logic error here and left and right shall be the same data type, so I have no ideas why this error happen. Any suggestions?"}, {"id": 2091, "value": "Just wanted to clarify. The design in the spec mentions creating a temporary JSON object when reading from cin and writing to cout. Does this mean we have to make a dynamic variable or that the JSON object is just an intermediate object in our design?"}, {"id": 2092, "value": "I'm confused, do we just use (copy and paste) the url here:. \"queue_head_url\": \"http://localhost/queue/head/\",. ..... or there's way to get them"}, {"id": 2093, "value": "I am getting this error when trying running \"code .\" for opening remote session in VS Code: . . . . I have tried: . . 1) shutdown WSL. 2) going back through remote WSL tutorial on EECS280.org. 3) restarting VS Code. 4) restarting my PC. . I am not sure why this is all the sudden not working. I am just trying to start project 4. . "}, {"id": 2094, "value": "Can someone explain how the while loop would work in api.cpp? I've read through other posts about this but I'm still confused. When you type while(cin>>someVariable), how does that work? Would my while loop have to include all the variables I'm reading in? For example, would I have to say while(cin>>method>>path>>junk>>junk>>...>>contentLength)? If this is the case, what would kill this loop?"}, {"id": 2095, "value": "How can we can access the private member nodes for our pop_front implementations? Rather than using helpers"}, {"id": 2096, "value": ". Hello. I am running my List.h alongside List_compile_check.cpp, and I would like to verify what the expected output should be. I do know that my actual output above is wrong because I believe that it is supposed to be 1, 0, 42, 42, 42, 3, 1. Is that correct? Thank you!"}, {"id": 2097, "value": "I guess we are not allowed to use the ifstream. Then, how can we get a command line or data from the test files? "}, {"id": 2098, "value": "Our code compiled and passed the public test in vs code, however after we submitted to autograder, we got this error many different times and we aren't sure what it means or how to resolve the issue."}, {"id": 2099, "value": "Can we test this alone or without any other functions or do we need other functions to test this?. . We are getting this error and it says Undefined symbol: List<int>::empty()const . . Undefined symbol: List<int>::size()const . Undefined symbol: List<int>::back(). Undefined symbol: List<int>::front(). . "}, {"id": 2100, "value": "I've been getting this error for about a day. \"error for object 0x10e47f2f0: pointer being freed was not allocated\". . When I went to office hours, I was told I was deleting more things than I was making. To solve this, I tried rewriting my Big Three to not involve deletes at all. However, I still can't find where I would be having this issue.. . I also tried installing address sanitizers, but was told that the professor did not work on Mac and could not help me do it properly. Am I allowed to ask where in my code this extra delete is? My unique name is laurea"}, {"id": 2101, "value": "how do we know when to stop reading in messages for api.cpp? Should we use a while loop in main? If so I am confused as to how it would signal an end"}, {"id": 2102, "value": "When I submit my files to Autograder, for Student List tests it says, \"No test cases were submitted.\". . The file has plenty of test cases and I am not sure why this is occurring. "}, {"id": 2103, "value": "I am passing all the api.cpp tests on my local machine. However, when I put it in the autograder test03 and test05 are giving a different result. For some reason the position in the queue is messed up when I submit it to the autograder. The strange thing is that in test02 it calls the same \"POST\" command as test03. However, it only outputs this strange position number in test03.. "}, {"id": 2104, "value": "1terminate called after throwing an instance of 'nlohmann::detail::parse_error'2what(): [json.exception.parse_error.101] parse error at line 1, column 1: syntax error while parsing value - invalid literal; last read: 'C'. . My api.cpp compiles, but nothing is ever output because of this error."}, {"id": 2105, "value": "solved :D. "}, {"id": 2106, "value": ". Why would this function not need a delete in the implementation? Is it because of the destructor?"}, {"id": 2107, "value": "I'm receiving this error at the top of List_compile_check.cpp. Do I need to provide an include guard to resolve this?. . . . Edit: RESOLVED I believe I had something wrong with List.h that fixed this as well"}, {"id": 2108, "value": "The summary says it all for the most part. Since unique_ptrs are part of STL are they allowed for this project or since we have to include the <memory> header is this frowned upon (slash not allowed)?"}, {"id": 2109, "value": "When I am creating my student list, List<Student> queue, I am getting an error that, \"List is not a template\". My code seems to work fine when I use the standard library list with a lowercase, but when I use our own List class with a capital \"L\" I get this error.. . Any ideas?"}, {"id": 2110, "value": "Do we need to write test cases for big 3 of class list?"}, {"id": 2111, "value": "How would I go upon iterating through the Student list if node is a private member of list?"}, {"id": 2112, "value": "Hi. I am using `while (cin >> action >> path >> version) {}` in my `int main()`. However, seems the function did not read anything, and nothing was printed out.. . I configured the input file correctly.. . Can someone help? Thanks!!"}, {"id": 2113, "value": "Why do we have a list of Students rather than just a list of json objects? Are we supposed to make Student's member variables key/value pairs? I do not see the reasoning of a Student struct."}, {"id": 2114, "value": "Why here is copy ctor, but not the assignment operator? we have \"=\" sign here.. "}, {"id": 2115, "value": "Do we need to make use of freopen(“main_test.in”, “r”, stdin) While using Xcode for project 4 if so what should we place in the                               freopen(“—“,”—”, stdin) for it to work properly?"}, {"id": 2116, "value": "How to solve this?. . "}, {"id": 2117, "value": "I am getting an error when trying to compile List.h in delete_scalar.cpp within the following function. void __CRTDECL operator delete(void* const block) noexcept. {.     #ifdef _DEBUG.     _free_dbg(block, _UNKNOWN_BLOCK);.     #else.     free(block);.     #endif. }. I am unsure as to how I should be debugging this."}, {"id": 2118, "value": "for example:. a -> next = b;. b -> prev = a;. or we just need one of them?"}, {"id": 2119, "value": "For the operator==() in Iterator, I did it like Iterator& operator==(const List &rhs). , but if I want to return true or false, should I change it to bool operator==(const List &rhs)?. . Or should I not pass in anything to the function?. "}, {"id": 2120, "value": "I was wondering what the differences were between the leaks program in this tutorial https://eecs280staff.github.io/tutorials/setup_leakcheck.html#macos, vs the address sanitizer you enable in the diagnostics section of Xcode."}, {"id": 2121, "value": "My driver works for every provided test in file except test04, and I've identified that the only difference in the test files is that test04.in ends with the json object, so the last char is '}'. It appears that once my driver is finished processing the request and couting the response (which it does just fine), it tries to go back to the beginning of my while loop despite there being no more requests for it to read. So it prints the correct output and then gives me a parse error. I've included a screenshot of my terminal output for reference. I could use some help figuring out how to keep my main from stepping back into the while loop even when there is no more data for it to read.. . "}, {"id": 2122, "value": "Is this a valid request that we have to account for? I didn't see any instance of this in the spec or test cases given and just want to know if this should return 400 or if this should add someone to the head of the queue. Also for DELETE api/queue/tail"}, {"id": 2123, "value": "since we just have List.h, do we need to create a file called List.cpp?"}, {"id": 2124, "value": ". . Hello. I have tried to resolve this error as much as I could, but I am stuck. As I am coding this function, I am trying to assign temp to the position between u and w. That way, I can have it be in the following order: u, then temp, then w. This would allow me to satisfy the RME of the insert() function. However, I would like to receive any further suggestions as to what I could do to improve my code because it appears to be causing an error. I will continue to figure it out on my own, but I would appreciate any help that you may give me. Thank you!"}, {"id": 2125, "value": "I discovered an issue while writing test cases for my pop functions. My pop_front appears to be working fine but my pop_back is not correctly removing the last element of the list.. . I have list [-3 -4 -5 -6 -7 -8 -9] when I use pop_back it outputs [-3 -4 -5 -6 -7 -8 0]. . I have tried debugging and creating different lists. I have a similar implementation to pop_front using last and next to set value to a nullptr. And I am not sure why the 0 is showing up, I have also deleted the last node."}, {"id": 2126, "value": "From the example in std::list, it1 move to point next node after erase(t1). But if we cannot change the interface and add & , that is, cannot change `void erase(Iterator i)` to `void erase(Iterator &i)`. Does that mean we will not able to reuse it1 in test?"}, {"id": 2127, "value": "Hi, in the project overview she talked about using a while loop in api.cpp. . giving this example:. while(cin >> method >> endpoint). Method = “GET”. Endpoint = “/api/queue/head/”. . However, we were confused on when we would need to implement the while loop in api.cpp. "}, {"id": 2128, "value": "Will the formatting for request always be the same? I'm trying to figure out how to read in all the junk before the actual json and I was wondering if I could just use a for loop if there will always be the same amount of strings before the json?"}, {"id": 2129, "value": "Hi,. . This is my code for accepting a json object from post but I don't understand why it doesn't work. We should start reading the json object at  the { right?. . . else {string bracketFinder;.         while (getline(cin, bracketFinder)) {.           if (bracketFinder.empty()) {.               cout << \"line\" <<endl;;.               break;.           }.           cout<<bracketFinder<<endl;.         }.         .         json j1;.         cin>>j1;.         oh.add_student(j1);.         }. . . Thanks."}, {"id": 2130, "value": "This is my code and I'm getting an error for GET /api/queue/head: . . . . This is my output: . . . . The correct content-length is supposed to be 77."}, {"id": 2131, "value": "Hello instructors, so I'm currently trying to test the implementation of some of my List.h functions and I keep getting a \"free() invalid pointer\" error:When I run through this with my visual debugger, I get the following:. I don't even use pop front or pop back in the copy constructor test or the copy constructor itself but those functions are used in my = operator overload implementation through the clear() function.Additionally, when I comment out the delete statements in pop back and pop front, I get a segmentation fault when calling my copy contructor:. Visual Debugger for segmentation fault error points to the following:Can anyone help guide me in the right direction here, or is this something I should visit office hours for? Would appreciate any advice! Thank you"}, {"id": 2132, "value": "My list.h is currently experiencing a malloc error; a previous piazza post said I should be enabling sanitizers. However, when I tried to change my launch.json with what the tutorial suggested, it told me that \"Property environment: is not allowed\" Is this something I shouldn't be messing with at all, and should be instead focusing on fixing my code? . . Direct List.h code changes I've tried:. Making sure that Iterator has a destructor. Matching all instances of \"new\" and \"delete\" keywords.. . My unique name is laurea. "}, {"id": 2133, "value": "I am trying to figure out how to debug my api.cpp. How can I configure the launch.json to use the visual debugger for one of the tests given to us (i.e. test01.in, test02.in, etc)?"}, {"id": 2134, "value": "Hello! I am trying out some possible request sequences for inputs to api.exe, and after reading the spec I am a little unsure if my test requests are properly formatted.. . Is it correct that when you have a GET or DELETE, there will still be a newline afterwards?. . . POST /api/queue/tail/ HTTP/1.1. Host: localhost. Content-Type: application/json; charset=utf-8. Content-Length: 58. . {.     \"uniqname\": \"jackbad\",.     \"location\": \"Table 7\". }. GET /api/queue/ HTTP/1.1. Host: localhost. Content-Type: application/json; charset=utf-8. Content-Length: 0. . DELETE /api/queue/head/ HTTP/1.1. Host: localhost. Content-Type: application/json; charset=utf-8. Content-Length: 0. . . . . Thank you!"}, {"id": 2135, "value": "still a little confusing about the size function, do we need to add a int numsize as private variable for class list?"}, {"id": 2136, "value": "I am a little confused how to solve this error as I can not debug if it doesnt compile, any advice Screenshot_2023-03-19_at_11.32.09_AM.png"}, {"id": 2137, "value": "Would it be right to \"sink\" the text (per line with getline) if we don't need to process it? For example, we wouldn't really care about content-type, so we can sink it by writing it to some obscure string variable. Same with content-length; we can just \"sink\" it to the same string variable right?"}, {"id": 2138, "value": "Hi,. . just wanted to know what is the purpose of reading the entire body where there is a bad request? Isn’t the format of the output for a bad request always the same? Why do we need to process the lines after the bad request?. . Thanks."}, {"id": 2139, "value": "I was wondering, can we assume that the HTTP version will always be 1.1 in our code?"}, {"id": 2140, "value": "When handling a bad request, after reading in the rest of the body and returning the response, do we need to return zero or can the program continue to read in requests?"}, {"id": 2141, "value": "I just want to make sure I have this right- are json's read in like strings? If not, how are they read in?. . . If they are read in like strings, does cin work like it did in p2, one word at a time? Does this mean that with each cin it takes a key, then a value?"}, {"id": 2142, "value": "In the instructors' sample solution starter, the Student struct is declared as private, however, when trying to declare public member functions in the OHQueue class that return a Student object, an \"identifier \"Student\" is undefined\" error is given because Student is declared as private further down in the class declaration. Would it be acceptable to declare the Student struct as public to get around this?"}, {"id": 2143, "value": "Can I set the private variables first and list to nullptr every time I declare a list? Since there are not constructor for list, I can't come up with other ways to check whether the list is empty or not because first and last would be pointing at random things if I don't initialize them."}, {"id": 2144, "value": "I tried to create a function to get the ith element in the Student list. But there was an error in *(queue.begin( ) + i). What's wrong with that?. "}, {"id": 2145, "value": "I'm confused about whether we can create a function that returns json type in OHQueue class, or we can use json in these member functions but can't create a function that returns the json class."}, {"id": 2146, "value": "I tried inputting the test04.in and found that if I had 2 lines: \"json input; cin >> input\", by running the unit test, there wasn't any output. However, if I removed these two lines, and just remained the cout lines, there was some output lines. So what's wrong with my code?. . "}, {"id": 2147, "value": ". "}, {"id": 2148, "value": "Hi,. Could anyone please explain this error? I keep getting this from the List_tests runtime terminal. When I run make List_tests.exe, the compiler runs but when I run ./List_tests.exe, I receive this error. Thanks. "}, {"id": 2149, "value": "What does this error mean? My code has the proper output for the printing out the whole queue in VSCode but doesn't print at all and throws this error in the autograder.. Screenshot_2023-03-18_at_8.54.31_PM.png"}, {"id": 2150, "value": "When I try to link the old \"first\" node to the new \"first with this segment:. if(first != nullptr){       first->prev = new_node;}. I get this error:. Thread 1: EXC_BAD_ACCESS (code=EXC_I386_GPFLT). I'm not sure what's going on, since I made sure to check whether first was null before assigning its previous node. Is there any way to fix this?"}, {"id": 2151, "value": "title "}, {"id": 2152, "value": "I'm a little confused on where to start. I read through the specs and watched the overview but I'm still not sure how we're supposed to go about things. I figure I'm supposed to start with api.cpp since that's what comes first in the specs but the specs also make it seem like we'll need to implement and use a list in api.cpp but for now, we just use the standard library list. Should I just start on api.cpp then? Will I have to change my code anyway after implementing the list and using that api.cpp instead?"}, {"id": 2153, "value": "Hello I've been trying to access these private members of the student struct, but am coming across these errors: . . "}, {"id": 2154, "value": "How would I access the input request of the JSON file if we don't know the keynames of the file? . Ex: If the input request is GET, it should cout 200, but how do I check if it is GET through indexing. I've checked the spec and JSON reference tab and am still confused."}, {"id": 2155, "value": "Hello. Can someone explain to me why this doesnt' work? . . . . The for loop isn't compiling and I am confused to why this is happening."}, {"id": 2156, "value": "My List_compile_check doesn't like how I defined operator= in List, and I'm at a loss for what I should have assigned to it otherwise. Screen_Shot_2023-03-18_at_4.40.18_PM.png"}, {"id": 2157, "value": "Hi,. . I'm getting the following output when getting the whole queue:. . . How is this even possible in terms of it printing \\n? Any ideas?. . Thanks"}, {"id": 2158, "value": "It says we should keep track of size with a private member variable so we created one in List.h but we are receiving this error that claims size was already declared in the member function int size() const. Also we are confused why we are receiving an error after trying to use our private member variable in our public member functions. "}, {"id": 2159, "value": "Hi, I have looked at @3041. I'm still very confused how to access the student struct when it is private and inside class OHQueue. Can someone point me in the right direction with suggestions, notes, or lecture slides, etc. about how I could go about doing this? Thanks!"}, {"id": 2160, "value": "Hi,. . I'm working on api.cpp, specifically GET /api/queue/.. . I see that the output is supposed to have an array inside of the json, however json values cannot store arrays, so how should I handle this? Any suggestions?. . Thanks"}, {"id": 2161, "value": "Is it proper syntax to use List member functions in the implementation of Iterator member functions such as erase() and insert(). We were thinking of using some of the push and pop List functions in these. Would this be ok?"}, {"id": 2162, "value": "Should we always make first->previous and last->next to nullptr? Would we ever go out of that bound? And would we need to update the original first previous node when calling push_front?"}, {"id": 2163, "value": "When I try to delete the object at i in the erase() function, I get this issue:. Thread 1: signal SIGABRT. p4-web(69443,0x7ff85d8bf680) malloc: *** error for object 0xa6a03463472300d4: pointer being freed was not allocatedp4-web(69443,0x7ff85d8bf680) malloc: *** set a breakpoint in malloc_error_break to debug. . Could anyone explain how to fix this? I've tried creating a new node pointer and setting that node to the target to delete after looping through everything, but I still get the same error."}, {"id": 2164, "value": "The DO list of the requirements and restrictions section of the spec does not include the json library. Are we allowed to use it?. "}, {"id": 2165, "value": ""}, {"id": 2166, "value": "Hello, so I'm getting an error saying invalid pointer and I'm pretty sure it's because my List copy constructor is supposed to take in a pointer but I don't exactly know how to go about passing that in. If I declare the list being passed in as a pointer, I get an uninitialized error because it points to an undefined location, and if I dynamically allocate memory for it, I get the invalid pointer error again. Could anyone guide me in the right direction here?"}, {"id": 2167, "value": "Hi, . I am working on implementing some push/pop functions for list.h. Specifically, I am confused about what the prev/next pointers point to at each of the ends, since the list we discussed in lecture was only singly linked. . . Here is what I assume:. For first node: \"next\" points to second node, and \"prev\" points to the \"first\" pointer's address. . For last node: \"next\" points to nullptr and \"prev\" points to penultimate node. . . Please let me know if these are correct assumptions."}, {"id": 2168, "value": "Hello,I wonder if there is any alternative to Valgrind on Mac that can detect memory leak. Although my code compiled with address sanitizer enabled, I’m afraid there are some undetected issues in memory. Thank you!"}, {"id": 2169, "value": "would it be valid if I delete node_ptr that isn't on the heap? For the custom destructor, I'm not sure if the Node would be on the heap or not."}, {"id": 2170, "value": "How do we implement a destructor for the irerator, I tried to do \"delete node_ptr\", but it does not work"}, {"id": 2171, "value": "Would the method and endpoint of a request being private member variables of the OHQueue Class be a good design choice? Keeping track of them is important so I was wondering if this would be applicable."}, {"id": 2172, "value": "Hello. I’m having trouble with compiling List.h on Xcode. I included it under compile sources but when I write wrong statements, it does not show any errors. I think the issue is that it’s a header file. Should I change it .cpp for now and change it back later. Would appreciate any help. "}, {"id": 2173, "value": "If we delete a person from the head of the queue, should all other students positions be updated accordingly? . . I couldn't find anything in the spec about this.. . Thanks."}, {"id": 2174, "value": "So if we read in from the json object in cin I would of course read in the method and then the endpoint. However following this there is the rest of the content before the body of the json file. I can continue reading this into a temporary string until the empty line and then initialize my json object with the information in the body?"}, {"id": 2175, "value": "For errors like calling delete on an empty queue, should we read the entire request and then print the error or just print the error and keep reading the requests as usual?"}, {"id": 2176, "value": "List.h compiled on my own system but came back with a compile error on the autograder, could someone explain what this error means? Thank you!. . "}, {"id": 2177, "value": "Hello, for List.h, I am passing all compile checks in Autograder, however locally I am getting the segmentation fault shown below when I run List_compile_check.cpp. I am not sure what the cause of this issue is.. . My uniqname is rrishi if checking Autograder helps. Thank you!. . "}, {"id": 2178, "value": "is there something I am missing to make sure the server runs indefinitely? I feel like it may be frozen because it is only making one request. . EDIT: RESOLVED I had a bug that made it wait indefinitely."}, {"id": 2179, "value": "I'm trying to get the uniqname and location from the json object in the input file, but keep running to errors. I tried using student[\"uniqname\"] and student.value(\"uniqname\", string()), where student is the json object I read data into, but got exception errors saying that [] and value() cannot be used with strings. I was wondering if someone could point me in the right direction as to how to approach this problem? Thank you!"}, {"id": 2180, "value": "Hello,. . I am confused about how to test the destructor of List. Could anyone please give me some hints? Thank you!  "}, {"id": 2181, "value": "If DELETE /api/queue/head/ was requested, would you have to iterate through the queue to change everyone's position down by 1? "}, {"id": 2182, "value": "Hi,. . I tried to initialize a new Node by initializer list, which is a more succinct way to build a Node according to course notes. However, my compiler is complaining. Could you please help me fix this issue? Thank you!. "}, {"id": 2183, "value": "Hello I am creating a new node and then getting that the type is not recognizedScreenshot_2023-03-16_at_7.41.17_PM.png any advice?"}, {"id": 2184, "value": "Good afternoon,. . I am a bit confused on how to read in the type of request from the http. I understand how to extract things such as the unique name and location off the json I read in, but I am having trouble with all of the header stuff: host, content type, etc. . . thank you,"}, {"id": 2185, "value": "We are confused on how to calculate the content-length when we are printing it out. Another post said that the content length is the byte size of the JSON. We know that chars are byte size 1, ints are byte size 4 and endlines are 2 bytes but we have tried adding them in different ways (counting whitespace gives 76 vs not counting whitespace gives 61 vs counting endlines and whitespace gives 82) and we can't seem to get 77. We were also wondering if we are supposed to count the brackets in the content-length. "}, {"id": 2186, "value": "We are getting a parse error when trying to read in some of the test cases with multiple requests and we think it's because we're reading in the json file incorrectly. We created a new json object and used cin to read in the json, but we aren't sure if the error is because cin doesn't know when to stop reading one request. How should we go about fixing this error?. . "}, {"id": 2187, "value": "Where can we find the response codes for each type of response?"}, {"id": 2188, "value": "What exactly are the == and != operators supposed to do for iterators? Do they just check if the datum contained in each node being pointed to is the same?"}, {"id": 2189, "value": ". when we implement this code for test02, all we get to the output is \"uniqname\" which is the first piece of data in the input file. when we went to the next cin, we got the value of the uniqname, which was \"awdeorio\". Aren't we supposed the next key value, which is \"location\" instead of \"awdeorio\"? We're confused as to how this works. "}, {"id": 2190, "value": "The spec says that it's recommended that we start api.cpp using the STL list, but once we finish implementing everything in list.h, would we replace #include <list> with #include \"list.h\"? Would this change anything within api.cpp?"}, {"id": 2191, "value": "If we want to add the default constructor, destructor, copy constructor, and overloaded assignment operator, could we just define it during the declaration? What I mean is in that way, we don't need to define the constructor outside the class, since I saw that we have to define all the \"member functions\" outside the class."}, {"id": 2192, "value": "On the spec, it says that there making the real web server is optional. Does this mean that implementing api.cpp is optional or is that still required? "}, {"id": 2193, "value": ". . "}, {"id": 2194, "value": "Hi there!. I am confused about the operator* in the Iterator class, could you offer any clarifications here? Much appreciated.. "}, {"id": 2195, "value": "I have implemented both functions, however I am not sure on how I am supposed to test/use these functions"}, {"id": 2196, "value": "Hi! I've been having issues accessing the files my partner added to our git repository on my VSCode. I went to office hours today and made sure I had the files on my local repo on my laptop but when I opened my VSCode to work on the files, I couldn't find the files where they should be on my laptop? I think based on my Ubuntu picture below they should be in a C:Eecs280/p4-web/p4-web folder, but it doesn't seem like any such folder exists on my laptop?. . . . I did a search on my file explorer for p4-web but couldn't find it. Should I try making another local repo, or should I be looking somewhere else for the files? I understand this is a hard issue to resolve over Piazza so if I'm not able to figure this out tonight I will go back to office hours tomorrow. Thanks!. . "}, {"id": 2197, "value": ". When I try to add compile sources, it only shows my entire folder but not the explicit files. I tried to do \"add new files\" and add all files (within p4-webNEW) directly into p4-webProto but it seems to disconnect it from my remote repository for some reason. "}, {"id": 2198, "value": ". . I tried to use [], .at(), but I'm not sure how to access a specific student in the list to get their information to add to the response."}, {"id": 2199, "value": "how are we supposed to access the student strut in OHQueue? In specific, how do we set the values in that strut from a OHQueue member function?"}, {"id": 2200, "value": "When running the localhost8000 web server, the adding members to the queue seems to be working fine. However, when I try to delete, my function pauses and the web server becomes frozen and doesn't delete the members and I have to restart again. When I try my delete in api.exe, it runs fine. The autograder also compiled and ran the correct ouput. Is this a problem I need to fix?"}, {"id": 2201, "value": "If the api.cpp is not finished should the test for list still be able to work?. what are the compile sources to check the public test? I get this error when I try to run it without the api.cpp in the compile sources \". libc++abi: terminating with uncaught exception of type std::runtime_error: Test ./api.exe not found. terminating with uncaught exception of type std::runtime_error: Test ./api.exe not found\""}, {"id": 2202, "value": "Can someone help me with this problem? I got this error on Autograder, but it didn't show up on my side, I am confused because the private members were give in the original file. Thanks in advance!. "}, {"id": 2203, "value": ". . "}, {"id": 2204, "value": "Hello,. . for the size function in list.h, is node_ptr considered the size or do we add a private variable for the size?. . Thank you."}, {"id": 2205, "value": "below is a picture of my public error on the autograder, however the outcome on both sides is the same but it is being marked as different. I'm so very confused.. . "}, {"id": 2206, "value": "Should list.erase(--list.end()) work by erasing the last element of the linked list? Because in the -- operator we assert(null_ptr), however list.end() gives a null_ptr so for me I get stopped by assertion."}, {"id": 2207, "value": ". . ??"}, {"id": 2208, "value": "It gives me type_error when I try to assign the value of uniquename of the student being read using JSON like that: student.uniquename = string(j1[\"uniquename\"]); I want to know why it couldn't work and what will be the correct way to store each string value into the member variables of structs. Thanks a lot!"}, {"id": 2209, "value": "How do we use the iterator we created in list.h in api.cpp, is there a specific format to do so, because whenever I use it like \". . for (List<students>::Iterator it = queue.begin(); it != queue.end(); ++it)\" or \". . for (Iterator it = queue.begin(); it != queue.end(); ++it)\" its in red. . . "}, {"id": 2210, "value": "In this request it says that if the queue is empty it returns 400, but where are we supposed to return 400, in the body of the response? or where"}, {"id": 2211, "value": "This is a bit off topic from the requirements for project 4, but I was curious, is it possible to use C++ as a real web server, and get the requests from an `istream` directly?. . I know there is a Python wrapper included in the starter files to send requests to `cin`, but I was wondering more of if there's a way to get requests directly from a socket, for example, as an `istream`, in C++."}, {"id": 2212, "value": "can we add private member variables to the list class?"}, {"id": 2213, "value": "I’m looking for partner for project 4 I’ve worked solely on the previous three projects but work is kind of piling up. I posted in the looking for a partner thread but have not had any responses. I’m going to start the project today or tomorrow and just posting this so it’ll get seen. If you are also in need of a partner please email me at tyemohr@umich.edu"}, {"id": 2214, "value": "Hi everyone! The P4 Overview Live Session will be TONIGHT (3/14) on Zoom from 8-9pm EST. As usual, this session will be recorded and uploaded to Piazza & the website. Hope to see you there!. . Zoom: https://umich.zoom.us/j/2084220248Slides: https://docs.google.com/presentation/d/1fNC3R8FWvE4LGGiOiEHJTGJfFVuECJS1HFvzYULgdhQ/edit#slide=id.g100700217d4_0_131. Recording: https://umich.zoom.us/rec/share/mkRETfKJ4etL6GZPcqiGini6RZ586OBAu4fHTz_dx4S1Or71X-G9zRoy4WENwHIx.f5usi_soxCXG5LKN?startTime=1678838797000. . minustheNdaywhoooooo"}, {"id": 2215, "value": "For the GET request, my partner and I don't understand how to insert all the individual student JSONs within the larger queue JSON. Is there a way or function to add JSONs within a JSON and ultimately print it out?. "}, {"id": 2216, "value": "Are all requests taken in through cin as a string?"}, {"id": 2217, "value": "Hello, I was wondering if there were any big changes to project 4 for this semester compared to fall 22 semester. I'm unfortunately retaking the class and was wondering."}, {"id": 2218, "value": "Hi, . . How do you write the function implementations for the Iterator class outside of Iterator since all the functions are declared as private? Do we have to directly implement it in the class?"}, {"id": 2219, "value": "According to the spec, I saw that we need to cout null if the queue list is empty, but I don't know what is the correct format for using a null value. If anyone could plz give me some clue on that, thanks a lot!. Update: Should we use json()?. . "}, {"id": 2220, "value": ". class OHQueue {. public:. . private:. struct Student {. . };. std::list<Student> queue;. };. . . If I was to implement the OHQueue class as recommended in the spec wouldn't I need a OHQueue.h file as well?? Or can I just implement all the functions within api.cpp? How do declaring classes within api.cpp work??"}, {"id": 2221, "value": "I'm not sure how to proceed without knowing linked lists and iterators. Should we be working on api.cpp if we don't know those yet? . . Basically, I don't know where to start, and I would appreciate some guidance on what I should work on right now, without knowing linked lists and iterators as of now.. . It also says to \"Use the standard library list so you can get started on this project right away\" but I don't understand where it wants me to use that (I'm assuming not in List.h), does it want me to use the stl list just for now to start writing api.cpp??. . Thanks!"}, {"id": 2222, "value": ". . Hello, can someone help me figure this out?  I am currently getting this error when trying to make the server.py. I  have downloaded and updated python.. Thanks."}, {"id": 2223, "value": "since we can't use json objects in our OH queue list, should we attempt to extract the information from it to transfer to the student struct and then the student list?"}, {"id": 2224, "value": "when showing an instructor started solution on the spec for p4, should we be writing and implementing a class in api.cpp, and further using its functions in main to get requests that fit into its student struct and list?"}, {"id": 2225, "value": "When I create a List object my constructor sets first and last to nullptr. When I go to the debugger it shows an infinite amount of next and prev dropdowns. Is this supposed to happen?:"}, {"id": 2226, "value": "What lectures are covered in project 4?"}, {"id": 2227, "value": "Do we need to also implement the << operator for iterators because it is used in the list_compile_check file?"}, {"id": 2228, "value": "For the insert function in the Iterator class, when it says it requires \"i is a valid iterator associated with this list\" does this mean we do not need to take into account when the list is empty? "}, {"id": 2229, "value": "Can we use string.find() to see if a keyword is in the string?"}, {"id": 2230, "value": "I'm still confused about the way we read data from the .in file. When I created a JSON object \"method\" and call \"cin >>  method\" as said in the intro slides for p4, it reports an error like this. . However, if I declared the variable \"method\" of type \"string\", I have no trouble reading the data from in. file. But I think we're supposed to create a  JSON object, so I'm confused about it."}, {"id": 2231, "value": "Im confused on what content-length means. When I count the characters inside the json, it's always less than the length number so I must be missing something."}, {"id": 2232, "value": "What does \"return a list of URLs supported by this REST API\" mean, how can I get these URLs."}, {"id": 2233, "value": "I have no clue on what we have to do in api.cpp. I've read the specs, but it makes no sense to me, there is content we have not learned and that we are not going to learn in 280. Like, we have not learned what's HTTP or who is JASON, we just have the definition in the specs. Can I have some material to have further explanation on these topics?"}, {"id": 2234, "value": "Do we have a timeline for project in spec like in eecs 183? I have two midterms so I might start not that early but I want to make sure I'm on a good track of p4."}, {"id": 2235, "value": "We have to write a clear function by calling pop_back until first = nullptr to clear a list when we are done with it. Is this any different to the implementation of the destructor? What is the difference between using this clear function and using the destructor?"}, {"id": 2236, "value": "When reading json to cin, does the part before the {} get read? Every time I input the .in data from cin it cancels when I paste an entire request, but when I just paste what's in {}, it works fine. How would the computer know what request to do?"}, {"id": 2237, "value": "I wrote some test cases for List.h and they all run and pass when I use my terminal. However, when I submitted my tests to autograder, it said the exit status was 2 and no test cases were submitted. I included everything exactly as in public test, so I wonder what might have caused this problem."}, {"id": 2238, "value": "This is the thread for P4 FAQ's.  Reminder P4 is due on Wednesday, March 29th at 8pm! This really saves us so much time when helping you whether it be looking up your code on the AG or doing anything exam related.. The p4 intro session to be determined.. . Q: What is a linked list/iterator?. A: A linked list is another kind of container and an iterator is an object used to traverse and access elements in a container. You can refer to the lecture slides or the class notes (https://eecs280staff.github.io/notes/) if you have any questions..  . Q: Why am I getting an error related to accessing a private member of Iterator in a List function?. A: By default private members of the nested Iterator class are not accessible to the List class. The solution is friendship! We'll be covering friend declarations in the Iterator lecture. .  . Q: Should I test the destructor/How do I test the destructor?. A: You should write tests for every function that you can. You're not responsible for testing the destructor in your test cases, but you should use a tool like valgrind to ensure that your code isn't leaking memory. You shouldn't call the destructor explicitly! The compiler does so automatically when the object dies..  . Q: Why am I getting a segfault/undefined behavior?. A: Address Sanitizers are a great way to see where memory leaks and undefined behavior are in your program, which is very common in this project!! Segfaults and undefined behavior are typically the result of not initializing your variables or having pointers that point to bad memory (example being data that has been deleted). If you see these errors, try using the Address Sanitizers (found at this tutorial) to help debug your program..  . Q: Why does my test case compile on CAEN, but not on the Autograder?. A: Double check that you haven't added any public functions or made one that was originally declared private, public. Also, double check that you've not put using namespace std in a header file. Also, you can't compare an Iterator with a pointer.. . Q: How do I start api.cpp? What should the program look like?. A: Be sure to check out the project intro slides here.  They include information that you may find useful when implementing api.cpp.  Think about where you need to take input from, and what different things your program needs to be able to do with it. Then, break your code up into different functions or a class or whatever structure you'd like - just try and keep things organized, and don't just use one giant function.. . Q: On the style check I'm getting a \"memory is allocated but not initialized\" error whenever I create a Node.  But I'm initializing my Node data member variables in the lines directly following.  How do I fix this?. A:  This occurs because the style checker sees that you create your Node on one line, but is not smart enough to check the following lines to see that you initialize the members of the newly created Node. This can be solved in a few different ways.. . Default constructing your members then initializing them.. . Node* n = new Node{};. n->datum = datum;. .... . Using brace intialization to create the new node.. . Node* n = new Node{next_in, prev_in, datum};. . Creating a default constructor for Node.. . We recommend options 1 or 2, since they are easiest to implement and integrate into your existing code. Option 3 is a little more complex, but good practice.. . Happy coding!. pinkedlists. "}, {"id": 2239, "value": "Hello,. . Given the file List_compile_check.cpp, it seems that there are mistakes with the operands. I'm assuming we either implement the operands in the file or I had a mistake in the file, but when I opened the File I had 9 mistakes due to the operands. are we supposed to implement the undefined operands?. . Thank you."}, {"id": 2240, "value": "Edit: resolved"}, {"id": 2241, "value": "When will the Winter 2023 spec for project 4 be released?"}, {"id": 2242, "value": "Will we have it before or after spring break?"}, {"id": 2243, "value": "Is Autograder down?"}, {"id": 2244, "value": "How do I add a command line argument (the line I would like to run on the terminal) to the debugger?"}], "links": [{"source": 1523, "target": 1523, "value": 1.0}, {"source": 1527, "target": 1527, "value": 1.0}, {"source": 1538, "target": 1538, "value": 1.0}, {"source": 1540, "target": 1540, "value": 1.0}, {"source": 1540, "target": 1682, "value": 1.0}, {"source": 1542, "target": 1542, "value": 1.0000000000000004}, {"source": 1544, "target": 1544, "value": 0.9999999999999997}, {"source": 1553, "target": 1553, "value": 1.0000000000000002}, {"source": 1553, "target": 1735, "value": 0.6172133998483676}, {"source": 1561, "target": 1561, "value": 1.0000000000000002}, {"source": 1562, "target": 1562, "value": 1.0000000000000002}, {"source": 1563, "target": 1563, "value": 1.0}, {"source": 1567, "target": 1567, "value": 1.0000000000000002}, {"source": 1570, "target": 1570, "value": 1.0000000000000002}, {"source": 1577, "target": 1577, "value": 1.0000000000000002}, {"source": 1577, "target": 1962, "value": 0.6694555487165054}, {"source": 1586, "target": 1586, "value": 1.0}, {"source": 1594, "target": 1594, "value": 1.0}, {"source": 1596, "target": 1596, "value": 1.0}, {"source": 1596, "target": 1624, "value": 0.6708203932499369}, {"source": 1598, "target": 1598, "value": 1.0000000000000002}, {"source": 1598, "target": 1599, "value": 0.9684210526315793}, {"source": 1599, "target": 1599, "value": 1.0000000000000002}, {"source": 1600, "target": 1600, "value": 1.0}, {"source": 1602, "target": 1602, "value": 0.9999999999999994}, {"source": 1603, "target": 1603, "value": 1.0000000000000002}, {"source": 1609, "target": 1609, "value": 1.0000000000000002}, {"source": 1610, "target": 1610, "value": 0.9999999999999999}, {"source": 1611, "target": 1611, "value": 1.0}, {"source": 1612, "target": 1612, "value": 1.0000000000000002}, {"source": 1613, "target": 1613, "value": 1.0}, {"source": 1614, "target": 1614, "value": 1.0000000000000004}, {"source": 1616, "target": 1616, "value": 0.9999999999999998}, {"source": 1617, "target": 1617, "value": 0.9999999999999997}, {"source": 1618, "target": 1618, "value": 0.9999999999999998}, {"source": 1619, "target": 1619, "value": 0.9999999999999997}, {"source": 1624, "target": 1624, "value": 0.9999999999999999}, {"source": 1633, "target": 1633, "value": 0.9999999999999996}, {"source": 1635, "target": 1635, "value": 0.9999999999999999}, {"source": 1637, "target": 1637, "value": 1.0000000000000004}, {"source": 1640, "target": 1640, "value": 0.9999999999999998}, {"source": 1646, "target": 1646, "value": 0.9999999999999999}, {"source": 1649, "target": 1649, "value": 1.0000000000000002}, {"source": 1654, "target": 1654, "value": 0.9999999999999999}, {"source": 1656, "target": 1656, "value": 0.9999999999999997}, {"source": 1657, "target": 2109, "value": 0.6315809309675277}, {"source": 1665, "target": 1665, "value": 0.9999999999999999}, {"source": 1667, "target": 1667, "value": 0.9999999999999998}, {"source": 1671, "target": 1671, "value": 1.0}, {"source": 1674, "target": 1674, "value": 1.0}, {"source": 1675, "target": 1675, "value": 1.0000000000000004}, {"source": 1678, "target": 1678, "value": 1.0}, {"source": 1679, "target": 1679, "value": 1.0000000000000002}, {"source": 1679, "target": 1962, "value": 0.6061425089873718}, {"source": 1680, "target": 1680, "value": 0.9999999999999996}, {"source": 1681, "target": 1681, "value": 1.0}, {"source": 1682, "target": 1682, "value": 1.0}, {"source": 1686, "target": 1686, "value": 1.0}, {"source": 1690, "target": 1690, "value": 0.9999999999999998}, {"source": 1690, "target": 1784, "value": 0.6732958771071574}, {"source": 1693, "target": 1693, "value": 1.0000000000000002}, {"source": 1694, "target": 1694, "value": 1.0}, {"source": 1695, "target": 1695, "value": 0.9999999999999997}, {"source": 1698, "target": 1698, "value": 1.0}, {"source": 1700, "target": 1700, "value": 0.9999999999999997}, {"source": 1704, "target": 1704, "value": 1.0}, {"source": 1704, "target": 1800, "value": 0.6691292237891385}, {"source": 1705, "target": 1705, "value": 0.9999999999999998}, {"source": 1706, "target": 1706, "value": 1.0000000000000002}, {"source": 1708, "target": 1708, "value": 0.9999999999999999}, {"source": 1710, "target": 1710, "value": 1.0000000000000002}, {"source": 1712, "target": 1712, "value": 0.9999999999999999}, {"source": 1713, "target": 1713, "value": 0.9999999999999997}, {"source": 1716, "target": 1716, "value": 1.0}, {"source": 1717, "target": 1717, "value": 1.0000000000000002}, {"source": 1720, "target": 1720, "value": 0.9999999999999999}, {"source": 1722, "target": 1722, "value": 1.0000000000000002}, {"source": 1724, "target": 1724, "value": 1.0}, {"source": 1725, "target": 1725, "value": 0.9999999999999998}, {"source": 1726, "target": 1726, "value": 1.0}, {"source": 1728, "target": 1728, "value": 1.0000000000000002}, {"source": 1729, "target": 1729, "value": 0.9999999999999998}, {"source": 1735, "target": 1735, "value": 0.9999999999999998}, {"source": 1743, "target": 1743, "value": 0.9999999999999996}, {"source": 1745, "target": 1745, "value": 1.0000000000000004}, {"source": 1751, "target": 2025, "value": 0.6201736729460424}, {"source": 1755, "target": 1755, "value": 1.0}, {"source": 1758, "target": 1758, "value": 0.9999999999999998}, {"source": 1761, "target": 1761, "value": 0.9999999999999999}, {"source": 1761, "target": 2104, "value": 0.6299407883487121}, {"source": 1762, "target": 1762, "value": 0.9999999999999999}, {"source": 1764, "target": 1764, "value": 1.0}, {"source": 1766, "target": 1766, "value": 1.0}, {"source": 1767, "target": 1767, "value": 1.0}, {"source": 1773, "target": 1773, "value": 0.9999999999999998}, {"source": 1774, "target": 1774, "value": 1.0}, {"source": 1777, "target": 1777, "value": 1.0}, {"source": 1778, "target": 1778, "value": 1.0000000000000002}, {"source": 1782, "target": 1782, "value": 0.9999999999999998}, {"source": 1784, "target": 1784, "value": 0.9999999999999999}, {"source": 1784, "target": 1932, "value": 0.6396791042668531}, {"source": 1786, "target": 1786, "value": 0.9999999999999999}, {"source": 1787, "target": 1787, "value": 1.0}, {"source": 1789, "target": 1789, "value": 0.9999999999999997}, {"source": 1790, "target": 1790, "value": 0.9999999999999999}, {"source": 1793, "target": 1793, "value": 0.9999999999999997}, {"source": 1796, "target": 1796, "value": 1.0}, {"source": 1797, "target": 1797, "value": 0.9999999999999999}, {"source": 1798, "target": 1798, "value": 1.0}, {"source": 1799, "target": 1799, "value": 1.0}, {"source": 1800, "target": 1800, "value": 1.0000000000000002}, {"source": 1801, "target": 1801, "value": 1.0000000000000002}, {"source": 1804, "target": 1804, "value": 1.0000000000000002}, {"source": 1807, "target": 1807, "value": 0.9999999999999999}, {"source": 1808, "target": 1808, "value": 1.0}, {"source": 1812, "target": 1812, "value": 1.0000000000000002}, {"source": 1813, "target": 1813, "value": 1.0}, {"source": 1814, "target": 1814, "value": 1.0}, {"source": 1814, "target": 1932, "value": 0.6096419985012792}, {"source": 1819, "target": 1819, "value": 1.0000000000000002}, {"source": 1820, "target": 1820, "value": 1.0000000000000002}, {"source": 1823, "target": 1823, "value": 1.0}, {"source": 1827, "target": 1827, "value": 1.0000000000000004}, {"source": 1830, "target": 1830, "value": 0.9999999999999996}, {"source": 1835, "target": 1835, "value": 1.0}, {"source": 1836, "target": 1836, "value": 0.9999999999999998}, {"source": 1836, "target": 1855, "value": 0.9999999999999998}, {"source": 1839, "target": 1839, "value": 0.9999999999999997}, {"source": 1841, "target": 1841, "value": 0.9999999999999999}, {"source": 1843, "target": 1843, "value": 1.0}, {"source": 1843, "target": 1962, "value": 0.6170919847985359}, {"source": 1844, "target": 1844, "value": 1.0000000000000004}, {"source": 1850, "target": 1850, "value": 1.0}, {"source": 1852, "target": 1852, "value": 1.0}, {"source": 1855, "target": 1855, "value": 0.9999999999999998}, {"source": 1858, "target": 1858, "value": 1.0000000000000002}, {"source": 1861, "target": 1861, "value": 1.0000000000000002}, {"source": 1863, "target": 1863, "value": 1.0}, {"source": 1865, "target": 1932, "value": 0.6046065289967438}, {"source": 1867, "target": 1867, "value": 0.9999999999999997}, {"source": 1873, "target": 1873, "value": 1.0000000000000002}, {"source": 1878, "target": 1878, "value": 1.0}, {"source": 1885, "target": 1885, "value": 0.9999999999999996}, {"source": 1893, "target": 1893, "value": 0.9999999999999996}, {"source": 1895, "target": 1895, "value": 0.9999999999999998}, {"source": 1897, "target": 1897, "value": 1.0}, {"source": 1898, "target": 1898, "value": 1.0}, {"source": 1900, "target": 1900, "value": 1.0}, {"source": 1910, "target": 1910, "value": 1.0}, {"source": 1912, "target": 1912, "value": 0.9999999999999998}, {"source": 1913, "target": 1913, "value": 0.9999999999999999}, {"source": 1916, "target": 1916, "value": 1.0}, {"source": 1917, "target": 1917, "value": 0.9999999999999998}, {"source": 1918, "target": 1918, "value": 1.0000000000000002}, {"source": 1919, "target": 1919, "value": 0.9999999999999998}, {"source": 1921, "target": 1921, "value": 1.0}, {"source": 1923, "target": 1923, "value": 0.9999999999999998}, {"source": 1924, "target": 1924, "value": 0.9999999999999999}, {"source": 1932, "target": 1932, "value": 1.0000000000000002}, {"source": 1935, "target": 1935, "value": 0.9999999999999997}, {"source": 1938, "target": 1938, "value": 1.0}, {"source": 1954, "target": 1954, "value": 1.0000000000000002}, {"source": 1957, "target": 1957, "value": 0.9999999999999999}, {"source": 1961, "target": 1961, "value": 1.0}, {"source": 1962, "target": 1962, "value": 1.0000000000000002}, {"source": 1967, "target": 1967, "value": 0.9999999999999998}, {"source": 1968, "target": 1968, "value": 0.9999999999999998}, {"source": 1969, "target": 1969, "value": 0.9999999999999997}, {"source": 1971, "target": 1971, "value": 1.0000000000000002}, {"source": 1972, "target": 1972, "value": 1.0}, {"source": 1975, "target": 1975, "value": 0.9999999999999994}, {"source": 1976, "target": 2109, "value": 0.6425396041156863}, {"source": 1979, "target": 1979, "value": 0.9999999999999998}, {"source": 1980, "target": 1980, "value": 0.9999999999999999}, {"source": 1986, "target": 1986, "value": 1.0000000000000002}, {"source": 1989, "target": 1989, "value": 1.0000000000000002}, {"source": 1996, "target": 1996, "value": 0.9999999999999999}, {"source": 2003, "target": 2003, "value": 0.9999999999999998}, {"source": 2007, "target": 2007, "value": 1.0}, {"source": 2008, "target": 2008, "value": 1.0}, {"source": 2011, "target": 2011, "value": 1.0000000000000002}, {"source": 2012, "target": 2158, "value": 0.6037075533048725}, {"source": 2013, "target": 2013, "value": 0.9999999999999999}, {"source": 2017, "target": 2017, "value": 1.0000000000000002}, {"source": 2018, "target": 2018, "value": 1.0000000000000002}, {"source": 2019, "target": 2019, "value": 1.0}, {"source": 2024, "target": 2024, "value": 0.9999999999999998}, {"source": 2025, "target": 2025, "value": 1.0000000000000004}, {"source": 2035, "target": 2035, "value": 0.9999999999999998}, {"source": 2037, "target": 2037, "value": 1.0000000000000002}, {"source": 2038, "target": 2038, "value": 0.9999999999999999}, {"source": 2041, "target": 2041, "value": 0.9999999999999998}, {"source": 2041, "target": 2084, "value": 0.6431758808251546}, {"source": 2047, "target": 2047, "value": 0.9999999999999998}, {"source": 2053, "target": 2053, "value": 0.9999999999999998}, {"source": 2054, "target": 2054, "value": 0.9999999999999999}, {"source": 2055, "target": 2055, "value": 0.9999999999999998}, {"source": 2059, "target": 2059, "value": 0.9999999999999997}, {"source": 2062, "target": 2062, "value": 0.9999999999999998}, {"source": 2063, "target": 2063, "value": 0.9999999999999999}, {"source": 2064, "target": 2064, "value": 1.0}, {"source": 2067, "target": 2067, "value": 0.9999999999999998}, {"source": 2070, "target": 2070, "value": 1.0000000000000002}, {"source": 2080, "target": 2080, "value": 0.9999999999999998}, {"source": 2084, "target": 2084, "value": 0.9999999999999999}, {"source": 2085, "target": 2085, "value": 0.9999999999999999}, {"source": 2089, "target": 2089, "value": 0.9999999999999999}, {"source": 2090, "target": 2090, "value": 1.0}, {"source": 2093, "target": 2093, "value": 0.9999999999999999}, {"source": 2098, "target": 2098, "value": 1.0000000000000002}, {"source": 2099, "target": 2099, "value": 1.0}, {"source": 2100, "target": 2100, "value": 1.0000000000000002}, {"source": 2104, "target": 2104, "value": 1.0}, {"source": 2107, "target": 2107, "value": 0.9999999999999998}, {"source": 2109, "target": 2109, "value": 0.9999999999999999}, {"source": 2117, "target": 2117, "value": 1.0000000000000002}, {"source": 2121, "target": 2121, "value": 0.9999999999999998}, {"source": 2124, "target": 2124, "value": 1.0}, {"source": 2130, "target": 2130, "value": 1.0000000000000002}, {"source": 2131, "target": 2131, "value": 1.0}, {"source": 2132, "target": 2132, "value": 1.0}, {"source": 2136, "target": 2136, "value": 0.9999999999999999}, {"source": 2142, "target": 2142, "value": 1.0000000000000002}, {"source": 2144, "target": 2144, "value": 1.0000000000000002}, {"source": 2148, "target": 2148, "value": 1.0000000000000002}, {"source": 2149, "target": 2149, "value": 0.9999999999999997}, {"source": 2150, "target": 2150, "value": 0.9999999999999997}, {"source": 2153, "target": 2153, "value": 1.0}, {"source": 2158, "target": 2158, "value": 1.0}, {"source": 2163, "target": 2163, "value": 0.9999999999999996}, {"source": 2166, "target": 2166, "value": 1.0000000000000002}, {"source": 2172, "target": 2172, "value": 1.0}, {"source": 2175, "target": 2175, "value": 0.9999999999999999}, {"source": 2176, "target": 2176, "value": 1.0000000000000002}, {"source": 2179, "target": 2179, "value": 1.0000000000000002}, {"source": 2186, "target": 2186, "value": 1.0}, {"source": 2201, "target": 2201, "value": 1.0}, {"source": 2202, "target": 2202, "value": 1.0}, {"source": 2205, "target": 2205, "value": 1.0000000000000002}, {"source": 2208, "target": 2208, "value": 1.0}, {"source": 2222, "target": 2222, "value": 1.0}, {"source": 2230, "target": 2230, "value": 1.0000000000000002}, {"source": 2238, "target": 2238, "value": 1.0}]}