{"nodes": [{"id": 1, "value": "P3 Overview. Slides. Recording. . Euchre Rules. Q: I’ve never played Euchre before, how do I learn the rules of the game?. . A1: Spec: EECS 280 Euchre Rules. . A2: Slides: Welcome to Euchre Afternoon. . A3: YouTube: How to Play EECS 280 Euchre with Simple Players. . Q: How come the left bower was played when the led suit is trump? Why didn’t the left bower follow suit?. . The left bower is always considered the trump suit! Let’s say trump is hearts. That means the left bower is the jack of diamonds. If the led suit is diamonds, playing the jack of diamonds DOES NOT follow suit because the left bower is considered the trump suit (aka hearts). If the led suit is hearts, playing the jack of diamonds DOES follow suit because the left bower is considered the trump suit (aka hearts).. Card.cpp. Pack.cpp. Q: Why won’t pack.in open in pack public tests when running on Xcode?. . Click on the name of your scheme in the toolbar at the top left, Edit Scheme > Options > Enable “Custom Working Directory” and press the little folder icon. Pick the folder that contains your code along with pack.in. This will ensure that the file is visible to your executable. This is usually not a problem, and we are investigating the issue.. Player.cpp. Q: Can I add helper functions while implementing the Player classes?. . You are allowed to use helper functions, but these helper functions should not change the interface of the class. So within your implementations of the class’s member functions, feel free to call helpers. But in your test files, you should not assume that these functions exist (because you should not alter the interface for the classes). This also applies in your euchre driver as well! e.g. If you add a helper function to the simple player class, you can use it within that class, but you can’t use it in the driver since it won’t be part of the Player interface!. . This is especially important because when we run your test cases against an intentionally buggy solution, that solution will not have your specially defined helper functions! So just use the interfaces of each class when you test them.. . Q: Do I need to worry about the human player doing (insert illegal move) during the game?. . No, in accordance with the spec you can assume that a human player will follow the rules of the game and will not attempt to cheat.. . Q: Why am I getting a compiler error for calling sort?. . Note that the sort function modifies the hand. You cannot modify member variables in a const function, so you’ll receive a compiler error you call sort in a const member function.. . You shouldn’t need to sort using card less. When you print the hand in order it should be sorted using the < operator. You could sort with card less when determining what action to take, but you should be able to find the min/max card in the hand without sorting. You could use a functor to sort using card less, but those are only covered later in the course. Generally: if you need to use sort, just the default one will be fine.. . Q: I keep getting an error: “error: creating array of ‘Player’, which is an abstract class type\" or error: creating vector of ‘Player’, which is an abstract class type” or “Allocating an object of abstract class type Player” or “Allocating an object of abstract class to type Simple”…what does it mean?. . Player is an abstract class because it has at least one pure virtual function (see https://eecs280staff.github.io/notes/10_Polymorphism.html#abstract-classes-and-interfaces for a detailed description). You cannot create an object of an abstract class so you may not create a Player object. If you haven’t implemented all the player class functions in simple and human player, you also cannot create a simple or human player object because the simple and human classes inherit the pure virtual function.. . If you are getting the error on a line where you create a Simple or Human player, go back and ensure you coded each of the required functions. If you are getting the error on a line where you create a Player, think of another way to code the function. There are no instances where you should be creating a Player because none of it;s functions are implemented. Note: you are able to create a Player* that points to either a Simple or Human player. This is because you are not actually creating a Player object, you are actually creating a Simple or Human player object.. euchre.cpp. Q: Why am I passing euchre public test, but failing euchre public test with solution card, pack, and player?. . This means that when your euchre.cpp is run with the instructor solution implementations of card, pack, and player you produce incorrect output. This likely means that you’re making an incorrect assumption about what functionality should go in card/pack/player versus in the game of euchre. For example, make sure that you’re not printing output in player.cpp that should be printed in euchre.cpp.. "}, {"id": 3, "value": "A couple of questions with grading: . . 1. Is it possible to see autograder private test error messages? I had a few errors with my pack reset function in p3 and am unsure what I did wrong. . . 2. I submitted a regrade request for the midterm and heard back from it around 7 pm today but had another question, is it possible to ask what I did wrong again? (I understand that regrade requests are closed) . . uniqname is haasf "}, {"id": 4, "value": "Hello, I was wondering if there was any way to get any points back for the euchre project. We had mistakes in Card.cpp and Player.cpp therefore it was really hard to test euchre.cpp, however I think we wrote that file correctly other than one white space error (we outputted the hand number a line too high). Correct me if I'm wrong, but I believe the euchre tests with solution card, pack, and player are using working versions of these files and therefore are only testing euchre.cpp. We did not pass any of these tests (presumably because of the whitespace error) and we were wondering if there is anyway to get some of these points back as if that was the only mistake we made it was very insignificant. It seems unfair that such a small error would cause us to loose 18 points and make our grade significantly lower. I completely understand if there is no way to get points back but I thought I'd ask. Thank you so much!"}, {"id": 5, "value": "Hello EECS280 Instructors,. . After reading my private test results for project 3, I noticed that I failed euchre_test22 private test but passed euchre_test22 with solution Card, Pack, Player. Is this result expected or is this an error autograder presented? Thanks and have a good day!. . . "}, {"id": 9, "value": "Hello, . I had made a change to my project at the last second before submitting. It caused a compilation error, and I got a lower score than before. Would I be able to submit one more time as I still have one submission. If not could my previous submission be graded instead as it got a higher score than my last one."}, {"id": 14, "value": "what does this line :. .  *** [public.mk:123: style-check-prereqs] Error 1. . refer to in autograder (that is the error I get for the style checks)?  "}, {"id": 15, "value": "Can some one explain what this deep nesting error is telling me:. . oclint -no-analytics -rule=DeepNestedBlock -rc=NESTED_BLOCK_DEPTH=4 -max-priority-1 0 -max-priority-2 0 -max-priority-3 0 Card.cpp Pack.cpp Player.cpp euchre.cpp -- -xc++ --std=c++11. . OCLint Report. . Summary: TotalFiles=4 FilesWithViolations=1 P1=0 P2=0 P3=2. . /home/autograder/working_dir/Player.cpp:104:39: deep nested block [size|P3] Block depth of 5 exceeds limit of 4. . /home/autograder/working_dir/Player.cpp:175:61: deep nested block [size|P3] Block depth of 5 exceeds limit of 4. . [OCLint (http://oclint.org) v0.13]"}, {"id": 16, "value": "Can some one explain what this deep nesting error is telling me. . deepnesting.png"}, {"id": 17, "value": "I keep getting this error message at the top of my XCode and MacBook's terminal. What does mean? Should I be concerned? I am running Card.cpp, Pack.cpp, Player.cpp, euchre.cpp, and euchre_test00.out.correct. . XCode:. . . MacBook's Terminal:. "}, {"id": 18, "value": "Hi, I'm not sure when to print out the arguments that are passed into main. I don't know whether to print them in the first line of main or once all of my checks run, then if they all pass, print out the arguments. I'm just worried if one of the euchre_test on autograder fails one of the checks, it should print the arguments first, then the error message. Or just the error message. Thanks!"}, {"id": 27, "value": "For my deal function, I keep getting this error code that says exc_bad_access when trying to give a player a card. Google says its because i am accessing \"bad\" memory. What is bad memory and how do I fix it?"}, {"id": 31, "value": "1st pic is from int main . . 2nd pic is the constructor. . . 3rd pic is the error while debugging,  it says terminate called after throwing an instance of 'std::out_of_range'   what():  vector::_M_range_check: __n (which is 0) >= this->size() (which is 0). "}, {"id": 33, "value": "make: *** No rule to make target 'Pack-warning-check.s'. Stop. getting this error even though everything is passing in Pack. "}, {"id": 35, "value": "Getting this error when trying to make euchre.exe in Ubuntu.. . g++ --std=c++11 -Wall -Werror -pedantic -g -Wno-sign-compare -Wno-comment Card.cpp Pack.cpp Player.cpp euchre.cpp -o euchre.exemake: g++: No such file or directorymake: *** [Makefile:50: euchre.exe] Error 127. . Thanks"}, {"id": 36, "value": ". this is my header for the make_trump function. the error comes in player factory. . . every solution I have seen just says that there is probably a const missing but I don't see where I am missing a const. "}, {"id": 43, "value": "My player.cpp file is running and passing all test cases on CAEN but when I submit to the autograder I am getting all kinds of errors. I don't know what these are about my derived classes have override keywords and I don't get errors anywhere other than autograder. These errors are from the Player public test cases that pass on CAEN, XCODE, and my local terminal but just not autograder.  "}, {"id": 45, "value": "Hi, . I got the long functions error, and in the autograder it said \"euchre.cpp:227\" so I took that to be the function in euchre.cpp at line 227. After editing that particular function and submitting again, I still got the error, so I just counted the lines in all the functions in my euchre.cpp and fixed whichever functions were over 40 lines. But even after submitting to autograder again, I'm getting the same exact same error (with \"euchre.cpp:227\"). . . I'm not really sure how to proceed, so any help would be greatly appreciated! Thank you!. (My uniqname is divyabp)"}, {"id": 47, "value": "I am getting this error which my teammate is not getting and we are both using VS code.. . "}, {"id": 50, "value": "For some reason when I run the diff command my output gives me extra lines than what there is supposed to be (please see the right column on the image below). I have checked the .out file itself and there doesn't seem to be any extra lines there. I know some of my output values are wrong and I'm working on fixing them but this is returning as UB errors in autograder which highlights the extra lines when I click on it. Could someone please explain how to remove this?. "}, {"id": 52, "value": "Getting this error message and don't understand it: \"libc++abi: terminating with uncaught exception of type std::out_of_range: map::at:  key not foundzsh: abort      ./Player_tests.exe\". . . I should mention this error doesn't appear when debugging and the debug window runs through it smoothly.. . Also this is only happening when the test should be working properly, if I run it with a bad assert statement it runs through and just says a test fails."}, {"id": 64, "value": "When I try to use my default constructor to make an instance of a new game, it says my argument types are wrong and underlining my first parameter, even though I pass in a ifstream. I pass in a vector of player pointers for my second parameter and it's giving me this error:. argument types are: (std::__1::ifstream, std::__1::vector<Player *, std::__1::allocator<Player *>>, std::__1::string, int)"}, {"id": 76, "value": "I'm getting the following error on the Project 3 autograder, under \"Player public test\" and \"Student Player tests on student Player\":. . Is Pack.h necessary to include within Player.cpp, or can all of Player.cpp's functions be implemented without it (which is presumably why it doesn't exist in the autograder's project suite)?. . Thank you for your help."}, {"id": 83, "value": "I'm having a long function error with my int main, but it seems that my function is already below 40 spaces. Could anyone help me take a look at my code?. xinyaxu"}, {"id": 86, "value": "I am keep getting this architecture arm64 error. I looked up similar posts and tried all the suggestions listed there, but I am still getting this issue. I tried adding the cstring, making sure I included all the h files, and checking if my setup for each function is correct with same parameters and everything as the h file. I also went to OH, but they could not resolve this error.. . "}, {"id": 88, "value": "I'm getting a vector out of bounds error in Euchre and Player tests but I dont know how to fix it. I'm not entirely sure why I am getting this error and am not sure how to fix it.. . I've rechecked my code and I am not leaking any memory but I'm still getting an out of bounds errors. Please let me know if they any ways to fix it.. . . "}, {"id": 91, "value": "Hey,. . My uniquename is graceoj and when I run the makefile on my euchre.exe, I receive the error: . . terminate called after throwing an instance of 'std::logic_error'  what():  basic_string::_M_construct null not validAborted. . Based off this source and this source, I've concluded that I'm initializing a string with the incorrect data type. But by stepping through the 4th hand (via Autograder, my student output stops completely and doesn't print anything after the 3rd hand) I've yet to pinpoint the issue as the debugger still prints the correct output.. . My code is the exact same as submitted into autograder. "}, {"id": 94, "value": ". the error on the \"==\" is \"no operator \"==\" matches these operands\". Not sure why it is giving this."}, {"id": 95, "value": ". the get_suit error is: enum \"Suit\" has no member \"get_suit\". . i get this error on other functions as well, what am I doing wrong?"}, {"id": 97, "value": "For Pack Public tests, the test_pack_istream_ctor test works fine when I test it on my end, there are no errors and I pass all the tests fine. However, when it's on the autograder, it doesn't pass. I was wondering what the error could be and how the autograder would be different than what occurs locally for that test.. . . . "}, {"id": 100, "value": "Hello, I was running the tests on the euchre_test01. It gives me this sort of error for the pre-made function in Card.cpp. I wasn't sure what this means so I was hoping someone could help me out.. . Thanks."}, {"id": 104, "value": "Can someone explain why the autograder is giving me this error for my add_card functions for Human and simple player. and how to fix it?. . Player.cpp:28:13: error: ‘sort’ was not declared in this scope; did you mean ‘short’?"}, {"id": 106, "value": "Hi, now that autograder is back up, my code passes all tests except euchre_test50 with Solution. I heard that the issue with passing by myself but failing the solution is probably that I print something in player that is supposed to be printed in euchre, but I'm having trouble finding this. It hurts that the autograder does not tell me what part of the output is wrong since it uses solution code. . . Since it is test50, I know that it is an error with the HumanPlayer output (the other 2 use simpleplayer). In this class, my outputs are only to prompt the user for input in make_trump, add_and_discard, lead_card, play_card. Since I pass the same test but with only my code, I know that it is something that is just in the wrong place as the program outputs correctly by itself.. . if someone could share any common mistakes here or ideas on where I could have gone wrong. Thanks."}, {"id": 109, "value": "For test00 what is my whitespace error here? . I have something like cout << ... \"takes the trick << endl; then i have a seperate cout << \\n;"}, {"id": 113, "value": "Hi, I was wondering how I could go about fixing my deep nesting errors and the long function problems? I know where the problems are in euchre.cpp and player.cpp, but I was wondering if anyone could take a look at my code and provide some suggestions on how I can fix this, since I tried and was having trouble with it? Thanks"}, {"id": 123, "value": "I had to transfer all my files to a diff laptop because the gpu died, but now when I run vscode I get an error when I do #include <iostream> and any other library or header files. Not sure what to do. "}, {"id": 127, "value": "I am noticing a whitespace error when I run test 00 but the whitespace when running test 01 and 50 are consistent with the solution. I am wondering if autograder will register this as an error or not."}, {"id": 133, "value": "Hi, . It is unclear to me via the spec how exactly to handle erroneous input, since there are no direct examples. When we get erroneous input or a file that can't be opened, should we still be printing back the executable beforehand, or no? Attached is an example of what I mean. Right now, we are printing the executable before we check for the input file error (but after the other input errors). Thanks! "}, {"id": 135, "value": "Hi! I have been hitting a wall so far where my shuffle works (when I shuffle it 20 times it goes back). My deal makes sense where it deals 3,2,3,2... etc. And for some reason I am one card off for a player. All of the other cards in the player's hands are right but one. I don't use add_and_discard and I don't know a possible error would be. Could someone potentially tell me what I'm doing wrong?"}, {"id": 137, "value": ". Hello instructors, . . I've debugged my code to pass Euchre00, (yay!), but now, I'm running into massive errors on diffchecker. By comparing, I've come to the conclusion that due to the upcard being incorrect on the first instance of the run, the code for shuffle() is incorrect. . . Hypothesis(s):. - Issue dealing with where I'm accessing both vector card halves . - Issue w/ how the variables created for incrementing through the vectors is correct. . Possible Solutions:. - Stuck.... "}, {"id": 141, "value": ". Hello, . . I slept on my computer last night and I woke up to these errors within this file. I don't know what to do as I've tried to Ctrl+Z but it is not doing anything.... . "}, {"id": 142, "value": "Hi, currently I am trying to debug my euchre.cpp code and it's just infinitely loading (meaning the I can't step through because the variables - local have a loading circle on them) when I click the debug button. I have setup address sanitizers and used it to debug my other .cpp files. It did the infinite load to me during player.cpp but after my pc crashes after a popup saying too much memory is being used, it worked fine again. It did it to me a couple other times but I got through it. I'm having the issue again and I set my breakpoint right at the beginning of main so there should be zero memory leaks (and even if there was, it would kick me out of the debugger and tell me the error). It's still infinitely loading and I have no idea why. Any help is greatly appreciated!This is what my launch.json looks like too:"}, {"id": 149, "value": "Hi, I have checked for all the errors and it reads it in alright, I just cannot seem to figure out how to read in the player names so that Player_factory creates them. I do not know what to do with the player objects after creating them in main. I was also wondering if you guys could look at my code for reading in the filename too! I soloed the project and I took a break since we got an extension, but I am so close to finishing it and I really want to be able to debug my actual code. . this is in my main:. . . . this is in my Game class:. "}, {"id": 153, "value": "Hi, my partner and I were trying to fix our code, and we are unsure as to why Gabriel could be passing and not ordering up diamonds. Hand 0 and Hand 1 has no errors for us, and after Hand 2, nothing is really being printed for our output. Hand 2 also is really buggy. Also, does anyone know what this address sanitizer error means as well? I attached the screenshots below. Thanks!. Screen_Shot_2023-02-28_at_12.23.22_AM.png. Screen_Shot_2023-02-28_at_12.23.54_AM.png. Screen_Shot_2023-02-28_at_12.24.06_AM.png. . We figured out that in Hand 2 the problem was with our make trump function a few hours after we made the post, however from hand 3 onwards, our code is printing nothing, which is what we're confused about. "}, {"id": 165, "value": "Hi, my partner and I have been looking through our pack, card, player, and euchre files to figure out why we're getting the wrong card in the hand of Edsger, who is the dealer for hand 0. Every other card is outputting correctly for every other player for hand 0, however Edsger's card is wrong. I was wondering if anyone can take a look at our files and help us figure out why this might be happening. We believe that the error resides in our shuffle function in pack. Thanks! . Screen_Shot_2023-02-27_at_6.06.10_PM.png. . "}, {"id": 167, "value": "Hi, I got a segmentation error when trying to run the sample test given, so I used GDB to try and find the error. Below is the error and the line from card.cpp where it says the error occurred. I don't understand why this is an error since it is just return the suit.. . "}, {"id": 172, "value": ". I am receiving an error in the declaration of my ifstream variable infile yet I do not believe I should be, the code is as follows.... . . //Project UID 1d9f47bfc76643019cfbf037641defe1. . #include \"Player.cpp\". #include \"Card.cpp\". #include \"Pack.cpp\". #include <iostream>. #include <cstdlib>. #include <fstream>. #include <array>. . using namespace std;. . int main(int argc, char *argv[]){.     string fileName = argv[1], mix_or_not = argv[2];.     string player0Name = argv[4], player1Name = argv[6], player2Name = argv[8], player3Name = argv[10];.     string player0Type = argv[5], player1Type = argv[7], player2Type = argv[9], player3Type = argv[11];.     int winningPoints = atoi(argv[3]);. .     if((mix_or_not != \"shuffle\" || mix_or_not != \"noshuffle\") || winningPoints < 1 || winningPoints > 100.     || (player0Type != \"Simple\" || player0Type != \"Human\") || (player1Type != \"Simple\" || player1Type != \"Human\").     || (player2Type != \"Simple\" || player2Type != \"Human\") || (player3Type != \"Simple\" || player3Type != \"Human\")){.         cout << \"Usage: euchre.exe PACK_FILENAME [shuffle|noshuffle] POINTS_TO_WIN NAME1 TYPE1 NAME2 TYPE2 NAME3 TYPE3 NAME4 TYPE4\" << endl;.         return 0;.     }. .     ifstream infile;.     infile.open(fileName);.     if(!infile.open()){.         cout << \"Error opening \" << fileName << endl;.     }.     Pack deck_of_cards(&infile);. .     return 0;. }. "}, {"id": 175, "value": "I received the following error message for my Euchre public tests: \"Error opening noshuffle.\" I inputted the arguments in the order shown below (./euchre.exe being argv[1], pack.in being argv[2], noshuffle being argv[3], and so on...), but it thinks that I am trying to open noshuffle as an input file. Would any instructor be able to look at my code?. "}, {"id": 177, "value": "I am having these errors I don't know how to not make it defined again and if I were to remove the \"class Player\" it says another error about the fact there are virtual functions. Also, I am getting these weird errors because it is not reading right from the unit_test_framework and I have not made any changes to that particular file, so there shouldn't be any errors.. . "}, {"id": 182, "value": "Hi, I ran into an error when testing my euchre_test01 test. While debugging, I figured out the edge case that I was not catching in euchre.cpp. When the card is ordered up in make trump and it is round 1, then the dealer should be able to add and discard the upcard. Knowing that this is the solution, I put this into euchre.cpp, but when I was trying to step through it, I was unable to do so. . Here is a specific picture of what line this is happening on, and where it is going wrong in my euchre_test01. Thanks. . Screen_Shot_2023-02-26_at_7.25.35_PM.png. Screen_Shot_2023-02-26_at_7.25.49_PM.png. euchre.cpp"}, {"id": 187, "value": "I can't access the autograder, no matter what browser I use, but I'm able to access other websites just fine (so I don't think it's a network error). Is anyone else having this issue?. . "}, {"id": 190, "value": "I am getting an error in euchre.cpp that i don't know how to debug. i tried debugging it many times but im still not getting the correct answer. it seems that the program is running an extra loop in make_trump but i dont know why that is happening. My uniqname is nsanchet and any help with the code would be really appreciated. . This is the error that i'm getting and have no idea how to resolve it.. "}, {"id": 197, "value": "I am getting this error in the autograder. Is there any way I can fix it? It won't let me submit. . . Thank you!"}, {"id": 198, "value": "Card.h is in the correct dictionary. Why isn't Card recognized as a type in my Game? This is the only thing that's erroring in my code atm. Uniquename is finnward "}, {"id": 199, "value": ". class Game {. . private:. vector<Player *> players;. Pack deck;. Card upcard;. . . Card upward is erroring with variable \"Card\" is not type name. . I have card.h included at the top, why is this happening?"}, {"id": 203, "value": "On my own computer, my euchre code compiles and runs without issue, but the auto grader is giving my errors that don't make any sense as my compiler isn't having any issue.. . In file included from Player.cpp:2:. Player.h:21:31: note: ‘virtual const string& Player::get_name() const’. 21 | virtual const std::string & get_name() const = 0;. |. ^~~~~~~~. cc1plus: all warnings being treated as errors. make: *** [public.mk:75: Player-warning-check.s] Error 1. . This is the last line of the error message that I received, and it honestly makes no sense to me. Any help would be appreciated because all of my code for the euchre game is finished and I just need to fix this one issue with the autograder."}, {"id": 205, "value": "Trying to make Card upward and getting error that Card is not a type? How should I fix?"}, {"id": 209, "value": "is this what I am supposed to put into the debugger in order to step into my functions? This currently errors when I attempt to run debugger"}, {"id": 210, "value": "Currently have a SIGABRT error message? I'm unsure as to what this means."}, {"id": 214, "value": "Hello, I've been debugging the human example with the s diff command but now it is no longer working. Could you tell be what this error means?Screen_Shot_2023-02-24_at_9.08.21_AM. . Sometimes my images don't work but the error says. . \"Usage: euchre.exe PACK_FILENAME [shuffle|noshuffle] POINTS_TO_WIN NAME1 TYPE1 NAME2 TYPE2 NAME3 TYPE3 NAME4 TYPE4~~~~~~~~~~(END)\""}, {"id": 216, "value": "I don't get the error message when I use the diff command here. Both files end with the same amount of lines and there is no other output difference.. "}, {"id": 217, "value": "Hi, after implementing euchre.cpp I tried to run it in the terminal, but I got this weird error. What is a \"new-expression\"? Why are the Player functions being treated as virtual ones?. "}, {"id": 224, "value": "While running the test, I got an error in who is supposed to take the lead, which of course ruins everything else. However, it seems like the code is running how it is supposed to, according to the game logic.. . . Any input on what I might be missing would be appreciated.. My coded output is on the left, while the correct output is on the right. . NEVERMIND: I have made a misread of the situation!"}, {"id": 225, "value": "The error I am getting is that the hands of the players in Hand 1 are incorrect. I have tested to make sure that this is the correct issue. I printed the content of the pack after it was shuffled and manually dealt the cards to the players to see what the exact issue was. The cards in the pack after the shuffle was not in the correct order. I am not sure why the pack after shuffling would be wrong, since the shuffle worked correctly for the first hand. I have been trying to figure out this issue but I cannot seem to find the answer."}, {"id": 231, "value": "I'm not sure how to print out the commands we run at the terminal at the very beginning. I tried cout << argv << endl; but that doesn't print anything. I also considered using a for loop and istream. ifstream ins(argv) led to an error. Is it possible to convert it to a string without having to print each string individually?"}, {"id": 235, "value": "all of a sudden our euchre.cpp file is not compiling on the autograder but compiles on my computer. I just spend awhile setting up CAEN on my computer and running it on there and it even compiled on there so I have no clue why it won't compile on the autograder.. . The autograder gave this error: make: *** No rule to make target 'euchre-warning-check.s'. Stop."}, {"id": 240, "value": "I pass all the public tests for euchre.cpp but when I have undefined behavior when I submit to the autograder. It says I have no output but when I compare my out files to the ones that are correct it is correct. Is there any common causes for this error? Is this something wrong with the args in the launch.json?"}, {"id": 244, "value": "inputted command \"make test\" and ran into this error, can someone help with what this error is?. "}, {"id": 246, "value": "This question is the biggest stump I've have. (may be a bit long, please forgive me). . - Would we have to derive two instances of the game driver to account how the game will run if we have simple players and how the game will run if we have human players?. . - If so, or somewhat along those lines, should we pass in a parameter that indicates that all players are either human or player? My point in doing this is to pass in their argument so then I can hard-code in my implementation: . - Ex: If argument given to function is \"Human\", execute only printing who won the trick and not the other players and what card they play like Player does. . . - To distinguish which functions from Player.cpp need to be called, would we also utilize putting (Human::) or (Player::) by the functions we need to indicate to the compiler which ones to use?. . Mini-Question: I basically created a .h file with RME's to help GSI/Professors/Peers understand my code and how my functions work/their sole purpose. Would this run into any error since I've created it for my driver?"}, {"id": 247, "value": "I am trying to initialize my player* vectors using this logic:. . players[i].push_back(Player_factory(name,strategy));. however, my error reads:. . . . . std::__1::vector<Player *> Game::players. . . . . . expression must have class type but it has type \"Player *\"C/C++(153). . Why does this strategy not work?. . "}, {"id": 255, "value": "Right now when I submit my code to the autograder the private tests for euchre are the only ones that even show up even blurred out  For my earlier tests before the autograder broke I was seeing all the private tesrs even blurred out. My input is still out of 69. Is anyone else getting this error? What should I do? "}, {"id": 273, "value": "I don't know why I get this error. What should I add here? . . "}, {"id": 276, "value": "Hi! . I am passing both simple player tests, but am failing test50 with the human players. It seems that my cards are being dealt incorrectly. I thought I was using the correct method to deal the cards, as my output follows the 3-2-3-2 then 2-3-2-3 pattern. I am not quite sure what is going wrong, it could be that I am using reset() incorrectly. I attached a screenshot of the first hand of my output below. I would be really grateful for any guidance or advice on how to fix this error. Thank you !! . . "}, {"id": 279, "value": "I was fixing up my simple player lead function, but when trying to run it I got all of these error, I've never got these error can some explain what could be the reasoning behind it?. . . Screen_Shot_2023-02-22_at_8.41.20_PM.png"}, {"id": 283, "value": ". So I don't know why I am getting this error but I can't seem to find the bug of it either. Also I'm not sure if I am supposed to modify my functions in euchre to corresponds to each of the player's types. Any tips would be greatly appreciated."}, {"id": 284, "value": "Hello staff & instructors, so I'm getting a segmentation fault when trying to access players[0] in my Game class constructor and I'm not exactly sure why. I also get the same error when I try using push_back() instead. Could anyone help guide me in the right direction here? See snippet of error below:"}, {"id": 287, "value": "Is the AG down again for y'all or is it just me? Because it's taking a while to load and then state the error, so my connection might just be bad."}, {"id": 292, "value": "Getting a negative size parameter error, but reading through the sanitizer, I am confused as to why. # 7 is where I assume the problem is, but that line is just one variable trump, which is type suit.. "}, {"id": 294, "value": "We ran the euchre_test50 and received this error: \"terminating with uncaught exception of type std::out_of_range: vector error\". We believe that because of this error, it causes errors in the players' hands after the first player (the image attached is our output for your reference). . . It looks like one of our vectors is going out of bounds, but we can't find where it's coming from. Can someone take a look at my code please? . . Our uniqname are danng & swarida.. . Thanks! . "}, {"id": 295, "value": "We currently have an error: \"libc++abi: terminating with uncaught exception of type std::out_of_range: vector\" and we want to try using the debugger to check this error. Could someone explain how to use the debugger for Human Player test case please? Thanks! "}, {"id": 297, "value": "I am getting this error when testing. All tests are working but it is still aborting. Is this going to be a problem for my code?. Here is the screenshot:. "}, {"id": 299, "value": "Hello, . I am trying to run by debugger and am getting this error. Screenshot_2023-02-22_at_5.22.56_PM.pngScreenshot_2023-02-22_at_5.23.09_PM.png, ive attached screen shots of both the error and my launch.json file. "}, {"id": 309, "value": "When running my code, I am getting the error below. Why is this such? Any suggestions on how to fix this?. . . . "}, {"id": 313, "value": "Hi! I ran the address sanitizer but don't understand the error I got.. "}, {"id": 315, "value": "Screen_Shot_2023-02-22_at_3.11.02_PM. . Here is a screenshot of one of my euchre helper functions. I talked to a IA and we relized that my functions werent working because they were operating on copies instead of the actual member variables. I've tried to adapt my functions to take in pointers but I keep getting errors and I'm not sure how to fix it. Dereferencing them doesn't seem to work. What should I do?"}, {"id": 318, "value": "Hi, my group has attempted to submit to the autograder the past three days, and every single time we have been unable to submit and have been running into errors. We are unaware of what to do at this point, as we've been trying to consistently work on the project to finish before the deadline but now we are at a point where our only place to go to check our results would be the autograder. When we do try to submit, it does not work but it still says we have used one of our daily submits, essentially wasting multiples submits a day.. . "}, {"id": 320, "value": "Hi!. . I'm having some trouble with my euchre.cpp not compiling on Autograder, but running with the correct outputs on VS Code with euchre_test00 and euchre_test05. I saw a recommendation to run the sanitizer. However I don't understand the errors I'm getting if I could please get some help?. . Undefined symbols for architecture arm64:  \"Player_factory(std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> > const&, std::__1::basic_string<char, std::__1::char_traits<char>, std::__1::allocator<char> > const&)\", referenced from:      _main in euchre-7c34bb.o  \"Card_less(Card const&, Card const&, Card const&, Suit)\", referenced from:      Game::play() in euchre-7c34bb.o  \"Pack::reset()\", referenced from:      Game::play() in euchre-7c34bb.o  \"Pack::shuffle()\", referenced from:      Game::play() in euchre-7c34bb.o  \"Pack::deal_one()\", referenced from:      Game::play() in euchre-7c34bb.o      Game::deal(Pack, int) in euchre-7c34bb.o  \"Pack::Pack(std::__1::basic_istream<char, std::__1::char_traits<char> >&)\", referenced from:      _main in euchre-7c34bb.o  \"Pack::Pack()\", referenced from:      Game::Game(Pack, std::__1::vector<Player*, std::__1::allocator<Player*> >, int, bool) in euchre-7c34bb.o  \"operator<<(std::__1::basic_ostream<char, std::__1::char_traits<char> >&, Suit)\", referenced from:      Game::make_trump(Player*, Card, int, bool, Suit) in euchre-7c34bb.o  \"operator<<(std::__1::basic_ostream<char, std::__1::char_traits<char> >&, Card const&)\", referenced from:      Game::play() in euchre-7c34bb.o      Game::play_hand(Player*, Card, Suit) in euchre-7c34bb.old: symbol(s) not found for architecture arm64clang: error: linker command failed with exit code 1 (use -v to see invocation). . I fixed my call to Player_factory() so now it now is called with two strings, but it's still giving me the same error. Is there a way to fix this problem?"}, {"id": 324, "value": "My game constructor has one parameter that is a vector of string objects that will be read from argv. However, I also have private member variables like ledCard and upCard that are initialized privately. I keep getting an error that tells me to define these variables in my Game constructor. When I do this I get an error that says my constructor still \"provides no initializer\"."}, {"id": 326, "value": "I keep getting this error once I input ./euchre.exe pack.in noshuffle 1 Adi Simple Barbara Simple Chi-Chih Simple Dabbala Simple into the command line.. . . . Any solution? My uniqname is taitelee and we have a submission to the autograder already.. "}, {"id": 330, "value": "I got errors on a random algorithm file that is not included in my files under p3-euchre. I have no idea what this file is - can i just delete it? could relate to @2195 my post earlier about not being able to run player public tests. . . "}, {"id": 331, "value": "on autograder, im failing all of the visible euchre private tests because i get a \"fail to read pack.in\" error and it credits string_to_rank()'s assert false statement (screenshot below). the only issue is that i'll run the same command line stub locally and it works perfectly fine. can anyone provide feedback on this?. uniqname: johannt"}, {"id": 337, "value": ". ==164==ERROR: AddressSanitizer: heap-use-after-free on address 0x6080000004a0 at pc 0x555f4b773132 bp 0x7ffd95c28660 sp 0x7ffd95c28650. READ of size 8 at 0x6080000004a0 thread T0. The above is the only error notice for my player test file, any one can offer any hints here? I have no ideas what is wrong here."}, {"id": 338, "value": "I had an error with the up card for euchre_01 in hand0 with it being \"Jack of Diamonds\" instead of \"9 of hearts\". I've zoned in on my mistake occurring in the shuffle() function in pack but I'm still not sure where it is. I've attached my play() function, shuffle() function, and the output down below. Thanks for the help! . . . "}, {"id": 340, "value": "umID: lrsierra. Hi so for my constructor to make the game I am getting an error saying that. . . . . Player *Player0. . . . . . no instance of constructor \"Game::Game\" matches the argument listC/C++(289). euchre.cpp(153, 18): argument types are: (Player *, Player *, Player *, Player *, int, bool, Pack). however, I thought it might be the player initializations but when I switch the order of how I take in things with the parameters it is still only the first on which shows this error. I'm not sure whats wrong tho.. . . . "}, {"id": 341, "value": "Hi,. . I'm getting a really weird error while running my make_trump function in the driver file. I have a vector of the players, and I loop through, calling make_trump (from the player file) on each of them. However, the make_trump function doesn't seem to be called for the fourth player. The index of the player doesn't matter, just whenever make_trump (from the player file) is called for the fourth time, it won't work and gives me an address sanitizer error. Does anyone know what may be wrong? If you need clarification on the question, let me know. "}, {"id": 344, "value": "So, I was trying to set a player by : . . p = *players[newIndex[i]];. . Just to be clear, p is a passed by reference player object in my function. The compiler gave me no error but when I was debugging it, I saw that p stayed as the original value it was set to. I would like some clarification on how to properly set one player to another. "}, {"id": 346, "value": "We need help understanding the error messages compiling Player.cpp. We aren't sure if this is a technical formatting issue or just an issue in implementing one of our function or even Player Factory.. . . "}, {"id": 348, "value": "I'm not sure what errors are occurring with my Player.cpp because it is not giving specific compiler errors but it is saying have undefined references?? And when I attempt to run it, it say no such file exists. . "}, {"id": 349, "value": "I cannot seem to test my player.cpp at all on terminal and i am worried. can someone please tell me what is wrong with what i did. i do not think it has to do with my code since i cannot even make the test correct? this is the end and the start of the huge error i get when i run \"make player_public_test.exe\" on my terminal:. . "}, {"id": 350, "value": "In my Game class function in euchre.cpp, I have a function that runs through the trump making phase. after the trump is chosen and the terminal correctly displays ____ orders up ____ << endl << endl; I get a bus error. The next line after the order up cout function is a cout << \"check\"; that I put in for testing purposes. However, after completely and correctly printing out the first line including the two endlines, it doesn't print the \"check\" and I get a bus error. From what I read online, bus errors can happen from endlines, but when I tried removing the endl from the first line, I don't even print it and I just get a bus error one line earlier. Changing the endl to \\n doesn't work either. All the logic I used is relatively trivial, and my partner and I have already ran test cases on Player::make_trump and the other necessary functions. I just don't understand where the error is coming from."}, {"id": 351, "value": "Hi! I am coding my euchre.cpp for my human player and running into a segmentation fault error in the print hand function. I have tried printing out my hand size, which is printing five, however I am still getting a segmentation fault at hand[3]. Can anyone possibly look at our code and see if there is an obvious issue. Thank you!"}, {"id": 352, "value": "So I ran my Pack_public_test.exe and it gave me a segmentation error. However, when my partner ran it, it never came up for him and it was fine with no errors. Our code is exactly the same, however I use VS Code on Mac and he uses Visual Studio on Windows. What do you suppose could be the issue? "}, {"id": 358, "value": "I'm getting these errors.. . . What should I look out for?"}, {"id": 359, "value": "I am wondering if each card in a human player's hand has a permanent index, or if that index changes based on previously played cards. In the second hand of euchre_test50.in, Kunle first plays the Ten of Clubs (index 3), and then the card at index 4. Theoretically, after they play the Ten of Clubs, there should no longer be an index 4 (the size of their hand is now 4, max index = 3). Is the card at index 4 supposed to retain its original index, or is there an error in the input file?"}, {"id": 360, "value": "When I run my code, it keeps saying I have a segmentation fault. Is there a way I can find out which line of code specifically leads to this error?"}, {"id": 364, "value": "I'm still having problems with the autograder. I tried to make a submission today but it won't show me my results. It just loads for about 20 minutes and then I get this error. Is there any way to fix this?. "}, {"id": 368, "value": "Hello, I am attempting to test my euchre.cpp file with the command line, and am recieving this error message in the terminal: . . When I try to debug it, and I try to step over the part where I assign the name of the pack to argv[2], this happens:. . . Could someone please help explain what to do next? "}, {"id": 372, "value": "When I try setting a string file_name to argv[1], it immediately gives me a segmentation fault. Is this due to an error in earlier code such as the constructor? Or is it something else? Thank you."}, {"id": 373, "value": "I'm getting this error when attempting to run my game constructor:. \"std::basic_istream<_CharT, _Traits>::basic_istream() [with _CharT=char, _Traits=std::char_traits<char>]\" (declared at line 606 of \"/usr/include/c++/9/istream\") is inaccessible. . Has anyone else gotten this? Does anyone know what this means, or how to fix it?"}, {"id": 377, "value": "We ran the euchre_test01 and we had an error that one player's last card in his hand does not match the correct card. Specifically, it's supposed to be \"K of Diamonds\", but for our output, it's \"Q of Hearts\". . . We have tried to debug the deal() and shuffle(). For deal() function, we believe it's correct so we guess that there's something wrong with our shuffle() function. However, we wonder how could we debug this function to see what's really going on because even when we print out the cards, we still cannot see what the function did to shuffle the pack. . . Here's our code for your reference, thank you so much! . "}, {"id": 378, "value": "int main(int argc, const char * argv[]) {.     if (argc != 12) {.         error_print();.         return 1;.     } else if (atoi(argv[3]) < 1 || atoi(argv[3]) > 100) {.         error_print();.         return 1;.     } else if ((string)argv[2] != \"shuffle\" || strcmp(argv[2], \"noshuffle\")) {.         cout <<(string)argv[2];.         error_print();.         return 1;.     } else if ((string)argv[5] != \"Simple\" || (string)argv[5] != \"Human\") {.         error_print();.         return 1;.     } else if ((string)argv[7] != \"Simple\" || (string)argv[7] != \"Human\") {.         error_print();.         return 1;.     } else if ((string)argv[9] != \"Simple\" || (string)argv[9] != \"Human\") {.         error_print();.         return 1;.     } else if ((string)argv[11] != \"Simple\" || (string)argv[11] != \"Human\") {.         error_print();.         return 1;.     }. . "}, {"id": 381, "value": "When I run Player.cpp I'm getting some compiler errors and I've fixed some of them but I'm having trouble making sense of some of the others. I'm wondering if anyone is able to tell based on these screenshots what these errors are indicating?. . . . . . . . . . "}, {"id": 382, "value": "If a simple player has two cards of equal rank and both off suit, which should they play? I have an error in hand 4 of euchre test 01, as in my code Herb leads with the Ace of Spades instead of the Ace of Hearts (diamonds is trump). I assume I'll have to change a < operator to <= in Card_less. . edit: hand 4 not 5"}, {"id": 383, "value": "I cout the texts that check error in main, but i don't know how to test them. I try delete the last type of player in my command line and delete it in json file but it just doesn't compile then. How could we test it? Or it would not be covered in private tests?"}, {"id": 387, "value": "I keep getting this error today and the endless grey dots circle when I open autograder. . . "}, {"id": 391, "value": "I am getting the following error in the terminal when running the public euchre.exe test:Assertion failed: (false), function string_to_rank, file Card.cpp, line 35.. . The line mentioned in the abort message to is from the string_to_rank provided as part of the starter code:. . 34   .... 35   assert(false); // Input string didn't match any rank. . I assume this means I am incorrectly constructing a pack? In my pack constructor I used the operator \">>\". Any ideas?"}, {"id": 392, "value": "All the functions in Player is virtual, and all the functions in SimplePlayer has been implemented. The players.at(1) works fine, although I am not sure if it has been downcasted or not. If not, how to fix it? Pic 1 is a bunch of codes with the terminal that reports the error of segmentation fault at the bottom, Pic2 is the pic of my code for making players.(FYI I players.size() is 4. . . . "}, {"id": 397, "value": "So I have read the instructions on how to play and I think that there is something wrong in the output correct of this test because of this rule.. . And this, in Simple Player instructions.. . The error that I see is that Gabriel is not supposed to play the nine of clubs but instead the Jack of Diamonds because Edsgar played the King of Diamonds. So by these rules of following the suit and that the trump is the hearts, then therefore Gabriel would win this trick because he had to follow suit.. . This one is mine : (below). "}, {"id": 399, "value": "All the functions in Player is virtual, and all the functions in SimplePlayer has been implemented. The players.at(1) works fine, although I am not sure if it has been downcasted or not. If not, how to fix it? Pic 1 is a bunch of codes with the terminal that reports the error of segmentation fault at the bottom, Pic2 is the pic of my code for making players.(FYI I players.size() is 4. . "}, {"id": 404, "value": ". I'm getting the \"long function\" error for one of the code blocks that was written by the instructor. Card.cpp:12:1. It says I have 43 lines of code in a function, but its not even a function thereI have yet to see anyone else with this problem (I was the one who left this as a follow-up comment on a post 2 days ago):. Here's a screen shot from my last autograder submission. I know I have a different long function to figure out and thats in the screen shot as well.. . Maybe the first one will solve itself once I solve the other one, but I'm not sure yet. Anyone else have this problem and know what to do?. . . "}, {"id": 405, "value": "As of now, with the Game declaration in the main file, I have an error stating that the ifstream does not work and says the function has been deleted. Thank you!. . "}, {"id": 409, "value": "I'm getting this error in my Card.cpp file from constexpr. How should I fix it? "}, {"id": 411, "value": "Similarly to question @2100, I am receiving this error when attempting to debug the code.  I've tried to step into instead of over the assignment, but regardless end up with the same error in the same location.  Does anybody know what I might be doing incorrectly/what might be done to fix this issue?. . "}, {"id": 416, "value": "We failed the code duplication on AG because our codes for both card_less functions have pretty similar implementations at the beginning of each function. Do we have to call the first card_less function inside the second one to avoid this error? Can we create a private function helper to replace the similar code in both of the functions? "}, {"id": 421, "value": "Everything in my driver is implemented but game.play(); is giving me an error underlining game.. . It says: expression must have class type but it has type \"Game ( * ) (//all of my arguments in my constructor)\". . Any ideas? "}, {"id": 427, "value": "I tried to compile my code on CAEN, and I got these comparison error. Why can't we compare int i and hand.size()? It works on autograder but not CAEN. Should I use size_t instead of int for every for loop? How can I cast a size_type to an int?. . "}, {"id": 430, "value": "This error keeps showing up when I'm trying to use the debugger for Euchre.cpp. this won't let me continue debugging either. Has this happened to anyone else? The error takes place in a file called __string. . . "}, {"id": 431, "value": "After running my player_tests file in the autograder and using an address sanitizer, I keep receiving an undefined behavior error. I was hoping for some help. Thanks! . . . "}, {"id": 432, "value": "I used the sdiff to compare my output (right) to the correct output (left) in euchre_test01.out.correct. There are two extra empty lines after \"Herb passes\" in Hand10. However, there are not supposed to have two empty lines there when I just read the euchre_test01.out.correct. The empty lines give me some extra errors.. . This is what I got from using sdiff to compare output:. . . This is the screenshot when I just pull up the euchre_test01.out.correct:. "}, {"id": 434, "value": "I am getting an error on my UB checks for the Pack.cpp public tests. However, when I run my pack public tests (with address sanitizers on) through my terminal everything passes just fine.. . "}, {"id": 444, "value": "I am having some trouble understanding why I am getting this error. It says that it is because of a nested loop on line 188 but I am confused because there is no loop there. My unique name is mgoodma and I’d love some help"}, {"id": 448, "value": "I am getting a false positive error on the autograder for my play_card function. My code plays the lowest trump card if the entire hand is trump cards, although the spec says to play the lowest card in the hand if there are none of the led suit. When the hand only has trump cards, should I play the highest or the lowest card?"}, {"id": 454, "value": ". So I am getting this error where there are no spaces between the arguments in the output.  All I have done is this. . in the debugging but I'm not sure what else to do. . Any help would be greatly appreciated! Thanks!. . Also I use Visual Studio."}, {"id": 459, "value": "I went to office hours and they told me I had to edit my arguments in my scheme. I added. euchre.exe pack.in noshuffle 1 Adi Simple Barbara Simple Chi-Chih Simple Dabbala Simple to my argument which he told me to do, but it still gets the same error.. "}, {"id": 462, "value": "For my Player_Factory I am having trouble with allocating. . . I get the error \"Allocating an object of abstract class type 'SimplePlayer'\" but I do not get one for HumanPlayer.. . I have checked quite a few times that all the functions are implemented the same as shown in player.h.. . Could there be something else I am missing?"}, {"id": 463, "value": ". . Here's the error I get. Any help would be greatly appreciated."}, {"id": 464, "value": "pack.in is in the same folder, the error() is not called, . "}, {"id": 466, "value": "I'm receiving a code duplication error from my two separate classes within player.cpp. I defined each of the header files twice in the public sections of the separate classes. I was told by a TA that this should not produce an error. What should I do to fix it?. Thank you so much!. "}, {"id": 474, "value": "When I run Card.cpp, Pack.cpp, and Pack_public_test.cpp, I get an error message in my XCode terminal but not in my MacBook's Terminal.. . The error message reads as follows:. Assertion failed: (ifs.is_open()), function test_pack_istream_ctor, file Pack_public_test.cpp, line 25. . . . and line 25 in Pack_public_test.cpp is the following:. assert(ifs.is_open());. the error message there (in red) is the following:. Thread 1: hit program assert. . . However, my MacBook's Terminal is saying 0 failures, 0 errors. What is the problem or should I not worry about it since I have 0 failures and 0 errors in my MacBook's Terminal?. . My MacBook's Terminal:. . . "}, {"id": 479, "value": "/usr/include/c++/11/array:188: std::array<_Tp, _Nm>::value_type& std::array<_Tp, _Nm>::operator[](std::array<_Tp, _Nm>::size_type) [with _Tp = Card; long unsigned int _Nm = 24; std::array<_Tp, _Nm>::reference = Card&; std::array<_Tp, _Nm>::size_type = long unsigned int]: Assertion '__n < this->size()' failed.Aborted. . How would I approach resolving this error?"}, {"id": 480, "value": "Hi,. . I get the same UB error for all three test cases about a vector out of bounds. But, the output is completely correct for the public tests. I have attached a screenshot of the error. Please provide some insight.. . Thanks.. Screenshot_(232).png"}, {"id": 481, "value": "I don't know how to fix the code duplication error.  Can anyone take a look at my code please?. "}, {"id": 486, "value": "I submitted my euchre.cpp at around 9am this morning but it shows my player.cpp didn't even run. I'm sure I did't change anything in simple player this weekend. Can someone check my autograder?. . Edit: I didn't #include <algorithm> in last submission too but it didn't give me any error so I'm not sure if it's because of that.. . The error is:. Player.cpp: In member function ‘virtual void Human::add_and_discard(const Card&)’:2Player.cpp:261:10: error: ‘sort’ is not a member of ‘std’; did you mean ‘qsort’?3261 | std::sort(hand.begin(), hand.end());4| ^~~~5| qsort6Player.cpp:270:10: error: ‘sort’ is not a member of ‘std’; did you mean ‘qsort’?7270 | std::sort(hand.begin(), hand.end());8| ^~~~9| qsort10make: *** [public.mk:75: Player-warning-check.s] Error 1"}, {"id": 487, "value": "The spec instructs us to \". . Check for each of these errors:. There are exactly 12 arguments, including the executable name.Points to win the game is between 1 and 100, inclusive.The shuffle argument is either shuffle or noshuffle.The types of each of the players are either Simple or Human.. \". . Should we check for any other errors? For example, is it necessary to check that there argv[3] (i.e., the number of points needed to win the game) is in fact an integer?. . Or can we assume that our code won't be expected to handle error cases besides the four that were explicitly specified?. . Thank you!"}, {"id": 488, "value": "I'm trying to debug my euchre.cpp and I keep facing this error which doesn't even let me get to my game data type. Does anyone know why I'm getting this. I have included the string library and using namespace std.. Screen_Shot_2023-02-20_at_10.24.44_AM.png. Screen_Shot_2023-02-20_at_10.25.55_AM.png"}, {"id": 491, "value": "Hello, when I try to submit Card.cpp and Pack.cpp, it gives me this kind of error.. Screen_Shot_2023-02-20_at_3.21.23_AM. I wasn't sure exactly what it meant. Could someone please help?. . Thank you.. "}, {"id": 495, "value": "Hi,. . I'm running into the following error when trying to make player public test:. . . However, it works on my partner's computer. We've checked and the code is the same. Any tips?. . Thanks"}, {"id": 498, "value": "Hi! (resolved!). . I keep getting this error, which is preventing me from testing my Player.cpp. I've tried putting the player factory under my derived classes and double checking my override functions/their stubs. I also have constructors in both. derived classes that sets the name.. . Screen_Shot_2023-02-19_at_11.51.41_PM.png"}, {"id": 500, "value": "Screen_Shot_2023-02-19_at_11.41.08_PM.png. . I get this error when I try to submit the autograder, I think it is down."}, {"id": 501, "value": "I am getting the following error when trying to submit by myself.. . "}, {"id": 502, "value": "Hi all,. I am getting this error and I don't know what the problem is. I believe it to be some sort of UB error so I used the address sanitizer to check it, and this error is what I ended up with.. . . cout << (dealer_order[3])->get_name() << \" deals\" << endl;. . . ^ this is the line of code it says the error is on. dealer_order is a vector of type Player*.. . I believe the error occurs on every line in which I call a player function and use the -> to connect the Player* and the respective function.. "}, {"id": 503, "value": "I am getting the following error when trying to submit. How can I resolve this?. . "}, {"id": 506, "value": "When I tried to step into and step over line 341, I got a EXC_BAD_ACCESS message. Since argv[1] is basically pack.in , why does this cause an error?. . . . The EXC_BAD_ACCESS message. "}, {"id": 508, "value": "Hello I am having trouble with the function:    std::ostream & operator<<(std::ostream &os, const Player &p). . I believe I implemented it correctly however it continues to give me an error: . . \"Thread 1: EXC_BAD_ACCESS (code=1, address=0x0)\". . What could be causing this error?"}, {"id": 511, "value": "I'm getting this error whenever I try to run my player class tests. Does anyone know what this means?. "}, {"id": 512, "value": "Does anyone know what this error means? I just finished my euchre.cpp and I was ready to run it but then I got this error. It looks like something's wrong with my ifstream.. "}, {"id": 516, "value": "Hi, . We have successfully completed the coding for the driver, and we pass all of the public tests with full marks on AG. We have also thoroughly tested all of the other three files to make sure we aren't missing any errors there. We want to make sure we will pass all the private test cases. Any tips for the best way to go about further testing for our driver function? . Thank you. . "}, {"id": 518, "value": "Hi, we are failing our player public test cases, and we are not sure why this error is popping up. When we used the debugger, we also could not figure out how to solve this issue. I was wondering if anyone knew what the potential error could be? . . . . "}, {"id": 519, "value": "Hello! We are working on our euchre.cpp and when we run it with the example command line input we get the error: . . euchre.exe: Card.cpp:35: Rank string_to_rank(const string&): Assertion `false' failed.. . I've tried to follow some tips on using the debugger and args[] but it has not helped me target the source of the issue. Since the euchre.cpp file is so long, and nothing directly uses string to rank or the operator functions, it is difficult for me to figure out where this issue is coming from. String to rank is written for us and aborts when  \"Input string didn't match any rank\" but I can't seem to figure out what input string it is referring to even with using the debugger, which doesn't tell me much. Any suggestions on how to figure out where the issue is coming from would be very appreciated. Thanks!"}, {"id": 527, "value": "When I type the \"make\" command into my terminal, I receive errors in the unit_test_framework, which is confusing since I hadn't modified anything in that file that I know of. Plz help.. "}, {"id": 535, "value": ". . . I'm not sure why this is an error? I checked the FAQ and they only mentioned how to fix this when creating instances for tests, but this is in my player.cpp file which I'll link bellow. . Player.cpp. "}, {"id": 537, "value": "Hello,. . I tried sdiff to compare my output with euchre_test.00.out.correct and everything seemed good. However, once I run \"make test\" in my terminal, it gave me this weird error.. . I am sure the problem is caused by the code in my first screenshot but I don't know how to fix it. I added the modular operation to prevent out-of-bound errors since players only has size 4 and I want to access players in circle.. . Any help is appreciated!. . . "}, {"id": 553, "value": "Does anyone know why I'm getting this error?. . . ** Results ***** Test case \"test_pack_default_ctor\": FAILIn ASSERT_EQUAL(first_card, Card(NINE, SPADES)), line 19:Nine of Spades != Nine of Spades. ** Test case \"test_pack_empty\": PASS** Test case \"test_pack_istream_ctor\": FAILIn ASSERT_EQUAL(first_card, Card(NINE, SPADES)), line 28:Nine of Spades != Nine of Spades. ** Test case \"test_pack_reset\": FAILIn ASSERT_EQUAL(first_card, Card(NINE, SPADES)), line 36:Nine of Spades != Nine of Spades. ** Test case \"test_pack_shuffle\": FAILIn ASSERT_EQUAL(first_card, Card(KING, CLUBS)), line 53:King of Clubs != King of Clubs"}, {"id": 554, "value": "Hi, . I was comparing my output for euchre_test01 to the given output, and encountered an issue. . The teams for this test are as follows:. Team 1: Edsger and Gabriel. Team 2: Fran and Herb. . For hand 10, Edsger orders up spades. Therefore, the other team, Fran and Herb, are the defenders. . In the final hand, as discussed in the euchre_test01 explanation here, Herb takes the first three tricks and Fran takes the last two. . This should mean that team 2, the defenders, win the hand by a score of 5-0. This qualifies as both a march and a euchre, since they are the defenders. However, the explanation linked above states that the score was 3-2, and the output given in the file only prints \"euchred!\" and not \"march!\" before that, which is how I found the issue. Everything else in our program seems to be running clearly, so I would appreciate some clarification on this issue. . . If there is both a march and a euchre, are we only supposed to print \"euchred!\", or are we supposed to print both. Is this an error in the explanation? Thank you!. (I have attached images of the \"correct\" output and our output. As you can see, they are the same except that one line.). Screenshot_2023-02-18_at_10.50.27_PM.png. Screenshot_2023-02-18_at_10.50.35_PM.png. . "}, {"id": 559, "value": "When I compile my code in Euchre.cpp, I got Runtime Error and Unknown Memory Access errors. From the error messages, it looks like there is something wrong using the << when I do the cout<<players[trump_index]->get_name()<<\" orders up \"<<order_up_suit<<endl; Could you please tell me why << throws me errors?. . These are the error messages:. . . . Here is my code from Euchre.cpp and Card.cpp (Annotations are added according to what the compiler tells me). . . . This is my launch.json file:. "}, {"id": 561, "value": "I just finished my euchre.cpp file and I was ready to test it for the first team but I got this error. Does anyone know what this means or how I can fix it?Screen_Shot_2023-02-18_at_8.48.26_PM.png"}, {"id": 567, "value": "Hello, . . I wonder what is wrong with my main function (please see the attachment). My program only prints out the given error message. I have tried debugger to debug but still can't find the issue. Could you please help me? Thank you in advance!. . . "}, {"id": 568, "value": "When I tried to run my euchre.cpp, the terminal had the following output. I'm confused about what kinds of errors they were.. "}, {"id": 573, "value": "My partner and I are getting the error: \"Player.cpp:8:22: note: implicitly declared private here\" (pointing to the lines where we create the derived classes HumanPlayer and SimplePlayer) when trying to run public player test. Our constructors in both derived classes are public. We think this is a source for others errors we are getting when we try to create human and simple player objects. Is it supposed to be private and our other errors are from something else? If not, how can we get the derived classes to be public?"}, {"id": 577, "value": "I keep getting this error when trying to make Player_tests.exe:. . . . I am just using the given player test function:. . My implementation for the SimplePlayer class is:. . The error says that my issue is with the constructor(lines 17-19), but I am not sure what undefined reference to `vtable for SimplePlayer' means. If someone could help me that would be great. Thank you!. . My player factory function is also just the given one from the spec sheet: . . . "}, {"id": 581, "value": "I have the error \"Allocating an object of abstract class type 'HumanPlayer'\" in Player Factory when I create the object. I saw in the FAQ this likely means that I am not implementing every necessary function, but I cannot find where I went wrong. In SimplePlayer I have get_name, add_card, make_trump, add_and_discard, lead_card, play_card, and a constructor. In HumanPlayer I have the same plus the print_hand() helper function.. Does anyone see what I am missing?"}, {"id": 583, "value": "Hi, I'm getting this really weird, long compiler error when I write make Player.tests.exe. This file was compiling perfectly, and then after I downloaded the 'Better Comments' extension on VS Code and used the different comment 'characters' to change the color of my code (and made minor edits to my code), this compiler error came. I've since disabled this extension, but it doesn't seem to have changed anything. This error is about 5 pages long, and I don't get what it means. Whatever errors I had were commented out before I tried to compile this file. Could you please help me with this? I haven't submitted this current version of code to the AG. And thank you in advance!!. . . "}, {"id": 593, "value": "Hello, I have an error (false positives) detected in some of my card tests. I've looked at my code several times, but I can't figure out what I'm doing wrong. My uniqname is in my piazza username, I would really appreciate it if someone could help direct me in the right direction."}, {"id": 602, "value": ". . Hi I am getting this error on my headers in my player.cpp file. My partner and I have been sharing code and he's had no issues. I made sure that my .h file wasn't altered in any way and it wasn't. I've been looking at the syntax and it looks correct. I am lost at why I am having this issue. "}, {"id": 603, "value": "Card.cpp:238:14: error: member reference base type 'Suit' is not a structure or union    if(suit_a.is_right_bower(suit_a)) {. . I'm getting this error in card_less function. I tried to use the previous written member function from card but it is saying that the type 'Suit' is not a structure or union. I'm not sure how to fix this problem. Or is there another way to write the program?. . Thank you so much"}, {"id": 604, "value": "I am trying to compile player.cpp but I seem to be getting this error that has something to do with the operator<< function. I've already checked that the headers for the functions in player.cpp and player.h are the same. . "}, {"id": 607, "value": "Looking for some help with understanding the operator>> function in card.cpp.. currently have a public_tests error when running this, was looking to see if anyone had any suggestions on where to start fixing it. . . . std::istream & operator>>(std::istream &is, Card &card){. int x = card.get_rank();. int y = card.get_suit();. string str;. if (is >> str){. x = string_to_rank(str);. str += \" of \";. y = string_to_suit(str);. . }. return is;. }. "}, {"id": 609, "value": "So I'm getting a ton of errors when I try to make Player_tests.exe from my terminal. This was working fine before I implemented my HumanPlayer sub-class and its functions in Player.cpp and I have no clue what could be causing the errors. If anyone has any feedback that can help, I'd really appreciate it. See terminal feedback below:"}, {"id": 610, "value": "I get an error whenever I run my tests with human input, like this one:. ./euchre.exe pack.in noshuffle 3 Ivan Human Judea Human Kunle Human Liskov Human < euchre_test50.in > euchre_test50.out. . I parsed through it with the debugger, and for the first cin >> input line, it inputs \"./euchre.exe\" instead of \"pass\" like the first line of \"euchre_test50.in\". So it throws an error since no valid response is given.. . . Why might this be happening? When I put my code in the autograder, it works fine, but it does this on my local system."}, {"id": 622, "value": "Hello, (in my euchre.cpp file) I am trying to check for errors in the argv inputs, specifically the shuffle argument and all the player type arguments, but I am getting an error saying: \"error: comparison with string literal results in unspecified behavior.\" I'm doing if (argv[2] != \"shuffle\"), but all lines where I do this or something similar (comparing argv[i] and a string) are causing errors.. I'm not really sure how else I should check for errors in the argv inputs without doing string comparisons, so any thoughts are great appreciated! Thank you! "}, {"id": 624, "value": "I am unsure what this error means and would love some assistance in figuring It out if possible I haven’t ever seen this error before "}, {"id": 632, "value": "I'm working on my test cases for Player.cpp and then suddenly I have this error. I tried to delete my file and copy to a new file but it still does not work. Can someone help me with this please? Thank you so much!  "}, {"id": 633, "value": ". Can someone help me with this error. For Reference I restarted a newfile to find a big and only pasted the card functions in the card struct."}, {"id": 634, "value": "I tried to call the add_and_discard function inside of the make_trump function, but it resulted in an error. It says, \"the object has type qualifiers that are not compatible with the member function \"SimplePlayer::add_and_discard.\" Does anyone know what this means?"}, {"id": 635, "value": "I have implemented all the functions in both SimplePlayer and HumanPlayer, yet I have these errors that persist:. object of abstract class type \"SimplePlayer\" is not allowed:. pure virtual function \"Player::make_trump\" has no overrider. object of abstract class type \"HumanPlayer\" is not allowed:. pure virtual function \"Player::make_trump\" has no overrider. member function declared with 'override' does not override a base class member. member function declared with 'override' does not override a base class member. . Here is the function stub that is used for the two make_trump functions :. . bool make_trump(const Card &upcard, bool is_dealer,.                           int round, Suit &order_up_suit) override{. "}, {"id": 641, "value": "negative space error after i use hand.erase one i"}, {"id": 648, "value": "When calling my humanplayer::make_trump function in my euchre driver, I am reading in an empty string from euchre_test50.in. It works for hand 0 but as hand 1 starts and the first player is supposed to pass, the string that holds the input from the file is empty, causing an error. What might be causing this bug?. . Edit:. The student answer actually helped me understand what the issue was. I realized that I had been calling add_and_discard on the current player, rather than on the dealer, and I didn't check to see whether it was round 1 or 2. It now works properly. "}, {"id": 649, "value": "I am working on player.cpp and have so finished all functions for my SimplePlayer derived class. I am trying to test it which means using the player factory function, but I keep getting the \"Allocating an object of abstract class type\" error. I am wondering if my default constructor is missing something or if I am missing something else somewhere in my SimplePlayer class? Below is a screenshot of what my default constructor is right now.. . Screen_Shot_2023-02-16_at_1.59.55_PM.png"}, {"id": 663, "value": "I got these errors when using sort in player.cpp. However, when I looked at the definition of sort I saw that it is spelled correctly \"sort\". Why is the autograder telling me that it should be qsort?"}, {"id": 664, "value": "When I run the public tests for pack, I get a runtime error that says index out of bounds for type Card [24] when running the public test on the istream pack constructor. It also states Address Sanitizer stack-buffer-overflow on address. Some other times, I pass all of the test cases in the pack public tests including the istream test. Why am I getting this error?. . This is the error:. . "}, {"id": 665, "value": "I'm receiving this error when executing euchre cpp:. Hand 0. Adi deals. libc++abi: terminating with uncaught exception of type std::out_of_range: vector. Abort trap: 6. . It looks like one of my vectors is going out of bounds, but I can't find where it's coming from. Can someone take a look at my code and let me know? (uniqname: chekaren)"}, {"id": 668, "value": "Hello! I am struggling building the tests that I have written. My situation is I can run all the public tests successfully but when I want to run the tests that I write errors like this always occur. What could be the problem?. "}, {"id": 669, "value": "So I already know that there is a post about this specific topic but I wanted to provide evidence of my code so you guys have a better understanding of what I am looking at as well. So I keep getting the error of no instance of constructor of ... matches the argument list arguments types are 'const string'. . . Then here is my first part of the SimplePlayer derived class.. . .  THANK YOU!!"}, {"id": 670, "value": "Player.cpp:28:8: error: 'Simple::make_trump' hides overloaded virtual function [-Werror,-Woverloaded-virtual]. How can I solve this?"}, {"id": 671, "value": "I have created two derived classes (SimplePlayer and HumanPlayer) and I have run into this error in player_factory when I try to create a new object of the SimplePlayer class. I have implemented all of the function stubs, created constructors for both derived types, and initialized the private member variables. I just don't know what this error means or how to fix it. Attached is the screenshot of the error message. . . "}, {"id": 679, "value": "When we are running the code locally all the Player_public_tests pass but when run through the autograder we are finding file directory of player.h not found, below is the autograder error. "}, {"id": 686, "value": "Hi,. I have implemented all of my functions for SimplePlayer, yet Xcode is still throwing me this error. I've tried the solutions on many other posts but still no resolution. Any help is appreciated:)"}, {"id": 693, "value": "When we ran the public tests for our project, we received this error message. However, we are confused because the error seems to be coming from a function that we cannot edit, so we were wondering how to resolve this/what function we can edit the implementation for to fix this issue. . . . "}, {"id": 695, "value": ". I'm getting an compiler error for Player.cpp in which says I can't create new SimplePlayer(name) or new HumanPlayer(name). I've created the corresponding constructors in either derived class so I'm not sure why this error is occurring."}, {"id": 701, "value": "Screenshot_2023-02-14_at_6.26.26_PM.png. Hello, I am getting an error in the autograder where I am failing one of the Player public tests but I am passing them all in my terminal. Also, I am not sure how to understand the error message"}, {"id": 706, "value": "I wonder if we can still use autograder now? since it showed an error when I submitted it. . . "}, {"id": 709, "value": "what does this error mean and how can I solve this?. "}, {"id": 714, "value": "My pack.cpp passed the pack_public_tests.cpp and my test cases but when I submitted to autograder this error showed up. I work with vscode.. "}, {"id": 719, "value": "Does any one know what does this error means?. "}, {"id": 723, "value": "I keep getting an undefined symbol error and am confused what it may be linking towards as when I look through all my code nothing is showing up highlighted in red to show an error. I attached a snippet of the error. "}, {"id": 724, "value": "Hi. So I tried making Player_Public_tests.exe and this error popped up:. . . . . I attached my player.cpp below:. Player.cpp"}, {"id": 725, "value": "I got this very long error message. I think it's from sort() from <algorithm> because the code compile successfully if I just comment out any line that uses sort(hand.begin(), hand.end());. . Does anyone know how to fix it?. . . /Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/type_traits:4001:1: note: candidate template ignored: requirement 'is_move_assignable<const Card>::value' was not satisfied [with _Tp = const Card]swap(_Tp& __x, _Tp& __y) _NOEXCEPT_(is_nothrow_move_constructible<_Tp>::value &&^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/type_traits:4014:1: note: candidate template ignored: could not match '_Tp [_Np]' against 'const Card'swap(_Tp (&__a)[_Np], _Tp (&__b)[_Np]) _NOEXCEPT_(__is_nothrow_swappable<_Tp>::value)^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/utility:629:1: note: candidate template ignored: could not match 'pair<type-parameter-0-0, type-parameter-0-1>' against 'const Card'swap(pair<_T1, _T2>& __x, pair<_T1, _T2>& __y)^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/tuple:174:6: note: candidate template ignored: could not match '__tuple_leaf<_Ip, type-parameter-0-1, >' against 'const Card'void swap(__tuple_leaf<_Ip, _Hp, _Ep>& __x, __tuple_leaf<_Ip, _Hp, _Ep>& __y)     ^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/tuple:999:1: note: candidate template ignored: could not match 'tuple<type-parameter-0-0...>' against 'const Card'swap(tuple<_Tp...>& __t, tuple<_Tp...>& __u)^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/memory:2056:6: note: candidate template ignored: could not match '__compressed_pair<type-parameter-0-0, type-parameter-0-1>' against 'const Card'void swap(__compressed_pair<_T1, _T2>& __x, __compressed_pair<_T1, _T2>& __y)     ^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/memory:2594:1: note: candidate template ignored: could not match 'unique_ptr<type-parameter-0-0, type-parameter-0-1>' against 'const Card'swap(unique_ptr<_Tp, _Dp>& __x, unique_ptr<_Tp, _Dp>& __y) _NOEXCEPT {__x.swap(__y);}^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/memory:4221:1: note: candidate template ignored: could not match 'shared_ptr<type-parameter-0-0>' against 'const Card'swap(shared_ptr<_Tp>& __x, shared_ptr<_Tp>& __y) _NOEXCEPT^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/memory:4511:1: note: candidate template ignored: could not match 'weak_ptr<type-parameter-0-0>' against 'const Card'swap(weak_ptr<_Tp>& __x, weak_ptr<_Tp>& __y) _NOEXCEPT^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/functional:2608:1: note: candidate template ignored: could not match 'function<type-parameter-0-0 (type-parameter-0-1...)>' against 'const Card'swap(function<_Rp(_ArgTypes...)>& __x, function<_Rp(_ArgTypes...)>& __y) _NOEXCEPT^In file included from Player.cpp:2:In file included from ./Player.h:14:In file included from ./Card.h:13:In file included from /Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/iostream:37:In file included from /Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/ios:215:In file included from /Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/__locale:14:In file included from /Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/string:506:In file included from /Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/string_view:175:In file included from /Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/__string:57:/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/algorithm:3856:22: error: no viable overloaded '='                *__j = _VSTD::move(*__k);                ~~~~ ^ ~~~~~~~~~~~~~~~~~/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/algorithm:3983:20: note: in instantiation of function template specialization 'std::__insertion_sort_3<std::__less<Card> &, const Card *>' requested here            _VSTD::__insertion_sort_3<_Compare>(__first, __last, __comp);                   ^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/algorithm:4149:12: note: in instantiation of function template specialization 'std::__sort<std::__less<Card> &, const Card *>' requested here    _VSTD::__sort<_Comp_ref>(__first, __last, _Comp_ref(__comp));           ^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/algorithm:4157:12: note: in instantiation of function template specialization 'std::sort<const Card *, std::__less<Card>>' requested here    _VSTD::sort(__first, __last, __less<typename iterator_traits<_RandomAccessIterator>::value_type>());           ^/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/algorithm:4173:12: note: in instantiation of function template specialization 'std::sort<const Card *>' requested here    _VSTD::sort(__first.base(), __last.base());           ^Player.cpp:226:5: note: in instantiation of function template specialization 'std::sort<const Card>' requested here    sort(hand.begin(), hand.end());    ^./Card.h:73:7: note: candidate function (the implicit copy assignment operator) not viable: 'this' argument has type 'const Card', but method is not marked constclass Card {      ^./Card.h:73:7: note: candidate function (the implicit move assignment operator) not viable: 'this' argument has type 'const Card', but method is not marked constfatal error: too many errors emitted, stopping now [-ferror-limit=]20 errors generated."}, {"id": 727, "value": "I keep getting this error. What should I do to fix this function?? . "}, {"id": 730, "value": "Hi,. . I have this error on the autograder side however it runs fine on my computer. Could someone give me an idea what the issue is? Thanks. Uniqname is lcollin if want to view on autograder.. . Screenshot_2023-02-14_at_12.02.06_AM.png Screenshot_2023-02-14_at_12.02.31_AM.png"}, {"id": 734, "value": "I am getting this error on Player factory, and it is also giving errors on the Player public test even though I haven't manipulated the code: \"cannot overload functions distinguished by return type alone\""}, {"id": 736, "value": "Hi. So I tried making Player_Public_tests.exe and this error popped up:. . . Please let me know if there's any solution."}, {"id": 740, "value": "getting this error: No matching constructor for initialization of 'Card'. . When using Card c (r,s); in my pack.cpp Pack() function?. . Can someone explain what I'm doing wrong?"}, {"id": 741, "value": "So we managed to implement all the player.cpp functions, but when we try to make Player_public_tests.exe, we come up with these errors. Any idea how to fix this?. . . . "}, {"id": 742, "value": "I finished implement both subclasses player.cpp. VS Code indicates no syntax errors. But when I try making the public tests (make Player_public_test.exe) I get the following error in the terminal:. . . Any ideas?"}, {"id": 750, "value": "Screenshot_2023-02-13_191309.png. . When I attempt to run my Pack public tests I keep getting this error. Not sure what this means, I know that a segmentation fault means I am indexing out of bounds but why does it reference this operator?"}, {"id": 754, "value": "When implementing the function for Player_factory in player.cpp, there is a red underline when I try to return a new instance of the derived classes, SimplePlayer and HumanPlayer. Granted I have not fully implemted the dervied class for HumanPlayer, but I fully implemented the dervied class for SimplePlayer, but there's still an error line underneath it when I call it in Player*Player_factory.. . Uniquename: samyerra"}, {"id": 760, "value": "the function like is not accepting this function name in our code. this is directly from the pack.h. even with assert(false) in the code it gives an error.. \"Expected '(' for function-style cast or type construction\". \"Use of undeclared identifier 'pack_input'\". gThaxton"}, {"id": 762, "value": "I have implemented Simple and Human but am receiving the same errors for both SimplePlayer and HumanPlayer in my Player_factory function. It seems to me that it believes I did not write some functions in each derived class. I have exact copies of each function (without virtual prefix) so I do not know why it is picking these functions as having no override.. . This is what I am getting:. object of abstract class type \"SimplePlayer\" is not allowed:C/C++(322). Player.cpp(250, 16): pure virtual function \"Player::get_name\" has no overrider. Player.cpp(250, 16): pure virtual function \"Player::make_trump\" has no overrider. . object of abstract class type \"HumanPlayer\" is not allowed:C/C++(322). Player.cpp(254, 16): pure virtual function \"Player::get_name\" has no overrider. Player.cpp(254, 16): pure virtual function \"Player::make_trump\" has no overrider. "}, {"id": 763, "value": "For human player, I implemented some non-derived functions but I'm having trouble calling those functions outside the player.cpp class. . Whenever I try the name.func() style, my compiler throws an error saying that the function is not a member of player. How can I fix this? "}, {"id": 765, "value": "I'm getting an error while implementing the operator>> which I thought it was already defined before in Card.cpp, so I'm kind of confused about what's going on here. I'm pretty sure this is a stupid question, but can anyone explain why I'm getting this error and what I need to change to make it go away? Thank you!. . "}, {"id": 768, "value": "Hi, . . When I attempt to debug Pack_Public_Test.cpp, it gives me an error before I am able to do it. I'm pretty confused on how to fix this. I've attached the photos of the error down below and my launch.json. Thanks!. . "}, {"id": 769, "value": "Hello,. . I was adding some more test cases to Card_tests.cpp and found that it was giving me an error when the card ranks are equal, but the suits are different. I've stared at my implementation for a long time, and can't seem to figure out what's wrong with my code. I am comparing the ranks first, and then if the ranks are equal, then I am comparing the suits. I would appreciate it if someone could point me in the right direction!. . . "}, {"id": 772, "value": "I'm getting this error but I don't know how to fix it. Can you give me any suggestion?. . "}, {"id": 780, "value": "What does the error mean? . . "}, {"id": 781, "value": ". . . Hi, I keep getting a duplicate symbol error above. I'm pretty sure its something wrong with how I made the classes, but I followed the examples and the .h file. If someone could take a look at my code thatd be great, thanks."}, {"id": 782, "value": ". Hi so my partner and I are having some issues with our Pack.cpp file, and we are not sure where the error is because the file is compiling. Could an instructor look at the code and maybe give some hint into what might be wrong?"}, {"id": 785, "value": "Does anyone know why we are getting this error for undefined behavior in pack.cpp? We are passing all test cases.. . . . . Uniqname: mohanraj"}, {"id": 787, "value": "The spec said to put helper functions in the private part of the class declaration, but I am getting this error when I try to implement the declared function:. C++ requires a type specifier for all declarations. Any suggestions on how to fix this error?. Also, why would we put the helper functions in the private section in the first place?"}, {"id": 791, "value": "I'm writing the discard logic for this function and I'm getting the error below for my Card_less function. I'm not really sure why since I'm passing a 2 cards of type Card and the trump suit of type Suit. "}, {"id": 796, "value": "In my Pack.cpp file, I have error squiggles under my #include \"Pack.h\" and my #include \"Card.h\" . This error is only appearing in my Pack.cpp file, and my #include files for my other .cpp files are working fine. The error message I am getting is \"#include errors detected. Please update your includePath. Squiggles are disabled for this translation unit\" I appreciate any help/advice!"}, {"id": 797, "value": "I am getting errors for player factor stating that no instance of constructor SimplePlayer::SimplePlayer\" matches the argument list when I pass it name, the arugment types ae: (const std::string). The same occurs when I go to delete HumanPlayer and SimplePlayer."}, {"id": 799, "value": "I wanted to call add_and _discard in the make_trump function. I am getting an error message when I call it using the upcard as the input. The error reads that the object has type qualifiers that are not compatible with the member function \"SimplePlayer::add_and_discard\" object type is: const SimplePlayer. Does anyone have any ideas why this might be?"}, {"id": 801, "value": "Hi I'm trying to use the sort function to sort my hand before printing, but whenever I do I get all of these errors. How can I fix this?. . "}, {"id": 802, "value": "I have a problem with line 25 in pack_public_tests.cpp. It said that the pack in is not opened. I tried make pack_pulic_tests.cpp and added pack_public_tests.exe to my configuration but I'm not familiar with vscode. Also, I changed my configuration to card_tests.exe and it doesn't compile either. Previously, it compiled without the error on line 25.. . "}, {"id": 803, "value": "Hi,. . My partner and I are trying to start on Player.cpp, but when I attempted to copy in the function stubs and RME's from Player.h, there are compilation errors associated with all of the virtual functions. I have attached a photo of my code below + the error message.. . . We have already tried:. . Adding Player:: in front of all function initializations on these lines (i.e.. . virtual const std::string & Player:: get_name() const = 0;. . . Commenting out. . // virtual ~Player() {}. . . Screen_Shot_2023-02-12_at_1.41.00_PM.png. "}, {"id": 809, "value": "We have tried to use .clear() and .erase() but both of them don't work in our code. It shows an error that \"no instance of overloaded function \"std::__1::vector<_Tp, _Allocator>::erase [with _Tp=Card, _Allocator=std::__1::allocator<Card>]\" matches the argument list.\". . I saw a post asked about this and the instructor refers to a question in the Project 3 Q&A post but for some reason, I cannot find any questions about \"How to use erase function?\" in that post. "}, {"id": 810, "value": "Screen_Shot_2023-02-12_at_10.33.55_AM.png. I'm getting an error saying that my function isn't returning a value in every scenario, but I have a value being returned no matter what suit the function is given. Can you help me figure out what's going on?"}, {"id": 811, "value": "I'm getting such errors in my complier while I have no trouble running my code on CAEN and the auto grader. There are also a bunch of errors in unit_test_framework.h but I didn't edit that file. . "}, {"id": 812, "value": "Hello, the following player test is causing an out of bounds error in Autograder (attached error and test code below) however I am not able to figure out why.. . . . . TEST (test_same_card) {1176ASSERT_NOT_EQUAL(Card_less(Card(NINE, SPADES), Card(NINE, SPADES),SPADES), true);11771178Player * new_player155 = Player_factory(\"New_Player2\", \"Simple\");1179new_player155->add_card(Card(KING, HEARTS));118011811182// Bob makes tump1183Card jack_hearts_165(JACK, HEARTS);1184Suit trump_165;1185bool orderup_165 = new_player155->make_trump(1186jack_hearts_165, // Upcard1187false, // New Player is also the dealer11881, // Second round1189trump_165 // Suit ordered up (if any)1190);11911192new_player155->add_and_discard(1193Card(KING, HEARTS) // upcard1194);11951196// Verify Bob's order up and trump suit1197ASSERT_FALSE(orderup_165);11981199120012011202delete new_player155;1203}"}, {"id": 814, "value": ". Hello, for one of the player tests, my partner and I are testing add and discard by having two hands; one hand has a card that is added and discarded and the other hand does not have any cards added and discarded, however we are making the hands / add and discard so that the played card should be the same for both. . . . I believe this test was noted as valid in Autograder (when I removed the test the score went from 16/17 to 14/17) however the issue is that we delete the first player after making their hand so later on when we do ASSERT_EQUAL for the played card in the first and second player, there is an out of bound error (it works locally but does not work in autograder). . How would we resolve this / make a change to avoid an out of bounds error (not sure how to do this). If we just delete the two players at the end of the test that is causing an issue. I have attached the test below for your reference.. . . . . . . . . . . . . . . . . . . . . Player * bob = Player_factory(\"Bob\", \"Simple\");. bob->add_card(Card(NINE, SPADES));. bob->add_card(Card(NINE, CLUBS));. bob->add_card(Card(QUEEN, SPADES));. bob->add_card(Card(ACE, SPADES));. bob->add_card(Card(KING, SPADES));. . . Card lead_card = bob->lead_card(SPADES);. . ASSERT_EQUAL(lead_card, Card(NINE,CLUBS));. . delete bob;. . Player * correct = Player_factory(\"Correct\", \"Simple\");. correct->add_card(Card(JACK, SPADES));. correct->add_card(Card(NINE, CLUBS));. correct->add_card(Card(QUEEN, SPADES));. correct->add_card(Card(ACE, SPADES));. correct->add_card(Card(KING, SPADES));. . . correct->add_and_discard(. Card(NINE, HEARTS) // upcard. );. . Card lead_card2 = bob->lead_card(SPADES);. ASSERT_EQUAL(lead_card2, Card(NINE,HEARTS));. . // Verify the card Bob played. ASSERT_EQUAL(bob, correct);. . delete correct;. "}, {"id": 815, "value": "for some reason my card_tests.exe won't compile because apparently the << operators aren't working and it thinks I'm defining class card twice. maybe it's just late and my brain is missing something, but here's my compiler error. . i've looked through my own notes and the past few lecture slides on classes to try and figure out what's wrong but i can't find anything"}, {"id": 818, "value": "Hi, so me and my partner included the two istream functions into our Card.cpp along with changing the Card.h file to include the two newly added functions so that the files match. However, we are receiving an error stating that we have a redefinition in our code. Looking at the above functions  (the code that were not allowed to change) in Card.cpp the istream functions were already declared. We're just confused on this change log and would appreciate if anyone can explain and lead us in the right direction."}, {"id": 824, "value": "I finished writing pack.cpp but when I try to compile the public test, I get a long stream of errors, attached below. What should I do?"}, {"id": 826, "value": "For some reason there appears to be an error with the sort vector function and I keep getting this error. Does anyone know what the solution to this might be?. . "}, {"id": 827, "value": "Does anyone know what this error means in pack public tests?"}, {"id": 831, "value": "I am getting this error for PlayerFactory, I have implemented Constructors and function stubs(assert false) for the virtual functions. Screen_Shot_2023-02-11_at_6.20.46_PM.png"}, {"id": 837, "value": "I keep getting this error for pack public tests and I was wondering if anyone knew what to do"}, {"id": 839, "value": "I am attempting to test my code for player.cpp and cannot figure out why I am getting the following error message:. . Undefined symbols for architecture x86_64:  \"operator<<(std::__1::basic_ostream<char, std::__1::char_traits<char> >&, Player const&)\", referenced from:      test_player_insertion() in Player_public_test-5b847b.old: symbol(s) not found for architecture x86_64clang: error: linker command failed with exit code 1 (use -v to see invocation). . "}, {"id": 858, "value": "I was wondering how I could find the line number that autograder is referring to for this error in player tests. I thought it was maybe on line 438 since 438 is in the error message, however there is nothing related to indexing out of bounds on line 438. . . "}, {"id": 860, "value": "Getting 3 errors in the given line of the function for reading the pack.in file. The error pops up also when we only have assert(false) in the implementation also. “Qualified reference to 'Pack' is a constructor name rather than a type in this context”. (“× Expected '(' for function-. style cast or type construction. •* ““Use of undeclared identifier. 'pack_input'”Gthaxton"}, {"id": 862, "value": "I am trying to create a member variable for SimplePlayer using a vector of cards (vector<Card> hand), but VSCode is giving me an error message saying vector is not a template.  How am I supposed to properly represent the player's hand?"}, {"id": 863, "value": "Our deal_one() is failing here due to 'next' being a random integer. Our function passes the constructor tests which also call to deal_one() but that is because it calls the function directly onto a card which makes next 0, while the empty() tests call the function on a pack leaving next to be random. This gives us a segmentation error.. . Is there somewhere that we should be initializing next to 0? Thank you for your time."}, {"id": 867, "value": "Hi, I am confused why my pack constructor for istream will have an error at the end, whatever the range of the for loop I set, there will be an error at the bottom when I try to print it.. thanks!"}, {"id": 869, "value": "I'm working with the p3-euchre files in Visual Studio Code, but I'm getting the following error under any of the #include libraries, like #include <iostream>:. . #include errors detected. Please update your includePath.. Squiggles are disabled for this translation unit. ([file directory]).. -----. cannot open source file \"iostream\". . This happened on both computers I tested it on, one running Windows 10, the other Windows 11. I looked up \"includePath\", but I don't know what to change it to. Is there a simpler fix to this issue?. Any answers would be greatly appreciated. Thank you!"}, {"id": 872, "value": ". . Why am I getting an error that says Pack.h does not exist? My uniqname is ryslee"}, {"id": 880, "value": "When I run Pack_public_test.exe, I get the error. . \"Running test: test_pack_istream_ctor. Assertion failed: (false), function string_to_rank, file Card.cpp, line 35.\". . I don't know why I keep getting this error since this function was provided in the starter files and I didn't edit it."}, {"id": 883, "value": "I am getting this error when I try to compile my player.cpp:. 'Simple::make_trump' hides overloaded virtual function . what does this mean?"}, {"id": 886, "value": "Hi, I just finished up the SimplePlayer implementation for Player.cpp but it threw this error at me: . . . . I googled this error, some told me I should add destructors for SimplePlayer and HumanPlayer. I added but it did not make any difference. Can anyone help me out? Thank you!"}, {"id": 897, "value": "I am getting this error and I am not sure why as it was a premade function, . . c++ --std=c++11 -Wall -Werror -pedantic -g -Wno-sign-compare -Wno-comment Card.cpp Card_public_test.cpp -o Card_public_test.exeUndefined symbols for architecture x86_64:  \"operator<<(std::__1::basic_ostream<char, std::__1::char_traits<char> >&, Card const&)\", referenced from:      test_card_insertion() in Card_public_test-c37fc1.o      decltype((fp) << (fp0))& print_helper<Card>(std::__1::basic_ostream<char, std::__1::char_traits<char> >&, Card const&, int, int) in Card_public_test-c37fc1.old: symbol(s) not found for architecture x86_64clang: error: linker command failed with exit code 1 (use -v to see invocation)make: *** [Card_public_test.exe] Error 1"}, {"id": 900, "value": "I've already implemented every function in Cards.cpp but I get the external symbol error for every single one of the functions. However, when I implement it directly in the header, the error disappears. How can I fix this?"}, {"id": 901, "value": "When we try to run the card pubic tests in the terminal , we are getting an error that there is a redefinition of 'class' in Card.cpp since it is already in Card.h. . Any advice on how to fix this error?"}, {"id": 906, "value": "Hi,. . I've been getting this error when trying to implement is_face_or_ace. My if statement is meant to check the rank of the cards. However, the compiler does not like my attempt at checking rank. I have included the error message.. . I have tried:. Removing my inclusion of class Card {.            public: , in Card.cpp, since it is already initialized in Card.h. I also know that #include \"Card.h\" is at the top of Card.cpp. . Adjusting get_rank to include a this-> pointer (implementation should be viewable at the top of the code I've attached below.. Any advice on next steps? . . Screen_Shot_2023-02-09_at_1.19.32_PM.png"}, {"id": 917, "value": "I'm trying to do make Card_public_test.exe, but I get this error. Does anyone know what it might be? I only have one main.cpp file/. "}, {"id": 918, "value": "Hours before I recently ran my card.cpp for both Card_tests and Card_public_test, I was not receiving any compiler errors for either. However, my most recent executions have resulted in all of hthese compiler errors despite me not changing a single line in my code for these functions. Could someone give some insight? Thanks. "}, {"id": 921, "value": "My player.cpp is passing all of my public tests in VScode but when I submit to autograder I get this out of bounds error that is causing the public test to fail. Any tips? Edit: I already tried my sanitizer and it doesn't pickup any errors."}, {"id": 929, "value": "I have created a private variable name and a constructor that sets the name to the input parameter. However, I am still getting the error \"expected a type specifier\". . . What exactly does this error mean? "}, {"id": 930, "value": "Hello,. I have been working on pack.cpp but I get this error whenever I try to run the public tests:. . . In pack.cpp I've also accessed other private member variables (cards, PACK_SIZE) but I haven't had any trouble with them.. . Any ideas?"}, {"id": 940, "value": "In my implementation of the Player_factory function in Player.cpp, where I return a new SimplePlayer object Visual Studio keeps giving me an error  that \"object of abstract class type SimplePlayer is not allowed\" and all of SimplePlayer's functions are \"pure virtual functions\". I've tried various edits to my SimplePlayer class implementation like adding \"virtual\" before every function and adding a destructor, but all to no avail. Would greatly appreciate any pointers :)"}, {"id": 941, "value": ". Hi, I haven't been able to get my Card.cpp to compile after creating stubs for all of the functions and implementing most of the ones within the Card class, but I'm not sure why this error is happening or what it means so I don't know where to start looking. I would appreciate any help, thank you (uniqname cafung)"}, {"id": 943, "value": "Test_card_inserstion and test_card_suit_and_rank don’t pass which is confusing because they both use the card function that every other function uses and those pass. Where can anything be changed?The error show that the space between “three” and “of spades” has random numbers between them.Gthaxton"}, {"id": 945, "value": "When I try to run the pack_public_test, I get the error. Thread 1: EXC_BAD_ACCESS (code=1, address=0x64efb07a0). in card.cpp function std::ostream & operator<<(std::ostream &os, Suit suit).. . This function is part of the starter code so I cant change it and the test that is being run does not even use this operator. Confused on what this means / what to do.. "}, {"id": 947, "value": " When I go through the public tests, I get this error:. . Card.cpp:39: Rank string_to_rank(const string&): Assertion `false' failed.. . I have tried using the debugger and it seems like that my pack_input is reading in an empty string from the default implemented. . Rank string_to_rank(const std::string &str) function. .  after I've finished reading \"Ace of Diamonds\".. . The empty string being read-in fails the if statement assertion and asserts(false), in which makes us fail the public test.. . How would I go about solving this?. . "}, {"id": 952, "value": "I got this error when I tried to \"make Card_public_test.exe\", does anybody know what it's saying? "}, {"id": 953, "value": "I got an error at . . return new SimplePlayer(name); (from the spec). . .  \"error: no matching constructor for initialization of 'SimplePlayer' \". . . I'm not sure what SimplePlayer(name) does and I already add a private contains name in the derived class, I don't know what else I should do . . Thanks in advance!"}, {"id": 954, "value": "My code is failing assert(ifs.is_open()) in test_pack_istream_ctor in pack_public_tests. I'm not sure how to fix this, as nothing above calls anything that must be student implemented. Where could the error be coming from?"}, {"id": 968, "value": "This is the same question that Sanya (csanya) posted but with screenshots of the exact problem. the \">>\" operator IS declared in the card.cpp file, and only gives an error for this first \">>\". . . . . . Thank you!"}, {"id": 969, "value": "For this function, my partner and I are trying to read in the card ranking and suit of each card within the pack, but the \">>\" operator after we write \"pack_input\" is giving us an error. It says \"no operator matches these operands\". How can we fix this and be able to read in the rank and suit the way the spec wants?"}, {"id": 974, "value": "When I declare std::istream s to read in the pack_input values, I get a compile error saying \"no default constructor exists for class \"std::__1::basic_istream<char, std::__1::char_traits<char>>\"\". Am I declaring it wrong?"}, {"id": 985, "value": "Card.cpp:10:29: error: ‘constexpr const char* const Card::RANK_TWO’ is not a static data member of ‘class Card’. . What does this error mean in the autograder? My uniqname is ryslee"}, {"id": 988, "value": "Hey I am trying to push changes to a shared github but I get this error in the process. "}, {"id": 989, "value": "We keep getting this error when making the card_public_tests:c++ --std=c++11 -Wall -Werror -pedantic -g -Wno-sign-compare -Wno-comment Card.cpp Card_public_test.cpp -o Card_public_test.exeCard.cpp:239:51: error: all paths through this function will call itself [-Werror,-Winfinite-recursion]bool operator!=(const Card &lhs, const Card &rhs) {                                                  ^1 error generated.make: *** [Card_public_test.exe] Error 1. . Any ideas for how to fix this?"}, {"id": 1005, "value": "Why do I get an error when a write the function that include const in card.cpp I typed them with card:: in front but that did not help neither.  does the \"const\" need to be there in card.cpp?"}, {"id": 1006, "value": "Hello, . after writing the std::istream & operator>>(std::istream &is, Card &card)  function, I get this error: . . I had this error before in other projects and usually putting a return by itself fixes it but in this function, it does not work. Any help would be appreciated."}, {"id": 1007, "value": "In card.cpp, I get this error:. . What could be causing this error? Any help would be appreciated."}, {"id": 1010, "value": "Hi! I was wondering how I should be implementing the assert(false) definitions for these three functions in Card.cpp. I've taken out the type (Rank and Suit), used Card::, and have gotten rid of the const but everything comes back with an error. Am I supposed to be writing these in Card.cpp? Or am I just missing something obvious? I got the other function stubs done, just not these three and I'm not sure why. Anything would help, thank you!. . "}, {"id": 1019, "value": "I was getting an error for not using the rank and suit variables (I was just initializing them) so I put assert(rank) and assert(suit) at the end of the function. However now, the public test is failing that assertion for some reason for any function with assert(rank) and assert(true). How can I resolve this?"}, {"id": 1023, "value": "I am having an issue with removing a card from a vector in the Player.cpp functions. I looked online for the error I am getting, but there was no help. See the bottom of the screenshot for the error.. Screenshot_2023-02-05_at_7.26.57_PM.png"}, {"id": 1028, "value": "I keep getting this error that says that SimplePlayer has not been declared or that a type-specifier is expected before I return a new SimplePlayer, and I was kind of confused as to what that is about. . For reference that is the error that I am getting, and also my constructor for SimplePlayer does not include another constructor for the Player class, like so. The reason it doesn't include one was because I couldn't find a constructor for the Player class to actually put in my subclass, and I'm assuming that this is what is keeping my code from compiling. I also tried adding Player() in the subclass constructor, but that said that a cast to public class Player is not allowed. So I'm confused on how we're supposed to include the constructor for the super class, and also how to fix the error that I get when trying to compile.. "}, {"id": 1029, "value": "Is there something we should be doing with the definition of this function in Card.cpp in order to correctly access the private member variables? I'm getting a compiler error even with the friend function declaration in Card.h "}, {"id": 1030, "value": "In the project spec, it says that we should first compare the rank of the card and if cards are the same rank, we then compare by suit. Why do we do this? Aren’t cards of the different suits (excluding trump/lead suit) considered equal in euchre?If I were to play an 8 of spades and another player plays an 8 of hearts (if lead/trump suit aren’t hearts or spades), wouldn’t our cards be equal in the eyes of the game?Maybe this is sorted out later but to me it seems like it would just cause confusion and possible errors with implementing gameplay."}, {"id": 1039, "value": "I'm getting this compile error when I try to define the Card class member functions in Card.cpp and I'm not sure why. I'm using the scope resolution operator. If anyone can point me in the right direction, that would be greatly appreciated!"}, {"id": 1044, "value": "Like the getters and setters, or do I have to implement those in Card.cpp. . If so, how do I avoid a compile error?"}, {"id": 1045, "value": "When I put the Card member functions in card.cpp, I get this error message when the const keyword is put after the arguments in the function (eg. Suit get_suit() const) \"A type qualifier is not allowed on a nonmember function\". Should const be in this place? "}], "links": [{"source": 1, "target": 1, "value": 0.9999999999999999}, {"source": 3, "target": 3, "value": 1.0}, {"source": 4, "target": 4, "value": 1.0}, {"source": 5, "target": 5, "value": 1.0000000000000002}, {"source": 9, "target": 9, "value": 0.9999999999999997}, {"source": 14, "target": 14, "value": 1.0000000000000002}, {"source": 15, "target": 15, "value": 1.0}, {"source": 16, "target": 16, "value": 0.9999999999999997}, {"source": 17, "target": 17, "value": 1.0000000000000002}, {"source": 17, "target": 474, "value": 0.6268754906500643}, {"source": 18, "target": 18, "value": 0.9999999999999999}, {"source": 27, "target": 27, "value": 1.0000000000000002}, {"source": 31, "target": 31, "value": 0.9999999999999998}, {"source": 33, "target": 33, "value": 1.0}, {"source": 35, "target": 35, "value": 0.9999999999999998}, {"source": 36, "target": 36, "value": 1.0000000000000002}, {"source": 43, "target": 43, "value": 1.0000000000000002}, {"source": 45, "target": 45, "value": 1.0000000000000002}, {"source": 47, "target": 47, "value": 0.9999999999999999}, {"source": 50, "target": 50, "value": 1.0000000000000002}, {"source": 52, "target": 52, "value": 1.0}, {"source": 64, "target": 64, "value": 1.0}, {"source": 76, "target": 76, "value": 0.9999999999999998}, {"source": 76, "target": 604, "value": 0.6023442460127328}, {"source": 83, "target": 83, "value": 0.9999999999999998}, {"source": 86, "target": 86, "value": 1.0}, {"source": 88, "target": 88, "value": 1.0000000000000004}, {"source": 91, "target": 91, "value": 0.9999999999999999}, {"source": 94, "target": 94, "value": 1.0000000000000002}, {"source": 95, "target": 95, "value": 1.0}, {"source": 97, "target": 97, "value": 1.0}, {"source": 100, "target": 100, "value": 1.0}, {"source": 104, "target": 104, "value": 1.0000000000000002}, {"source": 106, "target": 106, "value": 1.0000000000000004}, {"source": 109, "target": 109, "value": 1.0000000000000002}, {"source": 113, "target": 113, "value": 1.0000000000000002}, {"source": 123, "target": 123, "value": 1.0}, {"source": 127, "target": 127, "value": 1.0000000000000002}, {"source": 133, "target": 133, "value": 1.0000000000000004}, {"source": 135, "target": 135, "value": 1.0000000000000002}, {"source": 137, "target": 137, "value": 1.0}, {"source": 141, "target": 141, "value": 0.9999999999999998}, {"source": 142, "target": 142, "value": 0.9999999999999998}, {"source": 149, "target": 149, "value": 1.0}, {"source": 153, "target": 153, "value": 0.9999999999999998}, {"source": 165, "target": 165, "value": 1.0000000000000002}, {"source": 167, "target": 167, "value": 0.9999999999999998}, {"source": 172, "target": 172, "value": 1.0000000000000002}, {"source": 172, "target": 378, "value": 0.6088817509095219}, {"source": 175, "target": 175, "value": 1.0}, {"source": 177, "target": 177, "value": 1.0}, {"source": 182, "target": 182, "value": 0.9999999999999999}, {"source": 187, "target": 187, "value": 1.0000000000000002}, {"source": 190, "target": 190, "value": 1.0000000000000002}, {"source": 197, "target": 197, "value": 1.0}, {"source": 198, "target": 198, "value": 1.0}, {"source": 199, "target": 199, "value": 1.0}, {"source": 203, "target": 203, "value": 0.9999999999999999}, {"source": 205, "target": 205, "value": 1.0}, {"source": 205, "target": 901, "value": 0.6154574548966638}, {"source": 209, "target": 209, "value": 1.0000000000000002}, {"source": 210, "target": 210, "value": 1.0000000000000002}, {"source": 214, "target": 214, "value": 1.0}, {"source": 216, "target": 216, "value": 1.0000000000000002}, {"source": 217, "target": 217, "value": 1.0}, {"source": 224, "target": 224, "value": 1.0000000000000002}, {"source": 225, "target": 225, "value": 1.0}, {"source": 231, "target": 231, "value": 1.0000000000000002}, {"source": 235, "target": 235, "value": 1.0}, {"source": 240, "target": 240, "value": 1.0000000000000004}, {"source": 244, "target": 244, "value": 0.9999999999999999}, {"source": 246, "target": 246, "value": 1.0}, {"source": 247, "target": 247, "value": 1.0}, {"source": 255, "target": 255, "value": 0.9999999999999998}, {"source": 273, "target": 273, "value": 1.0}, {"source": 273, "target": 772, "value": 0.6123724356957946}, {"source": 276, "target": 276, "value": 1.0}, {"source": 279, "target": 279, "value": 1.0000000000000002}, {"source": 283, "target": 283, "value": 1.0}, {"source": 284, "target": 284, "value": 1.0000000000000002}, {"source": 287, "target": 287, "value": 1.0}, {"source": 292, "target": 292, "value": 1.0}, {"source": 294, "target": 294, "value": 1.0000000000000004}, {"source": 295, "target": 295, "value": 0.9999999999999998}, {"source": 297, "target": 297, "value": 0.9999999999999999}, {"source": 299, "target": 299, "value": 1.0000000000000002}, {"source": 309, "target": 309, "value": 1.0000000000000002}, {"source": 309, "target": 727, "value": 0.6123724356957946}, {"source": 313, "target": 313, "value": 0.9999999999999999}, {"source": 315, "target": 315, "value": 1.0000000000000002}, {"source": 318, "target": 318, "value": 0.9999999999999999}, {"source": 320, "target": 320, "value": 1.0}, {"source": 324, "target": 324, "value": 1.0000000000000002}, {"source": 326, "target": 326, "value": 1.0}, {"source": 326, "target": 459, "value": 0.7037315505489967}, {"source": 330, "target": 330, "value": 0.9999999999999999}, {"source": 331, "target": 331, "value": 1.0}, {"source": 337, "target": 337, "value": 0.9999999999999999}, {"source": 338, "target": 338, "value": 1.0}, {"source": 340, "target": 340, "value": 0.9999999999999998}, {"source": 341, "target": 341, "value": 0.9999999999999999}, {"source": 344, "target": 344, "value": 1.0}, {"source": 346, "target": 346, "value": 1.0000000000000002}, {"source": 348, "target": 348, "value": 0.9999999999999994}, {"source": 349, "target": 349, "value": 0.9999999999999998}, {"source": 350, "target": 350, "value": 1.0000000000000002}, {"source": 351, "target": 351, "value": 1.0000000000000002}, {"source": 352, "target": 352, "value": 1.0000000000000002}, {"source": 358, "target": 358, "value": 1.0000000000000002}, {"source": 359, "target": 359, "value": 0.9999999999999997}, {"source": 360, "target": 360, "value": 1.0}, {"source": 364, "target": 364, "value": 1.0}, {"source": 368, "target": 368, "value": 1.0}, {"source": 372, "target": 372, "value": 1.0}, {"source": 373, "target": 373, "value": 1.0}, {"source": 377, "target": 377, "value": 1.0000000000000002}, {"source": 378, "target": 378, "value": 0.9999999999999998}, {"source": 381, "target": 381, "value": 1.0000000000000004}, {"source": 382, "target": 382, "value": 1.0000000000000002}, {"source": 383, "target": 383, "value": 0.9999999999999997}, {"source": 387, "target": 387, "value": 1.0}, {"source": 391, "target": 391, "value": 1.0}, {"source": 392, "target": 392, "value": 1.0000000000000002}, {"source": 392, "target": 399, "value": 1.0000000000000002}, {"source": 397, "target": 397, "value": 1.0}, {"source": 399, "target": 399, "value": 1.0000000000000002}, {"source": 404, "target": 404, "value": 0.9999999999999999}, {"source": 405, "target": 405, "value": 0.9999999999999998}, {"source": 409, "target": 409, "value": 0.9999999999999998}, {"source": 409, "target": 901, "value": 0.6172133998483676}, {"source": 411, "target": 411, "value": 0.9999999999999999}, {"source": 416, "target": 416, "value": 1.0000000000000002}, {"source": 421, "target": 421, "value": 1.0}, {"source": 427, "target": 427, "value": 0.9999999999999998}, {"source": 430, "target": 430, "value": 1.0000000000000004}, {"source": 431, "target": 431, "value": 1.0}, {"source": 432, "target": 432, "value": 1.0}, {"source": 434, "target": 434, "value": 1.0000000000000002}, {"source": 434, "target": 837, "value": 0.6172133998483676}, {"source": 444, "target": 444, "value": 1.0000000000000002}, {"source": 448, "target": 448, "value": 1.0}, {"source": 454, "target": 454, "value": 1.0}, {"source": 459, "target": 459, "value": 1.0}, {"source": 462, "target": 462, "value": 0.9999999999999999}, {"source": 463, "target": 463, "value": 1.0}, {"source": 463, "target": 1007, "value": 0.6666666666666666}, {"source": 464, "target": 464, "value": 1.0}, {"source": 466, "target": 466, "value": 0.9999999999999998}, {"source": 474, "target": 474, "value": 0.9999999999999999}, {"source": 479, "target": 479, "value": 1.0}, {"source": 480, "target": 480, "value": 1.0000000000000002}, {"source": 481, "target": 481, "value": 1.0}, {"source": 486, "target": 486, "value": 0.9999999999999998}, {"source": 487, "target": 487, "value": 1.0000000000000002}, {"source": 488, "target": 488, "value": 1.0}, {"source": 491, "target": 491, "value": 1.0}, {"source": 495, "target": 495, "value": 1.0}, {"source": 498, "target": 498, "value": 1.0}, {"source": 500, "target": 500, "value": 1.0}, {"source": 501, "target": 501, "value": 0.9999999999999999}, {"source": 501, "target": 503, "value": 0.9128709291752769}, {"source": 502, "target": 502, "value": 1.0}, {"source": 503, "target": 503, "value": 1.0000000000000002}, {"source": 506, "target": 506, "value": 0.9999999999999998}, {"source": 508, "target": 508, "value": 0.9999999999999998}, {"source": 511, "target": 511, "value": 0.9999999999999999}, {"source": 512, "target": 512, "value": 1.0000000000000002}, {"source": 516, "target": 516, "value": 1.0}, {"source": 518, "target": 518, "value": 1.0}, {"source": 519, "target": 519, "value": 1.0000000000000002}, {"source": 527, "target": 527, "value": 1.0}, {"source": 535, "target": 535, "value": 1.0000000000000002}, {"source": 537, "target": 537, "value": 1.0}, {"source": 553, "target": 553, "value": 0.9999999999999999}, {"source": 554, "target": 554, "value": 1.0}, {"source": 559, "target": 559, "value": 0.9999999999999998}, {"source": 561, "target": 561, "value": 1.0000000000000002}, {"source": 567, "target": 567, "value": 1.0000000000000002}, {"source": 568, "target": 568, "value": 0.9999999999999999}, {"source": 573, "target": 573, "value": 1.0000000000000002}, {"source": 577, "target": 577, "value": 1.0000000000000002}, {"source": 581, "target": 581, "value": 1.0000000000000002}, {"source": 583, "target": 583, "value": 1.0}, {"source": 593, "target": 593, "value": 1.0000000000000002}, {"source": 602, "target": 602, "value": 1.0}, {"source": 603, "target": 603, "value": 1.0000000000000002}, {"source": 604, "target": 604, "value": 1.0000000000000002}, {"source": 607, "target": 607, "value": 0.9999999999999997}, {"source": 609, "target": 609, "value": 0.9999999999999999}, {"source": 610, "target": 610, "value": 1.0000000000000002}, {"source": 622, "target": 622, "value": 1.0}, {"source": 624, "target": 624, "value": 1.0000000000000002}, {"source": 632, "target": 632, "value": 0.9999999999999996}, {"source": 633, "target": 633, "value": 1.0}, {"source": 634, "target": 634, "value": 0.9999999999999998}, {"source": 634, "target": 799, "value": 0.65243825430126}, {"source": 635, "target": 635, "value": 0.9999999999999998}, {"source": 641, "target": 641, "value": 1.0000000000000002}, {"source": 648, "target": 648, "value": 0.9999999999999999}, {"source": 649, "target": 649, "value": 1.0000000000000002}, {"source": 663, "target": 663, "value": 1.0}, {"source": 664, "target": 664, "value": 0.9999999999999999}, {"source": 665, "target": 665, "value": 1.0}, {"source": 668, "target": 668, "value": 1.0}, {"source": 669, "target": 669, "value": 1.0000000000000004}, {"source": 670, "target": 670, "value": 1.0}, {"source": 670, "target": 883, "value": 0.6681531047810609}, {"source": 671, "target": 671, "value": 1.0}, {"source": 679, "target": 679, "value": 0.9999999999999998}, {"source": 686, "target": 686, "value": 0.9999999999999999}, {"source": 693, "target": 693, "value": 1.0000000000000002}, {"source": 695, "target": 695, "value": 1.0}, {"source": 701, "target": 701, "value": 0.9999999999999998}, {"source": 706, "target": 706, "value": 1.0000000000000002}, {"source": 709, "target": 709, "value": 1.0}, {"source": 709, "target": 780, "value": 0.8660254037844388}, {"source": 714, "target": 714, "value": 0.9999999999999998}, {"source": 719, "target": 719, "value": 0.9999999999999997}, {"source": 719, "target": 780, "value": 0.6546536707079772}, {"source": 719, "target": 827, "value": 0.7142857142857141}, {"source": 723, "target": 723, "value": 1.0000000000000004}, {"source": 724, "target": 724, "value": 1.0}, {"source": 725, "target": 725, "value": 0.9999999999999999}, {"source": 727, "target": 727, "value": 1.0}, {"source": 727, "target": 772, "value": 0.6123724356957946}, {"source": 730, "target": 730, "value": 0.9999999999999998}, {"source": 734, "target": 734, "value": 0.9999999999999996}, {"source": 736, "target": 736, "value": 1.0}, {"source": 740, "target": 740, "value": 0.9999999999999997}, {"source": 741, "target": 741, "value": 1.0}, {"source": 742, "target": 742, "value": 1.0000000000000002}, {"source": 750, "target": 750, "value": 1.0}, {"source": 750, "target": 827, "value": 0.6172133998483676}, {"source": 754, "target": 754, "value": 1.0}, {"source": 760, "target": 760, "value": 1.0000000000000002}, {"source": 760, "target": 860, "value": 0.6585527740981747}, {"source": 762, "target": 762, "value": 0.9999999999999997}, {"source": 763, "target": 763, "value": 1.0}, {"source": 765, "target": 765, "value": 1.0000000000000002}, {"source": 768, "target": 768, "value": 1.0000000000000002}, {"source": 769, "target": 769, "value": 1.0000000000000002}, {"source": 772, "target": 772, "value": 1.0000000000000002}, {"source": 780, "target": 780, "value": 1.0000000000000002}, {"source": 781, "target": 781, "value": 0.9999999999999999}, {"source": 782, "target": 782, "value": 0.9999999999999996}, {"source": 785, "target": 785, "value": 0.9999999999999999}, {"source": 787, "target": 787, "value": 1.0000000000000002}, {"source": 791, "target": 791, "value": 1.0000000000000002}, {"source": 796, "target": 796, "value": 0.9999999999999999}, {"source": 797, "target": 797, "value": 1.0000000000000002}, {"source": 799, "target": 799, "value": 1.0}, {"source": 801, "target": 801, "value": 1.0000000000000002}, {"source": 802, "target": 802, "value": 1.0000000000000002}, {"source": 803, "target": 803, "value": 1.0000000000000002}, {"source": 809, "target": 809, "value": 0.9999999999999997}, {"source": 810, "target": 810, "value": 1.0000000000000004}, {"source": 811, "target": 811, "value": 1.0}, {"source": 812, "target": 812, "value": 1.0}, {"source": 814, "target": 814, "value": 0.9999999999999997}, {"source": 815, "target": 815, "value": 1.0}, {"source": 818, "target": 818, "value": 0.9999999999999998}, {"source": 824, "target": 824, "value": 1.0000000000000002}, {"source": 826, "target": 826, "value": 1.0}, {"source": 827, "target": 827, "value": 0.9999999999999997}, {"source": 831, "target": 831, "value": 1.0}, {"source": 837, "target": 837, "value": 0.9999999999999997}, {"source": 839, "target": 839, "value": 1.0000000000000002}, {"source": 839, "target": 897, "value": 0.6168870908644986}, {"source": 858, "target": 858, "value": 0.9999999999999999}, {"source": 860, "target": 860, "value": 1.0}, {"source": 862, "target": 862, "value": 1.0000000000000002}, {"source": 863, "target": 863, "value": 0.9999999999999998}, {"source": 867, "target": 867, "value": 1.0}, {"source": 869, "target": 869, "value": 1.0}, {"source": 872, "target": 872, "value": 0.9999999999999998}, {"source": 880, "target": 880, "value": 1.0000000000000002}, {"source": 883, "target": 883, "value": 0.9999999999999999}, {"source": 886, "target": 886, "value": 1.0}, {"source": 897, "target": 897, "value": 1.0000000000000004}, {"source": 897, "target": 989, "value": 0.6015221385341629}, {"source": 900, "target": 900, "value": 1.0000000000000002}, {"source": 901, "target": 901, "value": 1.0000000000000002}, {"source": 906, "target": 906, "value": 0.9999999999999999}, {"source": 917, "target": 917, "value": 0.9999999999999999}, {"source": 918, "target": 918, "value": 0.9999999999999997}, {"source": 921, "target": 921, "value": 1.0000000000000002}, {"source": 929, "target": 929, "value": 1.0000000000000002}, {"source": 930, "target": 930, "value": 1.0000000000000004}, {"source": 940, "target": 940, "value": 0.9999999999999998}, {"source": 941, "target": 941, "value": 0.9999999999999997}, {"source": 943, "target": 943, "value": 1.0}, {"source": 945, "target": 945, "value": 1.0}, {"source": 947, "target": 947, "value": 1.0000000000000002}, {"source": 952, "target": 952, "value": 0.9999999999999999}, {"source": 953, "target": 953, "value": 1.0}, {"source": 954, "target": 954, "value": 1.0}, {"source": 968, "target": 968, "value": 0.9999999999999998}, {"source": 969, "target": 969, "value": 0.9999999999999998}, {"source": 974, "target": 974, "value": 0.9999999999999999}, {"source": 985, "target": 985, "value": 0.9999999999999999}, {"source": 985, "target": 1005, "value": 0.6240377207533827}, {"source": 988, "target": 988, "value": 0.9999999999999998}, {"source": 989, "target": 989, "value": 1.0000000000000002}, {"source": 1005, "target": 1005, "value": 0.9999999999999999}, {"source": 1006, "target": 1006, "value": 0.9999999999999999}, {"source": 1007, "target": 1007, "value": 1.0}, {"source": 1010, "target": 1010, "value": 1.0000000000000002}, {"source": 1019, "target": 1019, "value": 1.0000000000000002}, {"source": 1023, "target": 1023, "value": 1.0000000000000002}, {"source": 1028, "target": 1028, "value": 0.9999999999999999}, {"source": 1029, "target": 1029, "value": 0.9999999999999998}, {"source": 1030, "target": 1030, "value": 0.9999999999999998}, {"source": 1039, "target": 1039, "value": 1.0}, {"source": 1044, "target": 1044, "value": 1.0000000000000002}, {"source": 1045, "target": 1045, "value": 1.0}]}